[{"text": "@BKuppersmith Coming soon", "author": "elonmusk"}, {"text": "@OlejAndersen Once 5.9 is rolled out to the whole fleet and all looks good, we will roll out 6.0 to owners on our public beta program", "author": "elonmusk"}, {"text": "@OlejAndersen Some challenges w 5.9 rollout, as it contains software specially written for car owners in Norway & Belgium", "author": "elonmusk"}, {"text": "Review of Model S by @BBC_TopGear much appreciated http://t.co/5PmhlfAIVn", "author": "elonmusk"}, {"text": "Announcing a revolutionary Tesla driving technology http://t.co/8QCmjGpLOR", "author": "elonmusk"}, {"text": "Snowed in at Mt. Rushmore @GoParks http://t.co/X6G7CeArPB", "author": "elonmusk"}, {"text": "Now having breakfast at ... http://t.co/8tGI3L0iGg", "author": "elonmusk"}, {"text": "Just stayed at the Rocket (yes!) Motel near Mt Rushmore. Sudden blizzard making road trip tricky http://t.co/TRIPC7dKwK", "author": "elonmusk"}, {"text": "@cairnz 80% to 30%", "author": "elonmusk"}, {"text": "RT @TeslaMotors: Consumer groups say manufacturers like Tesla \"should be able to sell directly if they want and buyers would benefit\" http:…", "author": "elonmusk"}, {"text": "@FlateFred agreed", "author": "elonmusk"}, {"text": "RT @BadAstronomer: Astronomers find the twisted fingerprints of cosmic inflation in the background glow of the Universe. http://t.co/1rgatt…", "author": "elonmusk"}, {"text": "Russian state TV threatens US with nuclear war, showing missile arc & mushroom cloud images http://t.co/B4ARd2fdb8", "author": "elonmusk"}, {"text": "Regarding Gov. Christie's action to impede direct sales of automobiles in New Jersey http://t.co/v92hjzSKne", "author": "elonmusk"}, {"text": "Working on a Model S environmental impact blog this weekend to counteract BS like the @Bloomberg graphite story. Beyond ridiculous...", "author": "elonmusk"}, {"text": "@jnags92 Yes, I'm confident that Tesla will do something with them.", "author": "elonmusk"}, {"text": "@TeamAizek Not true. The amount of graphite in our car is small, comes from Japan and is mined in a very clean way.", "author": "elonmusk"}, {"text": "@X4NWO Well, now that Satoshi Nakamoto has been discovered, I guess it is case closed ... :)", "author": "elonmusk"}, {"text": "Just discovered a great Tesla ad made by 2 recent college grads. I love it! http://t.co/20dPRD9yrJ", "author": "elonmusk"}, {"text": "RT @TeslaMotors: If you're in NJ, please come support Tesla at the NJ Motor Vehicle Commission HQ Tues at 2p. 222 E State St., 8th Floor Ea…", "author": "elonmusk"}, {"text": "New Jersey auto dealers subverting democratic process to try to block Tesla sales http://t.co/PLY97W1oh0", "author": "elonmusk"}, {"text": "Interesting “@om:Physicist proposes a new type of computing at SXSW. Check out orbital computing http://t.co/9tawuy5dMc\"", "author": "elonmusk"}, {"text": "RT @TeslaMS60: Arrived in #hawthorne completing 7740 mile round trip #coasttocoasttocoast in a @TeslaMotors #modelS60 in 9.5 days. For free.", "author": "elonmusk"}, {"text": "@gordon_tindall Yeah, I'm giving a talk for homeless kids at the Union Rescue Mission in LA", "author": "elonmusk"}, {"text": "@TeslaRoadTrip Thanks, I really appreciate your support!", "author": "elonmusk"}, {"text": "About to testify before Senate against ULA (Lockheed and Boeing) monopoly contract for national security launches", "author": "elonmusk"}, {"text": "Model S receives highest customer satisfaction score of any car ever surveyed by Consumer Reports http://t.co/wHF5SUoZJi", "author": "elonmusk"}, {"text": "All four landing legs now mounted on Falcon 9 http://t.co/5ZNG1NflsG", "author": "elonmusk"}, {"text": "However, F9 will continue to land in the ocean until we prove precision control from hypersonic thru subsonic regimes", "author": "elonmusk"}, {"text": "Mounting landing legs (~60 ft span) to Falcon 9 for next month's Space Station servicing flight http://t.co/zyfazr2BB2", "author": "elonmusk"}, {"text": "RT @wendelljopson: There's a rally against anti-Tesla bills #HB2524 and #SB6272 @ WA State Capital right now. @teslamotors @elonmusk http:/…", "author": "elonmusk"}, {"text": "RT @HighTechJoe: What happens when a @TeslaMotors Model S get rear ended? #tank #amazing http://t.co/GgEaFTKKdZ", "author": "elonmusk"}, {"text": "Welcome back Jade Rabbit! #Yutu http://t.co/5tOmLEJUfG", "author": "elonmusk"}, {"text": "Auto dealers trying to pass a law to enforce their monopoly in Ohio & prevent consumer choice... http://t.co/VQdMAZqGwR", "author": "elonmusk"}, {"text": "Tesla V6 software upload coming soon. Need to make sure it is \"awesome\" - Lord Business", "author": "elonmusk"}, {"text": "Saw The Lego Movie earlier today. Brilliant writing and humor! Loved the \"Everything is awesome...\" theme song.", "author": "elonmusk"}, {"text": "Value is holding up \"Tesla car is worth more used than new | MNN - http://t.co/NLLdo1jBzM\"", "author": "elonmusk"}, {"text": "Tesla LA to NY Supercharger rally just completed in 76 hours across northern route in dead of winter thru heavy snow!", "author": "elonmusk"}, {"text": "Tesla cars are now in all 50 US states (map credit Edmunds)! http://t.co/ehq2Muu5cr", "author": "elonmusk"}, {"text": "RT @plugshare: Congratulations to John and Jill, first to drive across US using only free @TeslaMotors Superchargers! http://t.co/hA6YlkyjzN", "author": "elonmusk"}, {"text": "Two teams from Tesla aiming to set a cross-country EV speed record this week. Departing Fri from LA, arriving Sun in NY.", "author": "elonmusk"}, {"text": "Will be doing the LA-NY family road trip over Spring Break. Made everyone watch National Lampoon's Vacation as prep.", "author": "elonmusk"}, {"text": "Tesla Supercharger network now energized from New York to LA, both coast + Texas! Approx 80% of US population covered.", "author": "elonmusk"}, {"text": "Tesla policy is to charge the same price (+ taxes & shipping) everywhere in the world http://t.co/cXOtokcBeG", "author": "elonmusk"}, {"text": "RT @TeslaMotors: Revenue expected to exceed guidance by 20% in Q4 2013 thanks to Model S' stellar safety record & winter performance: http:…", "author": "elonmusk"}, {"text": "RT @TheOnion: A combination of hubris, treachery, and low prices will mark the end of your reign as Mattress King | Horoscopes: http://t.co…", "author": "elonmusk"}, {"text": "Rough cut of Falcon 9 Thaicom flight http://t.co/aC3k4neWie", "author": "elonmusk"}, {"text": "RT @SpaceX: [PHOTO] LIFTOFF of SpaceX’s Falcon 9 rocket carrying the THAICOM 6 satellite to geosynchronous transfer orbit. http://t.co/Pqtj…", "author": "elonmusk"}, {"text": "RT @SpaceX: Falcon 9 has successfully deployed THAICOM 6 into its target orbit", "author": "elonmusk"}, {"text": "@westcoastbill Thanks Bill! Sure is a great start to 2014 :)", "author": "elonmusk"}, {"text": "Preparing to launch a Thaicom satellite to geostationary super-sync orbit at 5pm Florida time http://t.co/cEq8TEXeo6", "author": "elonmusk"}, {"text": "@olajahr @TeslaMotors Ideally, the S should just hold position when it knows that's what you really want", "author": "elonmusk"}, {"text": "@bonnienorman @TeslaMotors @TeslaMotorsClub Merry Christmas!", "author": "elonmusk"}, {"text": "RT @TeslaMotors: NHTSA has reaffirmed the 5-star safety rating of Model S for 2014, confirming the highest safety rating in America! http:/…", "author": "elonmusk"}, {"text": "@simonhackett Yes, definitely needs a huge amount of battery capacity. ~1/3 of energy produced during day must be stored", "author": "elonmusk"}, {"text": "This is why I think solar power will be the primary long term solution http://t.co/WNa12OVj5P", "author": "elonmusk"}, {"text": "@arcaresenal true", "author": "elonmusk"}, {"text": "220 ft tall mobile crane to carry the rocket around in the vertical http://t.co/hgXnpEh8yU", "author": "elonmusk"}, {"text": "RT @TeslaMotors: Learn what it's like to own Model S in the winter and how it performs in the sub-zero temperatures of Norway: http://t.co/…", "author": "elonmusk"}, {"text": "RT @RyanHasson_: @elonmusk the Tesla showroom in Amsterdam is unbelievable! #ElectricCarsFTW http://t.co/5EGt0d0CzS", "author": "elonmusk"}, {"text": "SolarCity launches Give Power Foundation http://t.co/Ag63gyLBRP", "author": "elonmusk"}, {"text": "RT @bonnienorman: @teslaMotors @elonmusk Santa came early this year for a little girl in Texas, thanks to #Tesla. http://t.co/SpNbOVx3ZB  #…", "author": "elonmusk"}, {"text": "Sock monkey of destruction! http://t.co/KqvXWDFmrr", "author": "elonmusk"}, {"text": "Rest in peace, Nelson Mandela. A man both good and great.", "author": "elonmusk"}, {"text": "Should mention that the battery cells used for this are 200 Wh/kg vs 250 for Model S. No short term supply constraint.", "author": "elonmusk"}, {"text": "Solar power w batteries will be the primary (not exclusive) means of sustainable energy production http://t.co/rvXBzQXbsc", "author": "elonmusk"}, {"text": "View of Earth from upper stage rear view camera at 8,000 miles http://t.co/V4tdMUA48X", "author": "elonmusk"}, {"text": "RT @SpaceX: [PHOTO] Falcon 9 and SES-8 liftoff from SpaceX's launch pad at Cape Canaveral http://t.co/fucwgYH0s5", "author": "elonmusk"}, {"text": "Restart was good, apogee raised to 80k km (50k miles). Yes!!!", "author": "elonmusk"}, {"text": "Reached parking orbit. Now coasting towards equator, where the upper stage will, if all goes well, restart to raise apogee", "author": "elonmusk"}, {"text": "Live video feed of launch at http://t.co/Oo569cuarz", "author": "elonmusk"}, {"text": "About an hour away from launch. I'd like to thank @SES_Satellites for taking a chance on @SpaceX. We've given it our all.", "author": "elonmusk"}, {"text": "@toruonu cool :)", "author": "elonmusk"}, {"text": "@UFrugger10 I agree. Will be restored shortly.", "author": "elonmusk"}, {"text": "RT @Jon_Favreau: An Amazon drone just flew away with my dog.", "author": "elonmusk"}, {"text": "@TierraUniversu It was fixed this weekend, so he should try the test again.", "author": "elonmusk"}, {"text": "@TierraUniversu The writer of this article had a problem with his 12V battery, so main pack was constantly charging it.", "author": "elonmusk"}, {"text": "@TierraUniversu Doesn't sound right. If it is, we certainly need to fix it. Investigating...", "author": "elonmusk"}, {"text": "German govt reviews Tesla Model S fires. All due to high speed impacts, no injuries. Concludes: no defects, no recall http://t.co/24iZzOSL3B", "author": "elonmusk"}, {"text": "All known rocket anomalies resolved. Will spend another day rechecking to be sure. Launch attempt tmrw eve w Wed as backup.", "author": "elonmusk"}, {"text": "The gas generator is a small rocket engine that powers the turbopump, which produces 7000 horsepower & weighs 160 lbs", "author": "elonmusk"}, {"text": "Engines are cycling cleanly w ground pneumatics. Replaced gas generator on engine 9 (center) as a precautionary measure.", "author": "elonmusk"}, {"text": "Abort was caused by oxygen in ground side TEA-TEB. Upper stage on separate internal circuit, so doesn't face same risk.", "author": "elonmusk"}, {"text": "Rocket engines are healthy, but cleaning turbopump gas generators will take another day. Aiming for Mon eve launch.", "author": "elonmusk"}, {"text": "@WilliamShatner Will do. Probably at least a few days. Depends on whether we need to pull the turbopumps.", "author": "elonmusk"}, {"text": "We called manual abort. Better to be paranoid and wrong. Bringing rocket down to borescope engines ...", "author": "elonmusk"}, {"text": "If launch aborts, we will bring the rocket down for engine inspection, so probably a few days before next attempt", "author": "elonmusk"}, {"text": "Increasing helium spin start pressure. Probably <50% chance of passing all aborts, but worth a try. Countdown resuming ...", "author": "elonmusk"}, {"text": "Launch aborted by autosequence due to slower than expected thrust ramp. Seems ok on closer inspection. Cycling countdown.", "author": "elonmusk"}, {"text": "Live stream of launch at http://t.co/Oo569cuarz", "author": "elonmusk"}, {"text": "15 mins to liftoff http://t.co/3jDrHRSPQZ", "author": "elonmusk"}, {"text": "@lomac92 @WIRED No, almost all fuel/ox is being reserved for SES satellite to give max chance of success", "author": "elonmusk"}, {"text": "Model S Owner drives 3121 miles solo from Canada to Mexico http://t.co/8G8l1utgS2", "author": "elonmusk"}, {"text": "Good description of the launch by @WIRED: http://t.co/QnLhvviEAn", "author": "elonmusk"}, {"text": "Don't actually mean to knock Honda -- their cars are solid -- but the park outside (or yr house might burn down) advice was awesome", "author": "elonmusk"}, {"text": "@AdamMKE Model S can seat 5 adults, two kids and has a front trunk for luggage. Might work for you.", "author": "elonmusk"}, {"text": "...but only if you like your house \"Honda recalls Fit for fire risk, says park it outside http://t.co/tLpZ7HBIdV \"", "author": "elonmusk"}, {"text": "RT @SpaceX: Falcon 9 launch window opens tmrw at 5:39pm EST. Watch LIVE at http://t.co/wytY3mnBf1. Happy #Spacegiving! http://t.co/leacczWC…", "author": "elonmusk"}, {"text": "RT @mgalimany: @TeslaMotors @elonmusk This is what happens when your car is not a #Tesla Model S.", "author": "elonmusk"}, {"text": "RT @williamwinters: Ford issues 4th and 5th recalls for 2013 Escapes spontaneously catching fire. Not in the mainstream media. @elonmusk ht…", "author": "elonmusk"}, {"text": "Saw pressure fluctuations on Falcon boost stage liquid oxygen tank. Want to be super careful, so pushing launch to Thurs.", "author": "elonmusk"}, {"text": "RT @SpaceX: Falcon 9 targeted to launch SES-8 for @SES_Satellites tmrw. 1st SpaceX GEO transfer mission. http://t.co/wytY3mnBf1 http://t.co…", "author": "elonmusk"}, {"text": "At Disney World w kids for traditional prelaunch visit (first good flight was after riding Space Mountain)", "author": "elonmusk"}, {"text": "Launch can be viewed live from Cape causeways or via http://t.co/soOCggCpN0 webcast around 5:30 local time on Monday", "author": "elonmusk"}, {"text": "@DarkSapiens Easier to make the plane change to equatorial orbit. Done in order to reduce satellite side delta V from 1800 m/s to 1500 m/s.", "author": "elonmusk"}, {"text": "Will be toughest mission to date. Requires coast + upper stage restart + going to 80,000 km altitude (~1/4 way to moon).", "author": "elonmusk"}, {"text": "Headed to Cape Canaveral tomorrow for first @SpaceX geostationary satellite launch.", "author": "elonmusk"}, {"text": "Tesla Model S Consumer Reports customer satisfaction survey highest of any car on road at 99/100 http://t.co/PpuS01S2KN", "author": "elonmusk"}, {"text": "Tesla is also extending the Model S warranty to cover any fire damage even if due solely to a driver accident", "author": "elonmusk"}, {"text": "What makes this incredibly unjust is that the Model S to date has the best safety record of any car on the road (no injuries or deaths ever)", "author": "elonmusk"}, {"text": "Why does a Tesla fire w no injury get more media headlines than 100,000 gas car fires that kill 100s of people per year?", "author": "elonmusk"}, {"text": "Mission of Tesla  http://t.co/UchbT5NZE3", "author": "elonmusk"}, {"text": "SuperDraco rocket engine fired at full thrust w a printed Inconel chamber. Used for Dragon escape & landing http://t.co/HjWEayLlBN", "author": "elonmusk"}, {"text": "In other news, George Clooney reports that his iPhone 1 had a bug back in '07", "author": "elonmusk"}, {"text": "Model S owner blogs about TN accident http://t.co/93Fz8WEwOU", "author": "elonmusk"}, {"text": "Thanks Woz! \"@stevewoz: Here to pick up my new car! (at @TeslaMotors w/ 2 others)\"", "author": "elonmusk"}, {"text": "Tesla West Coast Supercharger network now energized. Travel from Vancouver to Tijuana in styel! http://t.co/gTvV9egg3K", "author": "elonmusk"}, {"text": "Giant dog topiary in Bilbao http://t.co/kHdAMvOEMN", "author": "elonmusk"}, {"text": "Rocket flight to 744m, hover & return to launch pad (close shot from hexacopter drone) http://t.co/vyJSUbZo2R", "author": "elonmusk"}, {"text": "About the Model S fire ... http://t.co/7LSBaNbnyd", "author": "elonmusk"}, {"text": "@DebbieViviers @SpaceX Yes, upper stage venting of liquid oxygen created a fast moving fuzzy white sphere in space over SA", "author": "elonmusk"}, {"text": "Between this flight & Grasshopper tests, I think we now have all the pieces of the puzzle to bring the rocket back home.", "author": "elonmusk"}, {"text": "Rocket booster relit twice (supersonic retro & landing), but spun up due to aero torque, so fuel centrifuged & we flamed out", "author": "elonmusk"}, {"text": "Launch was good. All satellites deployed at the targeted orbit insertion vectors. http://t.co/SUYMH7W9pH", "author": "elonmusk"}, {"text": "You can watch the launch at http://t.co/2ZSXeqWKvy http://t.co/u5VEUgRu8g", "author": "elonmusk"}, {"text": "Looks good for a launch attempt today. Upper winds slightly exceed loads in high subsonic regime, but improving.", "author": "elonmusk"}, {"text": "Water ice on Mars http://t.co/fPz1OF7EXI", "author": "elonmusk"}, {"text": "RT @ID_AA_Carmack: @elonmusk @BadAstronomer We actually are outside some of the IPCC prediction ranges from 20 years ago http://t.co/WOLZlZ…", "author": "elonmusk"}, {"text": "Sensible piece on status of climate change by @BadAstronomer http://t.co/Nxm7PX6cpi", "author": "elonmusk"}, {"text": "Falcon 9 launch window is Sunday and Monday, assuming good weather at Vandenberg Air Force Base", "author": "elonmusk"}, {"text": "Good progress harnessing that big fusion reactor in the sky http://t.co/MZR8sQRE5E", "author": "elonmusk"}, {"text": "Good Hyperloop feedback from Ansys. Am excited by how much it can be improved by open src contributions! http://t.co/bD0u3roBd0", "author": "elonmusk"}, {"text": "Completed rocket static fire with all systems green this time. Launch window opens in 10 days http://t.co/rKVBLIk6yq", "author": "elonmusk"}, {"text": "Falcon 9 at sunset http://t.co/CeXSwqjVHP", "author": "elonmusk"}, {"text": "Am happy to hear that GM plans to develop an affordable 200 mile range electric car. Right target. Hope others do same.", "author": "elonmusk"}, {"text": "Approach is 360 deg flush mounted tiny cameras + radar (prob not lidar). Lot of software & hardware level image processing.", "author": "elonmusk"}, {"text": "Engineers interested in working on autonomous driving, pls email autopilot@teslamotors.com. Team will report directly to me.", "author": "elonmusk"}, {"text": "Intense effort underway at Tesla to develop a practical autopilot system for Model S", "author": "elonmusk"}, {"text": "Will do another static fire of rocket to make sure all is good & AF needs to test ICBMs, so probable launch Sept 29/30.", "author": "elonmusk"}, {"text": "Full thrust achieved on 2 sec static fire. Some anomalies to be investigated, so launch date tbd.", "author": "elonmusk"}, {"text": "Upcoming Falcon 9 demo has a lot of new technology, so the probability of failure is significant http://t.co/PfnGeEaaWq", "author": "elonmusk"}, {"text": "First of next gen Falcon 9 rockets rolls out to the launch pad at Vandenberg Air Force Base http://t.co/hNl6zKodvr", "author": "elonmusk"}, {"text": "MT “@johnnyhotts: @WIRED Correction: Japan's levitating train hit 361 MPH", "author": "elonmusk"}, {"text": "It is crazy that the proposed California high speed rail only goes 200 mph w avg speed of 130 mph when Japan is 300 mph+", "author": "elonmusk"}, {"text": "RT @WIRED: Japan’s L-Zero maglev train hit 310 mph in a demonstration last week. And it's pretty awesome looking. http://t.co/GAWqyil6OQ", "author": "elonmusk"}, {"text": "Video review of Model S vs. Aston Martin Rapide S by @Autocar http://t.co/14cLl20jMP", "author": "elonmusk"}, {"text": "SpaceX SuperDraco inconel rocket chamber w regen cooling jacket emerges from EOS 3D metal printer http://t.co/Tj284OuAk1", "author": "elonmusk"}, {"text": "Designing a rocket part w hand gestures & then 3D printing it in a metal superalloy ... http://t.co/h3KoyAb0Lt", "author": "elonmusk"}, {"text": "Was at Vandenberg today going over the upcoming next gen F9 rocket launch. Some tense days ahead http://t.co/bfXnFt7alm", "author": "elonmusk"}, {"text": "@Jon_Favreau Yup. We saw it in the movie and made it real. Good idea!", "author": "elonmusk"}, {"text": "Will post video next week of designing a rocket part with hand gestures & then immediately printing it in titanium", "author": "elonmusk"}, {"text": "And, uhh no (zillionth person who asked), I am not going to make an IM suit, however design by hand-manipulated hologram is actually useful.", "author": "elonmusk"}, {"text": "@brynmooser Reality is the best illusion", "author": "elonmusk"}, {"text": "We figured out how to design rocket parts just w hand movements through the air (seriously). Now need a high frame rate holograph generator.", "author": "elonmusk"}, {"text": "Model S achieves best safety rating of any car ever tested by US govt http://t.co/W1rZ5ceEVX", "author": "elonmusk"}, {"text": "Same rocket flight, but this time with cows! http://t.co/qhF5JWzyCW", "author": "elonmusk"}, {"text": "Latest rocket test flight: hard lateral deviation, stabilize & hover, rapid descent back to pad http://t.co/Vb7ebiMdNJ", "author": "elonmusk"}, {"text": "Btw, this is not the very latest version. Will post an updated version with several late arriving corrections in a few hours.", "author": "elonmusk"}, {"text": "Hyperloop Alpha at http://t.co/ZRTcT2b8bP and http://t.co/7cucKKprPB http://t.co/LYhuRxUntA", "author": "elonmusk"}, {"text": "Pulled all nighter working on Hyperloop (as did others). Hopefully not too many mistakes. Will publish link at 1:30 PDT.", "author": "elonmusk"}, {"text": "Hangout with @richardbranson & me tomorrow at 9am California time http://t.co/0ELMam5wXq", "author": "elonmusk"}, {"text": "“@eirene_inc: “The universe is prob littered w/ the 1-planet graves of cultures which made the sensible economic http://t.co/Bp6592r9bH”", "author": "elonmusk"}, {"text": "One of the first Tesla Supercharger stations in Europe is being built in Cinderella, Norway #KatieWoodencloak", "author": "elonmusk"}, {"text": "RT @TeslaMotors: Model S' groundbreaking platform is displayed in the center of London for @DesignMuseum \"The Future is Here\" exhibit! http…", "author": "elonmusk"}, {"text": "Best saying ever “@temochdez: there is a saying in Mexico: \"El miedo no anda en burro\" meaning \"Fear doesn't ride on a donkey\"”", "author": "elonmusk"}, {"text": "RT @UberObvi: It gets dark when the sun goes down.", "author": "elonmusk"}, {"text": "RT @physorg_com: Valley networks suggest ancient snowfall on #Mars http://t.co/FEx8SEVrCl @BrownUniversity", "author": "elonmusk"}, {"text": "Oh yeah, well Tesla will study a plan to study the GM team that's studying Tesla, so there! http://t.co/Gn41zsaRv8", "author": "elonmusk"}, {"text": "@John_Gardi your guess is the closest I've seen anyone guess so far. Pod diameter probably around 2m", "author": "elonmusk"}, {"text": "@schadlu I really hate patents unless critical to company survival. Will publish Hyperloop as open source.", "author": "elonmusk"}, {"text": "@TobiasVdb Yes, it is a purely propulsive landing, but using the huge landing gear A frames as air brakes. Landing prop < 5% of vehicle mass", "author": "elonmusk"}, {"text": "Will publish Hyperloop alpha design by Aug 12. Critical feedback for improvements would be much appreciated.", "author": "elonmusk"}, {"text": "RT @profoundlypaige: @elonmusk http://t.co/nyO4BxYfcz is helpful, as is reiterating that you're about *efficiency*. Most no-brainer compone…", "author": "elonmusk"}, {"text": "Just completed full mission duration firing of next gen Falcon 9 booster. V proud of the boost stage team for overcoming many tough issues.", "author": "elonmusk"}, {"text": "RT @LeilaniMunter: Dear Oil, I am breaking up with you... http://t.co/D0cxsW6yt1 --- @TeslaMotors @elonmusk @TeslaMotorsClub", "author": "elonmusk"}, {"text": "@BrianDunning @SpaceX New spacesuit almost done. Hoping to unveil by end of year.", "author": "elonmusk"}, {"text": "So true “@jlgolson: BitTorrent packet goes to a bar and asks for beer. Everyone in the bar who already has a beer gives him a sip.”", "author": "elonmusk"}, {"text": "UDP (yeah you know me) 3X", "author": "elonmusk"}, {"text": "TCP packet walks into a bar & says “I’d like a beer.” Barman replies “You’d like a beer?” “Yes,” replies TCP packet,“I’d like a beer.”", "author": "elonmusk"}, {"text": "RT @physorg_com: 5D optical #memory in #glass could record the last evidence of civilization http://t.co/3k8jAz3Z88", "author": "elonmusk"}, {"text": "Latest vertical landing rocket vid. 325M altitude, hold against wind, land w T/W>1, radar in loop http://t.co/I68Xxpb1EQ", "author": "elonmusk"}, {"text": "Woohoo, Tesla direct sales petition passed the 100k threshold! Thanks a lot to everyone that helped!!", "author": "elonmusk"}, {"text": "Have been reading about Henry Fielding, who had the most excellent pen name of Captain Hercules Vinegar", "author": "elonmusk"}, {"text": "One learns something new every day “@UberFacts: A “Buttload” is an actual measurement of volume - Equal to 126 gallons.”", "author": "elonmusk"}, {"text": "@davidepley Thanks :)", "author": "elonmusk"}, {"text": "@lougil_ace Taking action. Will be a 7 day grace period for $2500 ext warranty. Neg margin at that price, so must unfortunately raise.", "author": "elonmusk"}, {"text": "RT @John_Gardi: @elonmusk You should point out this campaign wasn't started by TM but by concerned citizens that want a fair deal & a futur…", "author": "elonmusk"}, {"text": "Please support the White House petition to allow direct sales of cars to consumers in all states http://t.co/nHrH69MD3W", "author": "elonmusk"}, {"text": "@arthurblake Turning recirc off, windows closed and the right film on rear glass usually works. Am asking HVAC engineering to investigate.", "author": "elonmusk"}, {"text": "@arthurblake Tesla service can do coating or can be done by any auto glass coating company. My car is done on side & rear", "author": "elonmusk"}, {"text": "@arthurblake Turn off AC recirc, so that cool air flows out thru rear vents & get IR coating on rear glass.", "author": "elonmusk"}, {"text": "@justinchace will do", "author": "elonmusk"}, {"text": "@LisaRoutel The NY auto dealers lost in court, so now they are funding a bill in NY legislature to block Tesla", "author": "elonmusk"}, {"text": "RT @TeslaMotors: Tesla Pack Swap Event video is up: http://t.co/KeUoBoMYEB", "author": "elonmusk"}, {"text": "Tesla pack swap vid still being edited (multiple camera angles). In meantime, this article contains a vid http://t.co/lyzJy4k8Eu", "author": "elonmusk"}, {"text": "Tomorrow night: fastest gas pump in LA vs Tesla battery pack swap http://t.co/QgZzggjIkq", "author": "elonmusk"}, {"text": "Partial recall of Model S http://t.co/uDZ1f3RnjV", "author": "elonmusk"}, {"text": "Battery pack swap works with all Tesla Model S cars, past and present. It was always there.", "author": "elonmusk"}, {"text": "@zatulsky Shai actually got the idea from a visit to Tesla. The idea is obvious (many things allow battery swap), but the technology is not.", "author": "elonmusk"}, {"text": "Video of battery pack swap will be posted to the Tesla website around 9:30pm, so those attending will see this first.", "author": "elonmusk"}, {"text": "RT @SportsCenter: 39-0 UConn vs 37-0 Notre Dame on Tuesday night. 1st time in NCAA Tournament history with 2 undefeated teams in final. htt…", "author": "espn"}, {"text": "RT @ESPNStatsInfo: Clippers are 1st team with three 20+ point wins vs Lakers in season since 1966-67 Warriors", "author": "espn"}, {"text": "RT @ESPNNBA: .@LAClippers blow out @Lakers, clinch homecourt in first round in West.", "author": "espn"}, {"text": "Kentucky's a little different breed of 'Cats than the 1985 Villanova National Championship squad -> http://t.co/80YrqhjeQd", "author": "espn"}, {"text": "RT @ESPNNBA: Blake Griffin has 16 points (7-10 FG) and the Clippers lead the Lakers 57-49 at halftime on ABC. #LALvsLAC http://t.co/hr5zYLB…", "author": "espn"}, {"text": "Heading into the NCAA Championship tomorrow, @The_Wildcat provides a completely unbiased pre-game analysis. http://t.co/vD7C0hyQMA", "author": "espn"}, {"text": "RT @SportsCenter: LeBron James drops 38 Pts (13-22 FG) as Heat beat Knicks, 102-91. J.R. Smith finishes w/ 32 Pts in a loss. » http://t.co/…", "author": "espn"}, {"text": "RT @ESPNNBA: This is now J.R. Smith's 3rd career game with 10+ threes made. That's an NBA record, and his 10 3s in a game are a Knicks' rec…", "author": "espn"}, {"text": "RT @ESPNNBA: Heat started to pull away, but Knicks are hanging tough, down 7 with 3:30 left on ABC. #NYvsMIA", "author": "espn"}, {"text": "Name: J.R. Smith", "author": "espn"}, {"text": "RT @ESPNNBA: J.R. Smith has knocked down five 3s and the Knicks lead the Heat 50-48 at halftime on ABC. #NYvsMIA http://t.co/ybQXcPUg06", "author": "espn"}, {"text": "Yesterday is in the past. Here's #TheLatestDish on tomorrow night's title game -> http://t.co/QUmGlhUiWd", "author": "espn"}, {"text": "Last night, Aaron Harrison found out what happens when you hit a game-winning three in the Final Four. http://t.co/Ix8FbLIVhp", "author": "espn"}, {"text": "Spectacular photo of Aaron Harrison's clutch shot (via @marchmadness) http://t.co/K9ZmuNqXuT", "author": "espn"}, {"text": "RT @ESPNStatsInfo: An 8 seed (Kentucky) vs a 7 seed (UConn) in the National Championship -- the highest combined seeds in National Champion…", "author": "espn"}, {"text": "Kentucky wins in an epic thriller.", "author": "espn"}, {"text": "Madness overload. #FinalFour", "author": "espn"}, {"text": "Alex Poythress just made every jaw drop.", "author": "espn"}, {"text": "RT @ESPNCBB: The time out paid off - Kentucky on an 11-0 run.  They now lead Wisconsin, 47-43.", "author": "espn"}, {"text": "RT @SportsCenter: On Wisconsin? Badgers lead Kentucky, 40-36 at the half. Sam Dekker leads the way with 12 Pts, 2 Reb. http://t.co/1T2gRpml…", "author": "espn"}, {"text": "RT @MedcalfByESPN: Julius Randle is just ridiculous sometimes.", "author": "espn"}, {"text": "RT @ESPN_Numbers: Florida went 124 days in between losses.", "author": "espn"}, {"text": "The doubters keep doubting.", "author": "espn"}, {"text": "RT @ESPNDanaOneil: People will say Florida played poorly. Like they said Michigan State played poorly. Truth is, UConn is really good.", "author": "espn"}, {"text": "RT @ESPNAndyKatz: UConn has been winning the past week with its defense. Phenomenal against Michigan State. Strong again tonight.", "author": "espn"}, {"text": "RT @ESPNAndyKatz: Florida's 22 points were its lowest first-half total of the season.", "author": "espn"}, {"text": "Before tonight, Florida hadn't trailed at halftime since March 15th.", "author": "espn"}, {"text": "RT @ESPNStatsInfo: In just over 3 minutes, Florida already has more second-chance points (4) than Michgan State (2) did in the Elite 8 vs U…", "author": "espn"}, {"text": "Four teams, one dream. http://t.co/jAYxklRW0j", "author": "espn"}, {"text": "Everything's bigger in Texas, including the Final Four. http://t.co/eVUQtcdLR6", "author": "espn"}, {"text": "Florida has won 30 straight, but their last loss came at the hands of Shabazz. http://t.co/EFzbVp1zb4 (via @SportsCenter)", "author": "espn"}, {"text": "Chris Johnson is a free agent. Here are the chances CJ2K lands on your NFL squad -> http://t.co/y18KeKkUzV", "author": "espn"}, {"text": "Auburn meant to intentionally walk Ole Miss' Austin Anderson.", "author": "espn"}, {"text": "Kevin Durant has scored 25+ pts in 40 straight games.", "author": "espn"}, {"text": "If KD scores 25 points tonight, he'll tie MJ for 3rd-longest single season streak.", "author": "espn"}, {"text": "Before first pitch at Fenway, this helicopter gave the crowd one epic flyover -> http://t.co/4UfVuMwgx4", "author": "espn"}, {"text": "Youth vs. experience. Calipari vs. Ryan. Get #TheLatestDish on important Final Four storylines here -> http://t.co/W1S2GkP1W5", "author": "espn"}, {"text": "This is your all-access pass to media day and open practices at the Final Four -> http://t.co/wyrPPHbQg3", "author": "espn"}, {"text": "As another season of baseball begins at Wrigley, @Sport_Science shows how the weather factors into hitters' success: http://t.co/9h8NRq6Olx", "author": "espn"}, {"text": "The best possible NHL First-Round Matchups: Ranked -> http://t.co/2C7Pk58igG", "author": "espn"}, {"text": "The Green Monster is dressed up for the @RedSox home opener at Fenway. http://t.co/sYMRGLXeKZ", "author": "espn"}, {"text": "It’s official.", "author": "espn"}, {"text": "He also played ping pong. WITH HIS DRIVER. https://t.co/tFgC62MdL4", "author": "espn"}, {"text": "When @bubbawatson played a round in Bristol, he ran into some tree issues #ThisIsSC -> http://t.co/bpgFnvqtfg", "author": "espn"}, {"text": "Mercer's Kevin Canevari is doing the Nae Nae all over the Bristol campus today. Happy Friday. http://t.co/OQVpUpffIE (via @ESPN_Numbers)", "author": "espn"}, {"text": "In today’s edition of Tim Lincecum’s glorious mustache… http://t.co/HBJuh0yc29", "author": "espn"}, {"text": "What did we learn from the Spurs’ winning streak? According to @ESPNSteinLine, plenty -> http://t.co/HVr56YftJu", "author": "espn"}, {"text": "KD extended his streak of 25-point games to 39.", "author": "espn"}, {"text": "Adreian Payne's 360 dunk was sick, but his celebration literally brought down the house ->  http://t.co/kei0hS9Nza", "author": "espn"}, {"text": "RT @SportsCenter: THIS JUST IN: Seahawks and Head Coach Pete Carroll have agreed on contract extension (via NFL Network). http://t.co/WKX3u…", "author": "espn"}, {"text": "Mike Delio is in high school. In his first varsity start, he pitched a perfect game by striking out all 21 batters -> http://t.co/utsjsTYuws", "author": "espn"}, {"text": "Game over.", "author": "espn"}, {"text": "RT @ESPNNBA: Kevin Durant knocks down a free throw with 3:31 left to extend his 25-point scoring streak to 39 games.", "author": "espn"}, {"text": "RT @SportsCenter: Former QB @Kenny_Mayne and @Buccigross are working on their chemistry in the newsroom.", "author": "espn"}, {"text": "Kenny G’s rendition of the @SportsCenter theme song is mesmerizing. https://t.co/RyvrSjRPSJ #DaDaDa", "author": "espn"}, {"text": "In 18 years at Florida, Billy Donovan has taken a \"football school\" and turned it into a basketball powerhouse -> http://t.co/7JHRRnDKZe", "author": "espn"}, {"text": "Having trouble collecting for your March Madness pool? Hire Manny Pacquiao -> http://t.co/zecUtw3237 (via @JimmyKimmelLive)", "author": "espn"}, {"text": "25 years ago today, Ken Griffey Jr. made his MLB debut.", "author": "espn"}, {"text": "DeMarcus Cousins is enjoying his best career season while ignoring his critics -> http://t.co/m0s9NPLTQ0 (via @TimKeownESPN)", "author": "espn"}, {"text": "The @Dbacks’ $25 corn dogs are selling like free corn dogs -> http://t.co/yLWFqM3MA9", "author": "espn"}, {"text": "RT @BBTN: 25 years ago today, Ken Griffey Jr. hit a double in his first big league at-bat. #tbt http://t.co/qYBO8NMrN1", "author": "espn"}, {"text": "Photo of the year?", "author": "espn"}, {"text": "Players can come out of nowhere to make an impact at the Final Four.  Here's #TheLatestDish on 2014's candidates -> http://t.co/MrkWBL21Lu", "author": "espn"}, {"text": "Bruce Pearl is already making a splash at Auburn. (via @AUBasketball) https://t.co/ptn2df026E", "author": "espn"}, {"text": "Who’s in? Who’s out? The US Soccer roster may have some shakeups heading into the World Cup -> http://t.co/hsb7iQXZBC", "author": "espn"}, {"text": "Cue the towel waving in D.C.", "author": "espn"}, {"text": "Before leaving Houston, Derek Jeter got some Derek Jeter cowboy boots from the @Astros. http://t.co/U5KeKGOuSY", "author": "espn"}, {"text": "Dick Bavetta officiated his 2,633rd consecutive regular season game last night, passing Cal Ripken’s all-time streak. #IronRef", "author": "espn"}, {"text": "The @Spurs’ game log since February 26 is absolutely ridiculous. http://t.co/XscAwFciEu", "author": "espn"}, {"text": "Last night, the @Pirates won on a walk-off single after 16 innings, 5 hours, and 55 minutes.", "author": "espn"}, {"text": "ICYMI: last night, Shin-Soo Choo gave the @Rangers a crazy walk-off win with a crazy walk-off...walk -> http://t.co/LRqCyl7RLO", "author": "espn"}, {"text": "It's early in the season, but Ryan Howard is already doing Ryan Howard things -> http://t.co/OQBWHmS4ma", "author": "espn"}, {"text": "RT @ESPNNBA: At the end of 3, the Knicks lead the Nets 82-61. J.R. Smith has 21 pts, 8 reb, 5 ast for New York.", "author": "espn"}, {"text": "RT @SportsCenter: Knicks blowing out Nets at MSG, 63-38. This 1st quarter #SCtop10 buzzer-beater by Tim Hardaway Jr. was a big help. http:/…", "author": "espn"}, {"text": "RT @Grantland33: An ‘Above the Rim’ Roundtable: @BillSimmons @Rafeboogs @andrewsharp on Tupac, Kyle Watson, rap soundtracks, and Nutso http…", "author": "espn"}, {"text": "The @StLouisBlues have never hoisted Lord Stanley's Cup. @ESPN_Burnside believes this could be the year: http://t.co/Wz359eqUjr", "author": "espn"}, {"text": "Recruiting is getting artsy.", "author": "espn"}, {"text": "Jadeveon Clowney spoke with our @ESPNNFL analysts on his desire to be #1 and areas he's working on improving -> http://t.co/ZLDte6hu39", "author": "espn"}, {"text": "RT @Buster_ESPN: Well, never mind. Harang's no-hitter ends on a single. Now it's only about winning the game. 1-0 Braves, bottom of the 7th.", "author": "espn"}, {"text": "RT @Buster_ESPN: Chris Johnson homers off Garza. Aaron Harang's no-hitter still intact, top of the 7th.", "author": "espn"}, {"text": "RT @ESPNFC: GARETH BALE! GOAL!!!", "author": "espn"}, {"text": "RT @SportsCenter: DEVELOPING: Brewers P Matt Garza and Braves P Aaron Harang BOTH have no-hitters through 5 innings. Each has walked 1 batt…", "author": "espn"}, {"text": "One team's run to the Final Four was more impressive than any other team (and it's not Kentucky) -> http://t.co/yMjXFQQDmT", "author": "espn"}, {"text": "Taylor Kirkwood, an 18-year-old student with Autism, is going to have an awesome prom date -> http://t.co/J76mPu6hma", "author": "espn"}, {"text": "Do you have faith in your NBA team's front office? Here's @ESPNNBA’s ranking of every single one -> http://t.co/AOaTi6b3rv", "author": "espn"}, {"text": "Just your average 50-yard Frisbee swish (via @Brodiesmith21) -> https://t.co/HELQywE8Ab", "author": "espn"}, {"text": "ICYMI: @IanDarke is getting his voice ready for the World Cup by calling awkward first dates -> http://t.co/uIdmtwa9ps", "author": "espn"}, {"text": "Steph Curry doesn't do dunk posters.", "author": "espn"}, {"text": "Last night, the @warriors got a huge road win in Dallas....", "author": "espn"}, {"text": "\"Very exciting player. Determined to show he is the best and hungry to win. My kinda guy.” – @RGIII on DeSean Jackson signing w/ @Redskins", "author": "espn"}, {"text": "RT @ESPNNFL: Former Eagles WR @DeseanJackson10 and the Washington Redskins agreed to a 3-year deal. >> http://t.co/TtJJTYhhOE", "author": "espn"}, {"text": "RT @SportsCenter: STEPH CURRY COLD BLOODED!", "author": "espn"}, {"text": "If you’re headed on a date tonight, keep an eye out for @IanDarke -> http://t.co/Yx9LVwT7uP", "author": "espn"}, {"text": "\"Every Opening Day is special when you have butterflies and you have nerves.\"", "author": "espn"}, {"text": "Want to influence history?", "author": "espn"}, {"text": "Here’s an April Fools joke that was well worth it for @ESPN_FirstTake fans -> http://t.co/HplvYBQ9wU", "author": "espn"}, {"text": "29 years ago today, 8 seed Villanova beat Georgetown becoming the lowest ever seed to win an NCAA Tournament. http://t.co/pcUuWDWIzq", "author": "espn"}, {"text": "Welcome, DISH customers. Starting today, you now have access to WatchESPN.", "author": "espn"}, {"text": "RT @ESPNFC: SCHWEINSTEIGER!", "author": "espn"}, {"text": "An NBA All-Star has formed an incredible bond with Fran McCaffery’s son -> http://t.co/7fDoPT3Q9X", "author": "espn"}, {"text": "RT @ESPNNASCAR: @NASCAR_NNS drivers sure do grow up fast…http://t.co/dlCemUVp1E", "author": "espn"}, {"text": "“It’s only a matter of time until Anthony Davis ascends to the NBA throne.”", "author": "espn"}, {"text": "During today’s UCL Quarterfinals, familiarity may very well breed contempt -> http://t.co/rjKtyYEf2g", "author": "espn"}, {"text": "Hank, the @Brewers Dog, made his (adorable little) MLB debut yesterday. http://t.co/HEqThyFeDy", "author": "espn"}, {"text": "Watch out Ellen. Big Papi and POTUS shared a Presidential Selfie. (via @DavidOrtiz) http://t.co/1aLpweEnwr", "author": "espn"}, {"text": "“Maybe we should all go to group therapy or something…figure out some of our grievances.”", "author": "espn"}, {"text": "The first rule of Opening Day: Don’t overreact to Opening Day.", "author": "espn"}, {"text": "RT @GoodmanESPN: Marquette has hired Duke associate head coach Steve Wojciechowski, sources told ESPN. Story: http://t.co/QhYc2nivvs", "author": "espn"}, {"text": "The Spurs set a franchise record with their 18th straight win last night.", "author": "espn"}, {"text": "In June, @IanDarke will be the voice of the World Cup.", "author": "espn"}, {"text": "There's a new team atop the NBA's Eastern Conference Standings. It's the @MiamiHEAT -> http://t.co/g48xEPZBl5", "author": "espn"}, {"text": "RT @SportsCenter: 7th straight Final Four for UConn!", "author": "espn"}, {"text": "ICYMI: Here's Mike Trout's monster homer in his first AB of the season -> http://t.co/KB3DJtlvNC", "author": "espn"}, {"text": "Mike Trout's first at bat of the season is a home run.", "author": "espn"}, {"text": "RT @BBTN: Robinson Cano about to make his Mariners debut. Opening Day is just getting started!", "author": "espn"}, {"text": "RT @ESPNStatsInfo: Notre Dame: reaches Final Four for 4th straight season; 6-0 all-time in Elite 8 (most wins without loss of any school in…", "author": "espn"}, {"text": "RT @SportsCenter: SPURS HISTORY!", "author": "espn"}, {"text": "Eastern Conference?", "author": "espn"}, {"text": "This flyover photo from the Texas Rangers’ opener is phenomenal (via @Evan_P_Grant) http://t.co/m5ekVFDBm2", "author": "espn"}, {"text": "Blake, Joakim, Durant or George? Who's your @Kia Player of the Month? Use #NBAPOM and you could go to the NBA Finals. http://t.co/wSnX1mbJwG", "author": "espn"}, {"text": "Grady Sizemore missed the last two seasons due to injury.", "author": "espn"}, {"text": "RT @SportsCenter: WALKOFF HOMER IN PITTSBURGH! Neil Walker hits a solo shot in bottom 10 to give Pirates a 1-0 win over Cubs.", "author": "espn"}, {"text": "RT @ESPNStatsInfo: Grady Sizemore's HR today against the Orioles is his 1st since July 15, 2011 - which was also against Baltimore.", "author": "espn"}, {"text": "Our first MLB Power Rankings are out and last year’s champions are not on top -> http://t.co/wm72nBWpK0", "author": "espn"}, {"text": "RT @chadfordinsider: No surprise. Wiggins announces officially he’ll declare for the 2014 NBA Draft.  He’s No. 1 on our Board and Lottery M…", "author": "espn"}, {"text": "RT @ESPNStatsInfo: Jimmy Rollins and Placido Polanco are the only Phillies to hit grand slams on Opening Day in the last 100 years. Polanco…", "author": "espn"}, {"text": "RT @BBTN: Show us why you love opening day. Tweet or instagram your pictures and they might be on tv throughout the day #ESPNOpeningDay", "author": "espn"}, {"text": "On #OpeningDay, everyone believes in their team.", "author": "espn"}, {"text": "PLAY BALL!", "author": "espn"}, {"text": "Before #OpeningDay begins, here is everything you need to know about the offseason in 162 seconds -> http://t.co/tjxaqUpLmY", "author": "espn"}, {"text": "UConn felt bad for busting @BarackObama’s bracket … sort of -> http://t.co/i6Mb7KTZ98", "author": "espn"}, {"text": "Our MLB experts are officially on record. See if they picked your team to win the 2014 World Series -> http://t.co/iclaIWD2QN", "author": "espn"}, {"text": "NOTE: Morning meetings in Bristol may be disrupted by @TheCUTCH22 and his band of pirates #ThisIsSC -> http://t.co/c6PO80gzv7", "author": "espn"}, {"text": "“Baseball was, is and always will be to me the best game in the world.” – Babe Ruth", "author": "espn"}, {"text": "RT @ESPNStatsInfo: Kentucky is the 1st team to start 5 freshmen in an Elite 8 win since Michigan's \"Fab 5\" in 1992.", "author": "espn"}, {"text": "1,2,7 and 8.", "author": "espn"}, {"text": "You're cordially invited to #OpeningNight.", "author": "espn"}, {"text": "612 out of 11 million Tournament Challenge brackets had the correct #FinalFour.", "author": "espn"}, {"text": "From an 8 seed to the Final Four.", "author": "espn"}, {"text": "RT @ESPNCBB: AARON HARRISON COLD BLOODED! #MarchMadness", "author": "espn"}, {"text": "RT @MedcalfByESPN: I'm sitting here courtside and I don't know what's happening. No idea.", "author": "espn"}, {"text": "Never change #MarchMadness.", "author": "espn"}, {"text": "RT @ESPNCBB: Julius Randle with his 24th double-double of the season. #MarchMadness", "author": "espn"}, {"text": "The Maize and Blue vs. #BBN", "author": "espn"}, {"text": "RT @GoodmanESPN: Kentucky is just playing volleyball right now.", "author": "espn"}, {"text": "RT @ESPNCBB: A heavyweight fight in Indy! Michigan and Kentucky tied at 37-37 at the half.", "author": "espn"}, {"text": "If UK misses, Marcus Lee doesn't. #PutbackSlams", "author": "espn"}, {"text": "Nik Stauskas had 14 points in the win vs. Tennessee.", "author": "espn"}, {"text": "RT @GoodmanESPN: Marcus Lee can play, folks. Top 50 recruit who could wind up in the NBA someday.", "author": "espn"}, {"text": "RT @SportsCenter: Kevin Ollie makes it to the Final Four in his 1st NCAA Tournament appearance as a head coach.", "author": "espn"}, {"text": "RT @ESPNCBB: This is the first group of Michigan State seniors under Tom Izzo not to make the Final Four. #MarchMadness", "author": "espn"}, {"text": "The magic of the Garden powers UConn to the Final Four.", "author": "espn"}, {"text": "RT @ESPN_Numbers: Including today, Shabazz Napier has 90 points in the 2014 NCAA Tournament.", "author": "espn"}, {"text": "RT @ESPNDanaOneil: From down nine to up 7, UConn has the Garden bananas. And Shabazz Napier, naturally, leading the charge. #Kembaesque", "author": "espn"}, {"text": "RT @ESPN_Numbers: SPARTY ended the first half on a 9-0 run.", "author": "espn"}, {"text": "RT @ESPNStatsInfo: MSU now outscoring UConn 16-3 in transition in building its lead", "author": "espn"}, {"text": "Baseball Rules!", "author": "espn"}, {"text": "UConn started things off with a 12-2 run.", "author": "espn"}, {"text": "RT @ESPNCBB: Halftime in Madison Square Garden. Michigan State leads UConn 25-21. #MarchMadness", "author": "espn"}, {"text": "RT @ESPNCBB: Sparty with their first lead of the game! #MarchMadness", "author": "espn"}, {"text": "RT @ESPNStatsInfo: Michigan State has opened 1 for 9 with 4 turnovers", "author": "espn"}, {"text": "With over 34 PPG, is KD your @Kia Player of the Month? Use #NBAPOM to vote, and you could be going to the NBA Finals. http://t.co/oLPUdozU8T", "author": "espn"}, {"text": "RT @ESPNCBB: The entire state of Wisconsin right now -> https://t.co/BnT1rNiqfZ", "author": "espn"}, {"text": "The Badgers deliver an epic overtime win.", "author": "espn"}, {"text": "RT @ESPNCBB: OVERTIME! #MarchMadness", "author": "espn"}, {"text": "This Arizona vs. Wisconsin game … what #MarchMadness is all about.", "author": "espn"}, {"text": "RT @SportsCenter: Tie ball game! Arizona goes on a run to tie it at 41 with under 12 minutes to play. Great finish with a Final Four on the…", "author": "espn"}, {"text": "RT @ESPNCBB: A good one brewing in Anaheim.", "author": "espn"}, {"text": "RT @SportsCenter: The Sixers are CRUISING! Philadelphia, trying to snap a 26-game losing streak, up by 30 after three quarters vs. Detroit.", "author": "espn"}, {"text": "Prior to the Heat game, @KingJames met cancer patient Ebony Nettles-Bey.", "author": "espn"}, {"text": "Dayton went from Cinderella to Gator Bait.", "author": "espn"}, {"text": "RT @ESPNStatsInfo: Patric Young currently has more paint points (8) than Dayton's entire team.", "author": "espn"}, {"text": "RT @ESPNStatsInfo: Florida's 5-point lead at 17:43 tied Dayton's largest deficit of the tournament so far.", "author": "espn"}, {"text": "Time for the Gators to prove their #1 status.", "author": "espn"}, {"text": "Time for Dayton to prove they're more than just Cinderella.", "author": "espn"}, {"text": "How's this for elite?", "author": "espn"}, {"text": "Kentucky's gone from looking young and vulnerable to energetic & dangerous.", "author": "espn"}, {"text": "Michigan State's status?", "author": "espn"}, {"text": "Instant. Classic.", "author": "espn"}, {"text": "March Madness never fails.", "author": "espn"}, {"text": "These last two Sweet 16 games are simply terrific.", "author": "espn"}, {"text": "RT @SportsCenter: BREAKING: Mike Trout and the Angels have agreed to a six-year contract extension. http://t.co/GgQFpVhZdX", "author": "espn"}, {"text": "RT @MedcalfByESPN: Oh ... Oh ... Oh ... Russ Smith with the nastiness!!!!!!!!!!", "author": "espn"}, {"text": "RT @ESPNDanaOneil: About three minutes from Michigan State versus Virginia. The favorite No. 4 seed and the underdog No. 1.", "author": "espn"}, {"text": "RT @ESPN_Numbers: While you were watching college hoops, LeBron (17 Pts, 10 Reb, 12 Ast) put up his FIRST triple-double of the season.", "author": "espn"}, {"text": "RT @ESPNCBB: The three headed monster of Napier, Daniels & Boatright combine for 62 points as UConn advances to the Elite 8! http://t.co/wO…", "author": "espn"}, {"text": "Michigan survives!", "author": "espn"}, {"text": "RT @MedcalfByESPN: And ...... Wow. One-point game. This is March Madness.", "author": "espn"}, {"text": "RT @ESPNDanaOneil: We got a ballgame somehow. Kane hits a 3 and Cyclones down just 7. Iowa State fans coming to life", "author": "espn"}, {"text": "RT @SportsCenter: UConn leads Iowa State at half, 36-26. Shabazz Napier and Ryan Boatright are a combined 6-7 from 3 with 22 points. http:/…", "author": "espn"}, {"text": "RT @DickieV: Maize & Blue up early on Vols -solid D on Stokes & Stauskas/Robinson effective .", "author": "espn"}, {"text": "“MSG and basketball is a great romance. This place needs college basketball. College basketball needs the Garden.” – Jim Calhoun", "author": "espn"}, {"text": "Roddy White lost a Twitter wager to one of his followers.", "author": "espn"}, {"text": "Before rivals Kentucky and Louisville take the court, check out their  #SCTop10  plays of the season. http://t.co/UcNX4NkAXl", "author": "espn"}, {"text": "Congrats to @kimmymiller13 on winning the #ChooseWisely contest and tickets to next year's Champions Classic! https://t.co/UL0Br1BflT", "author": "espn"}, {"text": "Even after a Sweet 16 win, @FiveThirtyEight gives one team a < 1% chance of winning it all -> http://t.co/orPf1yKeUa", "author": "espn"}, {"text": "The path to the Frozen Four begins today. @Buccigross is here to talk #cawlidgehawkey -> http://t.co/m9XeK8wi56", "author": "espn"}, {"text": "RT @ESPNNFL: BREAKING: The Philadelphia Eagles announce they are releasing WR DeSean Jackson. http://t.co/vnhdjeHDHu", "author": "espn"}, {"text": "Hey @UWBuckyBadger, stop checking Facebook pictures of your opponent.", "author": "espn"}, {"text": "15 points. 10-10 from the line. In the last 3 minutes.", "author": "espn"}, {"text": "Want to know what's happening at Commencement this year? http://t.co/snyr5YEInj #Harvard14", "author": "Harvard"}, {"text": "A whole new world for a child with autism, thanks to @Disney http://t.co/fWWdlKpqUP", "author": "Harvard"}, {"text": "Student blog: \"the one and only topic that was on my mind was choosing where I would go to college\" http://t.co/TNSLqXDVQm #Harvard2018", "author": "Harvard"}, {"text": "Drew Faust hosts #WhenWomenLead panel on 4/7, ft. @JillAbramson, @KarenGMills, Edith Cooper, Janet Napolitano http://t.co/VX00cjch7M", "author": "Harvard"}, {"text": "Spoiler alerts, straight from Breaking Bad creator Vince Gilligan http://t.co/EEjIaB6ZTW", "author": "Harvard"}, {"text": "Scientists find new hope for currently untreatable degradation of motor neurons http://t.co/7SbXOMBbdA", "author": "Harvard"}, {"text": "Cambridge students connect with Harvard researchers exploring Gulf with sub http://t.co/QROo9KGuXl", "author": "Harvard"}, {"text": "How can students measure the role of passions as well as paychecks? Drew Faust recommends Her First, and Last, Book http://t.co/cmN582QS3V", "author": "Harvard"}, {"text": "Did you know Harvard's @MemChurch has sermons online? Audio available at @SoundCloud http://t.co/BBddGcIr3K", "author": "Harvard"}, {"text": "Pulitzer Prize-winner @RonSuskind talks about connecting with his autistic son through Disney films http://t.co/DDYxQGOPIe @autismspeaks", "author": "Harvard"}, {"text": "The sons of Jack Dampeer ’38, LLB ’42 reflect on their father’s lifelong generosity to Harvard College http://t.co/WHMI15x68o", "author": "Harvard"}, {"text": "Watch a demonstration of the human adaptation that Harvard researchers say played a key role in our evolution [video] http://t.co/ukKWRhGXQL", "author": "Harvard"}, {"text": "Using technology to answer questions about what's happening 1,000 miles away http://t.co/y7sstoeFrv", "author": "Harvard"}, {"text": "Drew Faust hosts \"When Women Lead\" panel on 4/7, ft. @JillAbramson, @KarenGMills, Edith Cooper, Janet Napolitano http://t.co/e0C1EwnvAa", "author": "Harvard"}, {"text": "What will happen to digital library collections? http://t.co/6bkGtWtjq6", "author": "Harvard"}, {"text": "New in digital & social media research: Predicting what goes viral, the effects of social media on news consumption http://t.co/ylw4W965n2", "author": "Harvard"}, {"text": "\"Breaking Bad\" creator Vince Gilligan spoke with President Drew Faust about the show's origins and evolution http://t.co/bSjceCdqse", "author": "Harvard"}, {"text": "Research by @HarvardMed suggests \"a new approach to treating seizures, one based on quieting the immune system\" http://t.co/tXc7w4lDMj", "author": "Harvard"}, {"text": "Family ties with a Disney twist http://t.co/EOOKGtsoAl", "author": "Harvard"}, {"text": "Creator of @BreakingBad_AMC told Harvard some secrets of the show while he was on campus http://t.co/dzn3l7OMsT", "author": "Harvard"}, {"text": "Russia and NATO, according to @PeterWestmacott [audio] http://t.co/kbmQa14sBC", "author": "Harvard"}, {"text": "Looking for a new desktop wallpaper or iPhone background for April? We've got you covered http://t.co/CB8rBmjRe8", "author": "Harvard"}, {"text": "Benefits of vitamin D supplements still debated http://t.co/tNFYY7utUU via @HarvardHealth", "author": "Harvard"}, {"text": "\"Breaking Bad\" creator Vince Gilligan spoke at Harvard about the show's origins and evolution http://t.co/O8aICyskYc http://t.co/veNkWAZCYW", "author": "Harvard"}, {"text": "Will the future of deep-sea technology be human or robotic? http://t.co/kAGIx7tBzc", "author": "Harvard"}, {"text": "Firsthand insights into autism, from Temple Grandin http://t.co/s7Q7qBu8q0", "author": "Harvard"}, {"text": "Bringing music to the Quad [photos] http://t.co/dK5Vl0zNf3", "author": "Harvard"}, {"text": "Plan your weekend by browsing upcoming @Harvard events http://t.co/40d2u1TAsm", "author": "Harvard"}, {"text": "How the Boston Red Sox went from last place to World Series champs in 2013 [audio] http://t.co/7z1jkMmnx4", "author": "Harvard"}, {"text": "As the #RedSox play their home opener, learn about the first game played in Fenway: Red Sox vs. Harvard College, 1912 http://t.co/WCJeo6EpGE", "author": "Harvard"}, {"text": "Putting a spotlight on local artists’ work http://t.co/uneycaqGk7", "author": "Harvard"}, {"text": "RT @HarvardLibrary: New testing shows 1 of 3 books in Harvard Library thought to be bound in human skin actually bound in sheepskin. http:/…", "author": "Harvard"}, {"text": "Drew Faust hosts \"When Women Lead\" panel on 4/7, ft. @JillAbramson, @KarenGMills, Edith Cooper, Janet Napolitano http://t.co/F0diMbrDRO", "author": "Harvard"}, {"text": "Scientists have discovered that a newly approved medication for epilepsy may offer meaningful treatment for ALS http://t.co/KkFj5FlFAf", "author": "Harvard"}, {"text": "A new report assesses emergency response to last year's tragedy at the Boston Marathon and following manhunt http://t.co/MmVUDEXNgV", "author": "Harvard"}, {"text": "Go wide, go long [photos] http://t.co/Sq64kEctB2", "author": "Harvard"}, {"text": "Kicking the diet habit with 'intuitive eating' http://t.co/9AVF6Ud56G", "author": "Harvard"}, {"text": "Now that spring has arrived, take a free, self-guided mobile tour of Harvard Yard http://t.co/v5XKNllSYw", "author": "Harvard"}, {"text": "Spring has sprung for Harvard's Common Spaces http://t.co/QmXOPplhbj http://t.co/B0ZCDYZGSG", "author": "Harvard"}, {"text": "At the Harvard Herbaria, curatorial assistant digitizes collections of dried plant specimens http://t.co/zfZBGrhZrz", "author": "Harvard"}, {"text": "New task force to develop recommendations on improving efforts to prevent sexual misconduct http://t.co/hMTE3kuGfB", "author": "Harvard"}, {"text": "@RyanDEnos Our team got the chance to take batting practice in Fenway to celebrate the 100th anniversary in 2012 http://t.co/miVLPqqBwY", "author": "Harvard"}, {"text": "@RyanDEnos It was a close game, but the Red Sox defeated Harvard 2-0.", "author": "Harvard"}, {"text": "New hope for treating ALS http://t.co/XBbZWe8f9O", "author": "Harvard"}, {"text": "Students at @HarvardGSD have designed houses to use little or no energy http://t.co/ngHY16hSwo", "author": "Harvard"}, {"text": "RT @HDSNews: LIVE STREAM 1 EST: Special Divinity Dialogues w/ alumni recipients of 2014 Gomes Award. http://t.co/oI6afDIyiz #divdialogues @…", "author": "Harvard"}, {"text": "Become anything at Harvard [video] http://t.co/MUOkF9qL8g", "author": "Harvard"}, {"text": "New report reviews successes and failures of the emergency response to the Boston Marathon bombings http://t.co/ofZJjZCJsj", "author": "Harvard"}, {"text": "It's been 102 years since the Red Sox christened Fenway Park in a game against Harvard http://t.co/ZiqohiHrcN #tbt http://t.co/mwud7BttrT", "author": "Harvard"}, {"text": "Harvard @Kennedy_School looks back at emergency and law-enforcement response to last year's bombings and manhunt http://t.co/ZQEW2jZf3b", "author": "Harvard"}, {"text": "Harvard alums explain why service is so valuable http://t.co/7B9qVBiiFq  #HarvardServes", "author": "Harvard"}, {"text": "A breakdown of the challenges to achieving Palestinian-Israeli peace [audio] http://t.co/t2kOHSO644", "author": "Harvard"}, {"text": "How to kick the habit of diet failure http://t.co/DfAsNUibas", "author": "Harvard"}, {"text": "RT @HarvardIOP: Our student leaders would like to congratulate the @Harvard University Class of 2018 accepted students! http://t.co/GUSxbSp…", "author": "Harvard"}, {"text": "Another side of Italy's empire http://t.co/lM1bw44VJ1", "author": "Harvard"}, {"text": "This is what the sustainable house of the future may look like http://t.co/LUz9z0Pdul", "author": "Harvard"}, {"text": "RT @hgse: Blue is the new crimson tonight! #LightItUpBlue @autismspeaks @Harvard http://t.co/suZMwQRHPd", "author": "Harvard"}, {"text": "The benefits of mammograms are often overestimated, while harms are underestimated, new study finds http://t.co/7A38Bdrppb", "author": "Harvard"}, {"text": "“The future we face together is one in which knowledge will be the most important currency.\" -Drew Faust http://t.co/FfBuJPHrkh", "author": "Harvard"}, {"text": "First comprehensive atlas of human gene activity released http://t.co/JlFLF03v2e", "author": "Harvard"}, {"text": "See Harvard's campus from a new angle [photos] http://t.co/RxKUCZcanY http://t.co/8KFwwr0HBz", "author": "Harvard"}, {"text": "Microscopic particles, big concerns http://t.co/UbC5uj2nWL", "author": "Harvard"}, {"text": "A fast, accurate diagnosis tool for autism developed at Harvard (April '12) http://t.co/15gM899eEL", "author": "Harvard"}, {"text": "The @HarvardAlumni Assoc kicks off global month of service, discusses why public service is so vital http://t.co/QwNwXQh9QW #HarvardServes", "author": "Harvard"}, {"text": "Vince Gilligan, creator of @BreakingBad_AMC, visits Farkas Hall tomorrow (4/3) for a conversation with Drew Faust http://t.co/sP4ZpUueTr", "author": "Harvard"}, {"text": "RT @hgse: \"Many current autism interventions involve imitation, so it’s an important skill for children with #autism to have.” http://t.co/…", "author": "Harvard"}, {"text": "RT @RadInstitute: Today is Autism Awareness Day—@RosalindPicard of MIT @medialab on how smart wristbands capture emotional response. http:/…", "author": "Harvard"}, {"text": "Recent academic research indicates that immigrants are often segregated in new communities http://t.co/OFyzOsPwUf", "author": "Harvard"}, {"text": "See our most recent videos, photos, audio, and @iTunesU collections http://t.co/6Vh7IdupFR", "author": "Harvard"}, {"text": "Study indicates children's exposure to certain chemicals may trigger disabilities such as autism, ADHD, and dyslexia http://t.co/MnFIOMUGRA", "author": "Harvard"}, {"text": "Exhibit explores nation’s late and turbulent drive to create colonies in Africa http://t.co/yD4wpxT6bn", "author": "Harvard"}, {"text": "A gallery grows in Allston http://t.co/djG6XEsJAd", "author": "Harvard"}, {"text": "10 Minutes with Temple Grandin: The autism activist spoke with @HGSE about the state of #AutismAwareness [audio] http://t.co/rnmYyBL5MY", "author": "Harvard"}, {"text": "Champions of 'intuitive eating' have a message for the diet-obsessed http://t.co/mQJOBC0lGS", "author": "Harvard"}, {"text": "On Instagram, see pics of spring on campus — like this morning view over Cambridge http://t.co/D61S1VU2kz http://t.co/3ubArmarev", "author": "Harvard"}, {"text": "Harvard students designed houses that use little or no energy http://t.co/Z5xGpJsPNO", "author": "Harvard"}, {"text": "Temple Grandin views autism as a facet of experience, not a limit http://t.co/DFTfrvQudM #AutismAwareness", "author": "Harvard"}, {"text": "Lose weight without a diet http://t.co/t1U0e6Fnye", "author": "Harvard"}, {"text": "New study finds feeling grateful triggers financial patience http://t.co/LOmogi55mT", "author": "Harvard"}, {"text": "Visualizing Italy's colonial “scramble for Africa” http://t.co/Kzr2x3VtmY", "author": "Harvard"}, {"text": "RT @HarvardIOP: TONIGHT in the @JFKJrForum: Discussion w/ @Wesley_Morris, @kcarterjackson & Brandon Terry on race, film and culture. http:/…", "author": "Harvard"}, {"text": "Ed Portal increasingly hosts shows spotlighting local artists’ work http://t.co/mAEg7v7tYY", "author": "Harvard"}, {"text": "Morgan Chu, J.D.’76 and Walter Clair ’77, M.D. ’81, M.P.H. ’85 to lead Board of Overseers http://t.co/UBLV9ku7fx", "author": "Harvard"}, {"text": "Look back at the Fogg Museum’s history as a pioneer in the international development of art research and teaching http://t.co/yfFuPRlvn1", "author": "Harvard"}, {"text": "Revisiting \"The West Wing\" [video] http://t.co/m1vrhtaSfG", "author": "Harvard"}, {"text": "One Harvard alum made this promise as a teen: donate toward his education, and he'd return to the town as a physician http://t.co/jAylukqx4I", "author": "Harvard"}, {"text": "Public health in the Arab world--what's working, and what isn't http://t.co/Xk8ZbF4LAF", "author": "Harvard"}, {"text": "Vince Gilligan, creator of @BreakingBad_AMC, visits Farkas Hall on 4/3 for a conversation with Drew Faust http://t.co/Xkc2Uu0G9U", "author": "Harvard"}, {"text": "Environmental justice is interdisciplinary, touching on social justice, civil rights, and more http://t.co/lbeRTSvrcC", "author": "Harvard"}, {"text": "What's the oldest book in @HoughtonLib's collection? Well, it depends on how you define a book http://t.co/kf14Lmg46d", "author": "Harvard"}, {"text": "Radical new houses from @HarvardGSD students are designed to use little or no energy http://t.co/G15fjLqdBD http://t.co/CmVVQ8gChR", "author": "Harvard"}, {"text": "Should college athletes be paid? Here's the legal perspective http://t.co/ofSBr0DJzE", "author": "Harvard"}, {"text": "Concerns about possible environmental health and safety issues with engineered nanoparticles in some products http://t.co/r3sTx4B78f", "author": "Harvard"}, {"text": "Research shows that a company's degree of social responsibility is affected by a surprising factor http://t.co/0Tj04Jm7EQ", "author": "Harvard"}, {"text": "“In special education, there’s too much emphasis placed on the deficit and not enough on the strength\"-Temple Grandin http://t.co/U4ZD9x3Qf4", "author": "Harvard"}, {"text": "The Schlesinger Library on the History of Women in America marks its 70th anniversary http://t.co/XW7PQNA2Js", "author": "Harvard"}, {"text": "Get to know the students admitted to the Class of 2018 http://t.co/1N5uU0x5IZ", "author": "Harvard"}, {"text": "RT @HarvardHBS: Class of 2014, your Class Day Speaker is ... http://t.co/30SEapzn7n #HBS2014", "author": "Harvard"}, {"text": "Genes in space: Living with microgravity affects people in different ways http://t.co/BQLySlswfo", "author": "Harvard"}, {"text": "Happy #OpeningDay from Cambridge! Here's President Faust throwing the first pitch at Fenway Park in 2010 http://t.co/hh07I1tYvz", "author": "Harvard"}, {"text": "Taking strides toward greener labs http://t.co/wGvInZCCqU", "author": "Harvard"}, {"text": "A @RadInstitute collection on the late Gerda Lerner, a scholar and pioneer in the field of women’s history http://t.co/rD7603ih4E", "author": "Harvard"}, {"text": "Rethinking the long, uneven demise of slavery http://t.co/nTH6VeVlTa", "author": "Harvard"}, {"text": "What to do about microscopic particles found in everyday items from cosmetics and clothing to building materials http://t.co/kpCj9WtwUi", "author": "Harvard"}, {"text": "Autism as a facet of experience, not a limit: Temple Grandin shares firsthand insights from her work and activism http://t.co/5rKn3yqV7I", "author": "Harvard"}, {"text": "Paychecks for college athletes? @Harvard_Law lecturer offers his input http://t.co/oezbSMt9lt", "author": "Harvard"}, {"text": "Ways to make scientific labs more energy-efficient http://t.co/gqqzXp6QFt", "author": "Harvard"}, {"text": "RT @harvardtickets: MONDAY, Mar. 31: @MHCHarvard presents the last 2014 Norton Lecture with @herbiehancock. In Sanders Theatre at 4:00pm. h…", "author": "Harvard"}, {"text": "The latest @Harvard news delivered to your inbox each weekday morning. Sign up for the Daily Gazette http://t.co/sdhgDaOoAN", "author": "Harvard"}, {"text": "How do you get a bunch of middle school kids interested in science and nutrition? http://t.co/Tw4kpN2cbY", "author": "Harvard"}, {"text": "For many Harvard undergrads, financial aid is what opens doors to dreams http://t.co/XZWzIGlqya", "author": "Harvard"}, {"text": "Living on campus at Harvard is way more than just a dorm room, a few roommates, and a cafeteria [photos] http://t.co/gozXiMUyCg", "author": "Harvard"}, {"text": "For big data, big thinking http://t.co/cJIurSB4vT", "author": "Harvard"}, {"text": "A new study looks at the brain mechanisms behind facial recognition http://t.co/PEsVQuCc99", "author": "Harvard"}, {"text": "Students at @Harvard_Law learn from the man who gave counsel to Snowden http://t.co/72NfPTWQg1", "author": "Harvard"}, {"text": "Wherever students come from, Harvard becomes their home [video] http://t.co/neJpTzBlm9", "author": "Harvard"}, {"text": "Exploring the many forms of human expression, through arts and humanities [video] http://t.co/9fnKmnbHGj", "author": "Harvard"}, {"text": "Did you know Harvard's @MemChurch has sermons online? Audio available at @SoundCloud http://t.co/KIkDb6dGNC", "author": "Harvard"}, {"text": "On #Instagram? Follow us to see photos of campus, like this sunrise over the Charles http://t.co/hrGsy0JsQO http://t.co/Msextyl0YW", "author": "Harvard"}, {"text": "The importance of teaching the humanities, on campus and off http://t.co/NJoGWwtsZl", "author": "Harvard"}, {"text": "New study could cause major shift in how nutrition policies are addressed http://t.co/0dtGdDVEoV", "author": "Harvard"}, {"text": "Put science on a plate, if you want kids to be interested http://t.co/hiSHUFtWUv http://t.co/vahyXboiWD", "author": "Harvard"}, {"text": "There's no day at Harvard College quite like Housing Day [photos] http://t.co/hSOooJNEIw http://t.co/BMtM3BARhh", "author": "Harvard"}, {"text": "\"Nothing has been so personal in my life\" - #CesarChavez director @diegoluna_ http://t.co/Qo5ySJrWPp", "author": "Harvard"}, {"text": "Sir Georg Solti had a knack for concise self-analysis http://t.co/DOSUluQrGw", "author": "Harvard"}, {"text": "Why consider Harvard? @NickKristof  has a few reasons [video] http://t.co/bOPDwuiug1", "author": "Harvard"}, {"text": "“I like to think about how the different kinds of minds can work together and complement each other.” -Temple Grandin http://t.co/LwcLvxxYKP", "author": "Harvard"}, {"text": "Astronomers found evidence for companion star that survived the blast of a supernova explosion http://t.co/ciWUIKkV5f http://t.co/7WbcKsu7WM", "author": "Harvard"}, {"text": "\"The Class of 2018 reflects the excellence achieved by the students of an increasingly diverse America\" http://t.co/EunSgOo5FT #Harvard2018", "author": "Harvard"}, {"text": "RT @harvardcrimson: Good morning! Today marks the first day of the #Harvard and #Radcliffe rowing seasons! #nofilter http://t.co/y1OYcOElst", "author": "Harvard"}, {"text": "New research supports the idea that specific brain operations are specialized just for recognizing faces http://t.co/ELCg3itiJF", "author": "Harvard"}, {"text": "Alum @benwizner of the @ACLU talks about his work on the Edward Snowden case http://t.co/eoxCC1Vssf", "author": "Harvard"}, {"text": "Fellow at @RadInstitute is working on a book about social movements in the 20th century http://t.co/1H7rE8kyhO", "author": "Harvard"}, {"text": "Seeing #CesarChavez this weekend? Hear about the filming process from director @diegoluna_ http://t.co/udtZzOZOMo", "author": "Harvard"}, {"text": "Think economic growth is a cure for child undernutrition? Think again http://t.co/EeexMlrLCW", "author": "Harvard"}, {"text": "RT @HarvardIOP: Did you miss out on tickets to today's @JFKJrForum with The West Wing cast? Watch LIVE online at 4 p.m. http://t.co/SDdU3gF…", "author": "Harvard"}, {"text": "Student blog: Taking advantage of Boston, one jog at a time http://t.co/dRty4IHEPP", "author": "Harvard"}, {"text": "See how it feels to be a first-year Harvard student [video] http://t.co/r505OhmBhF", "author": "Harvard"}, {"text": "Grad students tackle enormous data sets http://t.co/rlL5Xxem8E", "author": "Harvard"}, {"text": "Autism as a facet of experience, not a limit: Temple Grandin shares firsthand insights from her work and activism http://t.co/ysKv3TDXaq", "author": "Harvard"}, {"text": "The intensifying debate over compensation for student-athletes and recent legal challenges to NCAA rules http://t.co/zPCz6wukIs", "author": "Harvard"}, {"text": "The College's incoming class of 2018 comes from all regions of the U.S. and throughout the world http://t.co/LJlFcb8rGC #Harvard2018", "author": "Harvard"}, {"text": "Harvard alum discusses his work as counsel to Edward Snowden http://t.co/wxSUQQC5As", "author": "Harvard"}, {"text": "For Cambridge kids, teaching science through pizza http://t.co/fkbguNCIgO", "author": "Harvard"}, {"text": "A famed clash between Apple co-founders @stevewoz and Steve Jobs, reimagined as a manga-style graphic novel http://t.co/PEqvRG4uHT", "author": "Harvard"}, {"text": "RT @CharlieRoseShow: The President of @Harvard, Drew Faust, and @GeorgeWillF tonight at 11pm ET on @PBS", "author": "Harvard"}, {"text": "Women in the Arab world http://t.co/zlT4dPMwj5", "author": "Harvard"}, {"text": "Defending Snowden http://t.co/zJxHUL9sBX", "author": "Harvard"}, {"text": "Seventy percent of Harvard students receive some form of financial aid [video] http://t.co/rM5fLQdU5c", "author": "Harvard"}, {"text": "Statistics class turns to team competition, cooperation to solve complex problems http://t.co/3gHJ3sN0qe", "author": "Harvard"}, {"text": "RT @HarvardLibrary: The @Harvard Tug of War Team practices its technique, 1888. http://t.co/icwrmp9RDA  #tbt http://t.co/gfiwm4knOO", "author": "Harvard"}, {"text": "#WelcomeToHarvard College Class of 2018! #Harvard2018 http://t.co/XacywCKtLO", "author": "Harvard"}, {"text": "In Harvard College, students have a 10-day term to explore passions, pursue interests and learn about academic fields http://t.co/WzsSwr6Rh3", "author": "Harvard"}, {"text": "Harvard Yard is home to more than 375 years of history. Take a free, student-led tour and discover and learn more http://t.co/c8fSJ2kjt3", "author": "Harvard"}, {"text": "RT @harvardcrimson: .@hoopsatharvard HC Tommy Amaker is a finalist for the Ben Jobe Award as 1 of the top minority coaches in basketball ht…", "author": "Harvard"}, {"text": "Contrary to popular belief, economic growth has little effect on the nutritional status of poorest children http://t.co/DIoEjB5i2c", "author": "Harvard"}, {"text": "RT @HarvardAlumni: LIVE TONIGHT: Watch a faculty panel on public service at 6:00pm to kick off #HarvardServes http://t.co/Sz35khBCpZ", "author": "Harvard"}, {"text": "Two Harvard College students deliver pizza (with some #STEM education baked in) to Cambridge middle school kids http://t.co/ODmsNeUsMx", "author": "Harvard"}, {"text": "Digital exhibit explores creative process of a maestro http://t.co/k6mWGv17bI", "author": "Harvard"}, {"text": "The music of the Harvard Quadrangle [photos] http://t.co/3eDhb4XcSL", "author": "Harvard"}, {"text": "Clues to how face recognition works http://t.co/huNbGAbsiM", "author": "Harvard"}, {"text": "Radcliffe fellow probes rise of 20th-century social movements http://t.co/EiVEJh11KF", "author": "Harvard"}, {"text": "What does it look like go to Harvard? Check out our Instagram to see pics, like one of the first-year dining hall http://t.co/4MF1AKMpne", "author": "Harvard"}, {"text": "First comprehensive atlas of human gene activity released http://t.co/O9OXErR2IS", "author": "Harvard"}, {"text": "Research aims to determine what keeps peace between democracies http://t.co/3WKEMNJqUF", "author": "Harvard"}, {"text": "How education systems fare during periods of great turmoil and strife within a country [audio] http://t.co/gBtjGWLvWX", "author": "Harvard"}, {"text": "Student blog: Returning to reality after spring break isn't too bad when Harvard Square is where you're headed http://t.co/RNC19XZj1V", "author": "Harvard"}, {"text": "The United States is simply too sweet for its own good http://t.co/WD5ryQFoO7", "author": "Harvard"}, {"text": "New study looks at the mechanisms behind facial recognition http://t.co/ub1KxfOnNc", "author": "Harvard"}, {"text": "\"I have to be very respectful of what I want the audience to feel. The music’s going to change everything.” http://t.co/6Ptsdn0jhT", "author": "Harvard"}, {"text": "Reflections on digitizing the works of Seamus Heaney http://t.co/EUi3yvt4ox", "author": "Harvard"}, {"text": "Music as a mood shifter, and the rewards and challenges of creative tension, as illuminated by @MrJasonRBrown http://t.co/bTyLO8gCif", "author": "Harvard"}, {"text": "Everyone has something to learn from the humanities http://t.co/9o2wZkzWfF", "author": "Harvard"}, {"text": "Dispelling the notion that grad school and careers in academia are generally beyond the reach of minority students http://t.co/vAWj6KtOAS", "author": "Harvard"}, {"text": "An undergrad string quartet is creating a robust music scene in the Quadrangle http://t.co/kAzKdmvq1q", "author": "Harvard"}, {"text": "New group of drugs may have the potential to treat conditions ranging from heart attacks to cancer metastasis http://t.co/m1aPtWcae1", "author": "Harvard"}, {"text": "A @HarvardHBS case by @noamwass on the history of Apple gets reimagined as a graphic novel http://t.co/5eLEiuAYvR http://t.co/jpJgNYCblm", "author": "Harvard"}, {"text": "New online exhibition honors life of commitment to music http://t.co/OCtqltQas2 http://t.co/7UPcCnY2RI", "author": "Harvard"}, {"text": "The ethics of jazz, according to @HerbieHancock [video] http://t.co/guMRrs59zE", "author": "Harvard"}, {"text": "String quartet helps create a robust music scene in the Quadrangle http://t.co/yUl4BBz175", "author": "Harvard"}, {"text": "RT @HarvardIOP: Join us tonight in the @JFKJrForum for a conversation w/ @TeachForAmerica CEO and Founder @wendykopp. http://t.co/ebxJNPSgHP", "author": "Harvard"}, {"text": "Conference featuring @claychristensen examines ‘disruptions’ in law and marketplace http://t.co/CjNdGJneus", "author": "Harvard"}, {"text": "Study finds path to safer drugs for heart disease and cancer http://t.co/GjbPmtcR42", "author": "Harvard"}, {"text": "On @iTunesU, listen to all-star Harvard professors speak for ten minutes about something they are passionate about http://t.co/Jzi0y9kBBQ", "author": "Harvard"}, {"text": "Should governments have the ability and the right to hack, and to weaken global communications networks? [audio] http://t.co/0BLa4c1WIT", "author": "Harvard"}, {"text": "RT @MemChurch: REMINDER: @joshuadubois, former assistant to @BarackObama, is delivering the Noble Lecture on April 7 — http://t.co/BhNKn1Yp…", "author": "Harvard"}, {"text": "Staffers bring a few dozen awesome oddities into the light of day http://t.co/BFlnRqGGwG", "author": "Harvard"}, {"text": "New childhood TB cases double earlier estimates http://t.co/4LOje8OcGL", "author": "Harvard"}, {"text": "Live stream 12:30pm ET @BerkmanCenter: Troll Wrastling for Beginners: Data-Driven Methods to Decrease Hatred Online http://t.co/Ww1RIM36MZ", "author": "Harvard"}, {"text": "A famed clash between Apple co-founders Steve Wozniak and Steve Jobs, reimagined as a manga-style graphic novel http://t.co/5LJ2WpAjeE", "author": "Harvard"}, {"text": "Harvard hosts symposium to encourage more minority students to pursue Ph.D.s http://t.co/4DyK4MH95y", "author": "Harvard"}, {"text": "Harvard program shows Cambridge schoolchildren the realities of higher education http://t.co/yuqEg3eYBz", "author": "Harvard"}, {"text": "Some \"healthy” fruit drinks that Americans drink have the amount of sugar in six cookies http://t.co/qITvSH4U3i", "author": "Harvard"}, {"text": "Giving employees more privacy can increase their productivity [audio] http://t.co/F4NtA8kLHZ", "author": "Harvard"}, {"text": "How to make change in an inflexible organization http://t.co/UNCLdCw6j0", "author": "Harvard"}, {"text": "What do MOOCs mean for the brick and mortar university? [video] http://t.co/E0NVEltnMS", "author": "Harvard"}, {"text": "Harvard professor wins 'Nobel Prize for water' http://t.co/SwbMLZbdRs", "author": "Harvard"}, {"text": "Jason Robert Brown (@MrJasonRBrown), artist in residence, explains his craft as his latest show runs on Broadway http://t.co/UXGuLHlb9f", "author": "Harvard"}, {"text": "Enjoys the works at @harvartmuseums from anywhere with exhibitions online http://t.co/IGjMn2s7FU http://t.co/K9iOM1g0ga", "author": "Harvard"}, {"text": "A stunning view inside Annenberg Hall during Spring Recess http://t.co/bh3gudTHGl", "author": "Harvard"}, {"text": "RT @nbastats: #StatLineOfTheNight goes to @aldridge_12. Aldridge had 25p, 18r, 4a & 4b in a playoff-berth-clinching 100-94 W over NOP. Huge…", "author": "NBA"}, {"text": "RT @Suns: \"Our crowd was great. They were into it and our guys were fired up.\" - Hornacek on playoff atmosphere #SunsVsThunder", "author": "NBA"}, {"text": "RT @trailblazers: Playoff bound! #RipCity http://t.co/kynW1YG96u", "author": "NBA"}, {"text": ".@trailblazers clinch playoff berth w/ 100-94 W over @PelicansNBA. Aldridge had a massive 25-18-4 + 4b. Lillard w/ 20-6-5. Davis w/ 15p, 4b", "author": "NBA"}, {"text": "Final: @warriors top @utahjazz 130-102. Curry w/ 31p, 16a in less than 30 mins. Thompson w/ 33. Burke paced UTA w/ 24p & career-high 15a", "author": "NBA"}, {"text": "Props to both teams: an amazing game. Final: @suns 122, @okcthunder 115.", "author": "NBA"}, {"text": "RT @NBA_AU: .@StephenCurry30 became the first player in @NBA history to have 30+ pts and 15+ ast while logging less than 30 mins. #NBAinAUS", "author": "NBA"}, {"text": "RT @ChrisPalmerNBA: Complete bedlam in Phoenix right now. Suns fighting for their playoff lives.", "author": "NBA"}, {"text": "RT @Suns: Don't be alarmed. That noise you hear is the @USAirwaysCenter crowd losing their collective minds. Suns up 119-112. #SunsVsThunder", "author": "NBA"}, {"text": "PHX 115, OKC 112. 55.4 seconds to go. #Thriller @NBATV", "author": "NBA"}, {"text": "RT @Suns: .@PJTUCKER17 gets the layup to give him 19 points and to put your Suns up 111-110 with 2:39 to go. #SunsVsThunder", "author": "NBA"}, {"text": "#Thriller @NBATV That is all.", "author": "NBA"}, {"text": "RT @royceyoung: Kevin Durant, so very good.", "author": "NBA"}, {"text": "OKC and PHX, tied at 105. 5:55 to play. Such a good game. @NBATV", "author": "NBA"}, {"text": "#GreatGameAlert PHX 103, OKC 100 8:19 to play @NBATV", "author": "NBA"}, {"text": "RT @okcthunder: Video: the play that got Kevin Durant to 25 points for 41st straight game. http://t.co/238Tfc7ieF", "author": "NBA"}, {"text": "RT @nbastats: Longest Single-Season Streaks of 25+points", "author": "NBA"}, {"text": "RT @nbastats: Longest Single-Season Streaks of 25+points", "author": "NBA"}, {"text": "Durant. Westbrook. Green. Dragic. Bledsoe... this 4Q is going to be so much fun... @NBATV Must-watch", "author": "NBA"}, {"text": "41 consecutive games with 25 points for @KDTrey5, surpassing MJ's 40 in 1986-1987. http://t.co/OEdstwBhEa", "author": "NBA"}, {"text": "After 3, we've got a good one! @suns lead @okcthunder 94-91. Watch: @NBATV", "author": "NBA"}, {"text": "RT @paulcoro: Durant passes Jordan with his 41st consecutive 25-point game. Now trails Robertson (46) and Chamberlain (80). PHX 94-91.  #Su…", "author": "NBA"}, {"text": "RT @royceyoung: Kevin Durant has scored at least 25 points in 41 consecutive games, topping Michael Jordan's mark of 40 set in 1986-87.", "author": "NBA"}, {"text": "KD seems all mellow-- and then does something like this! @suns/@okcthunder on NBATV #NBARapidReplay http://t.co/vwsA4XiJGB", "author": "NBA"}, {"text": "RT @gswstats: Stephen Curry has his third career 30/15 game (all this season) with 31 points and a career-high-tying 16 assists", "author": "NBA"}, {"text": "RT @NBAFantasy: I mean, get to @NBATV. Dragic with 23, Westbrook with 24 and 8 assists, Durant with a \"quiet\" 21 w/ 4:04 in 3rd Q. Sunday n…", "author": "NBA"}, {"text": "RT @Suns: OKC takes the timeout with 3:10 to go in the 3rd. Your Suns lead 92-83. Gerald Green with 18 points. #SunsVsThunder", "author": "NBA"}, {"text": "Durant for 3. A thing of beauty. @suns/@okcthunder #NBARapidReplay on NBATV http://t.co/le29IRln2E", "author": "NBA"}, {"text": "The Dragon showcasing more smooth moves! @suns/@okcthunder on NBATV #NBARapidReplay http://t.co/6LrKJSbOEc", "author": "NBA"}, {"text": "RT @NBAFantasy: 44 points combined for the splash brothers on 9-13 from 3PT at the half. Steph also has 11 assists. No big deal. #CannonBal…", "author": "NBA"}, {"text": "After 2, @warriors lead @utahjazz 66-52. Curry w/ a ridiculous 20p, 11a (already!); Thompson w/ 24p. Burke leads UTA w/ 14-3-6", "author": "NBA"}, {"text": "Half: @PelicansNBA lead @trailblazers 55-48. Davis leads w/ 13 & 3 +2b; Ajinca w/ 9 & 4. Aldridge pacing POR w/ 12-10-3", "author": "NBA"}, {"text": "Half: @suns lead @okcthunder 62-53. Dragic dropped 19 on 8/13 shooting. Westbrook w/ a big 19p; Durant w/ 13. Good 2H comin' up on @NBATV", "author": "NBA"}, {"text": "RT @Suns: A medieval television show isn't the only place you can see a Dragon on a Sunday. Dragic has 16 2nd quarter points. #SunsVsThunder", "author": "NBA"}, {"text": "Durant takes the Westbrook dish straight to the rim! @suns/@okcthunder on NBATV #NBARapidReplay http://t.co/2IJ1HogU4M", "author": "NBA"}, {"text": "The Dragon in action! Moves galore. @suns/@okcthunder on @NBATV #NBARapidReplay http://t.co/WRXVOvTwAx", "author": "NBA"}, {"text": "RT @HoustonRockets: Rockets win! Beat Denver 130-125 in OT. @JHarden13 32p/10r & the 3 that sent it to OT. @AsikOmer was beastly 18p/23r. h…", "author": "NBA"}, {"text": "Final: @HoustonRockets get the huge comeback win over DEN in OT, 130-125. Harden had 32-4-10; Asik had 18 & 23. Brooks led DEN w/ 24-8-15", "author": "NBA"}, {"text": "RT @HoustonRockets: Chandler for 3. Chandler for 3 again. Rockets up 130-122, 1:54 OT.", "author": "NBA"}, {"text": "RT @denvernuggets: What a game. 5 #Nuggets have scored 15+ points tonight. Brooks leads team w/ 24pts & 15asts.", "author": "NBA"}, {"text": "RT @NBAFantasy: James. Harden. #IceWater", "author": "NBA"}, {"text": "#OTalert @HoustonRockets rally back and a Harden 3 gives us #FreeBasketball", "author": "NBA"}, {"text": "After 1, @suns lead @okcthunder 28-25. Plumlee w/ 6 & 5. Westrook w/ 9-2-2; Durant w/ 8-2-1. @NBATV", "author": "NBA"}, {"text": "RT @HoustonRockets: Foye hits 1/2 FT, #Rockets rebound & call timeout with 10.1 left and the ball, down 3.", "author": "NBA"}, {"text": "RT @denvernuggets: Ruled a common foul. Lin hits both FT's. DEN leads 116-114.", "author": "NBA"}, {"text": "RT @HoustonRockets: Here comes the Beard. Harden's up to 27 pts, runner puts HOU within 4, 1 minute left.", "author": "NBA"}, {"text": "RT @nbastats: How does @KDTrey5's 40-game 25+points streak stack up with Jordan's? We dive in here:  http://t.co/suRQ6orxEU", "author": "NBA"}, {"text": "Final: @spurs top @memgrizz 112-92. Leonard was stellar w/ 26-3-5, 12/13 shooting; Manu had 26 as well. Johnson led MEM w/ 20-5-3", "author": "NBA"}, {"text": "RT @denvernuggets: Rockets starting to make a late run. 7 straight points has cut the  lead down to 114-108 w/ 1:52 left.", "author": "NBA"}, {"text": "Bledsoe w/ the ridiculous baseline drive... AND 1! @suns/@okcthunder on @NBATV #NBARapidReplay http://t.co/rOmv22nBEz", "author": "NBA"}, {"text": "Plumlee slams home the Bledsoe miss! @suns/@okcthunder #NBARapidReplay on @NBATV http://t.co/0QaG45rsjD", "author": "NBA"}, {"text": "Ball is up! OKC vs. PHX now on @NBATV. Should be a fun one!", "author": "NBA"}, {"text": "RT @trailblazers: Game Time. Go Time. You ready, #RipCity?", "author": "NBA"}, {"text": "RT @HoustonRockets: That #CannanBall 3 gives @SiP03 a new career-high 15 points.", "author": "NBA"}, {"text": "RT @Jonathan_Feigen: Canaan's 4th 3-pointer gives him 15 in 17 minutes off the bench, a new career-high.", "author": "NBA"}, {"text": "#TripleDoubleWatch on for Aaron Brroks, who has 15p, 6r, & 13a early in the 4Q...", "author": "NBA"}, {"text": "RT @NBAFantasy: Aaron Brooks is hoopin': 13 points, 12 assists and 6 rebounds for the diminutive one after three quarters in Houston.", "author": "NBA"}, {"text": "RT @denvernuggets: #Nuggets come out of the halftime break & outscore the Rockets 36-19 in the 3Q to tie the game @ 88. 5 different #Nugget…", "author": "NBA"}, {"text": "RT @spurs: At the end of the 3rd Q, Spurs lead Grizzlies 81-67. Live stats: http://t.co/OvyWYwJ066 #GoSpursGo", "author": "NBA"}, {"text": "RT @spurs: Midway through the 3rd Q, Spurs lead the Grizzlies 75-52. Leonard 21 pts, 5 ast and 3 reb. Live stats: http://t.co/OvyWYwJ066 #G…", "author": "NBA"}, {"text": "Final: @ATLHawks get the convincing 107-88 W over @Pacers. Teague led w/ 25; Antic had season-high 18; Millsap w/ 17 & 11. West w/ 13-6-6", "author": "NBA"}, {"text": "Final: @dallasmavs win the nail-biter, 93-91 over @SacramentoKings. Ellis led w/ 23-4-4; VC w/ 17-2-3. Gay had 32-6-8; DMC w/ 28 & 10", "author": "NBA"}, {"text": "#LeaguePassAlert still on... DAL 92, SAC 89... 12.7 seconds to play!", "author": "NBA"}, {"text": "RT @HoustonRockets: 17 rebounds. In the first half. http://t.co/nII0xeyCL9", "author": "NBA"}, {"text": "After 2, @HoustonRockets lead @denvernuggets 69-52. Asik has been a beast w/ 12 & 17 + 2b; Harden w/ 12p, 5a. Mozgov, Foye & Brooks w/ 8", "author": "NBA"}, {"text": "#LeaguePassAlert DAL leads SAC 90-87 w/ 36.3 seconds to play!", "author": "NBA"}, {"text": "Half: @spurs lead @memgrizz 54-38. Leonard has had the hot hand, w/ 15-3-3 on 7/7 shooting; Manu w/ 13-2-2. Conley w/ 13p, 3a for MEM", "author": "NBA"}, {"text": "RT @HoustonRockets: .@AsikOmer grabbed a career-high 23 rebounds just last Tuesday in Brooklyn. With 15 before halftime, that mark could ch…", "author": "NBA"}, {"text": "RT @ATLHawks: Pero with a season-high 18 points tonight...previous was 17.", "author": "NBA"}, {"text": "RT @ESefko: Vince Carter just hit a pair of treys to put Mavericks ahead 81-79 and pass Elgin Baylor for 26th place on the all-time NBA sco…", "author": "NBA"}, {"text": "#LeaguePassAlert DAL leads SAC 81-79 w/ 4:55 to play...", "author": "NBA"}, {"text": "RT @HoustonRockets: Hungry, hungry Asik. Gobbling up boards like crazy. 15 already w/3 minutes left in the half (and 12 points as well). #R…", "author": "NBA"}, {"text": "End 3: Once down 35, @pacers have rallied but still trail @ATLHawks 79-59. Antic leads ATL w/ 16 & 5 on 6/7 shooting. West w/ 11-6-4 @NBATV", "author": "NBA"}, {"text": "RT @NBAFantasy: Omer Asik with 7 points and 10 rebounds already...with 8:41 remaining in the 2nd quarter #2020Vision #WindexMan", "author": "NBA"}, {"text": "RT @dallasmavs: End of 3rd: Mavs retake the lead 68-65 over the  @SacramentoKings Monta 15 points and a highlight dunk in the quarter. #DAL…", "author": "NBA"}, {"text": "RT @HoustonRockets: #Canaanball! @SiP03 hits his 3rd trey of the game, gives HOU  lead, 34-31, 8:41 Q2. 3 3PTM are the most in a game in Ca…", "author": "NBA"}, {"text": "RT @denvernuggets: End of the 1Q and the #Nuggets lead 27-22. Randy Foye has 8pts to lead DEN, @qmillertime w/6pts.", "author": "NBA"}, {"text": "RT @ATLHawks: Pero with 5 straight points...he leads the #ATLHawks with 16 in the game.", "author": "NBA"}, {"text": "RT @spurs: At the end of the 1st Q Spurs lead Grizzlies 26-10. Live stats: http://t.co/OvyWYwJ066 #GoSpursGo", "author": "NBA"}, {"text": "RT @ATLHawks: Paul Millsap with a right thumb contusion his return is TBD.", "author": "NBA"}, {"text": "Mahinmi w/ another powerful throw-down! @atlhawks/@pacers #NBARapidReplay on @NBATV http://t.co/nneE00lKri", "author": "NBA"}, {"text": "After 2, @ATLHawks are up big on @Pacers, 55-23. Millsap leading the way w/ 11 & 6 +2b; Antic w/ 8 & 4. PG leads IND w/ 6 & 5 @NBATV", "author": "NBA"}, {"text": "Half: @SacramentoKings lead @dallasmavs 48-45. Cousins & Gay w/ 16 apiece. Ellis leads DAL w/ 9-1-2 #LeaguePass", "author": "NBA"}, {"text": "RT @ATLHawks: Mike Scott with a 3 and the #ATLHawks lead 42-15....The Bench is fired up.", "author": "NBA"}, {"text": "After 1, @ATLHawks up big on @pacers, 33-11. ATL shooting 66.7%; Millsap leads w/ 9; Antic and Carroll w/ 5 each. @NBATV", "author": "NBA"}, {"text": "RT @Pacers: Vogel pulled all five starters midway through the 1st quarter. Now on the floor for Indiana: Sloan, Turner, Butler, Scola and M…", "author": "NBA"}, {"text": "Mahinmi w/ the MEAN putback slam! @atlhawks vs. @pacers #NBARapidReplay on @NBATV http://t.co/5HgJWzxAUb", "author": "NBA"}, {"text": "Carroll drains the 3 and Hawks are hot early... @atlhawks/@pacers on @NBATV #NBARapidReplay http://t.co/wlx5xoELhB", "author": "NBA"}, {"text": "IND vs. ATL now live on @NBATV #PlayoffPush", "author": "NBA"}, {"text": "FINAL: @LAClippers top @Lakers 120-97. Paul and BG w/ 23 apiece; DJ w/ 11 & 12 +4b. Hill led LAL w/ 22 & 9; Marshall w/ 10p,11a", "author": "NBA"}, {"text": "RT @NBATV: Plenty of playoff implications in tonight's doubleheader. @ATLHawks/@Pacers followed by @okcthunder/@Suns. Next! http://t.co/Ues…", "author": "NBA"}, {"text": "TURKOGLUUUUU!!! @Lakers/@LAClippers on ABC #NBARapidReplay http://t.co/3YaSBbyvqK", "author": "NBA"}, {"text": "RT @mcten: The ice bag is off and Nick Young is going back in the game.", "author": "NBA"}, {"text": "RT @SacramentoKings: #KingsSelfie with @vivek! #PejaTakeover #viveking http://t.co/ZEQbYr5qSI", "author": "NBA"}, {"text": "Tonight's @NBATV #playoffpush Schedule: @ATLHawks/@Pacers (6pm/et), @OKCThunder/@Suns (9pm/et). http://t.co/OR9DUuEqXs", "author": "NBA"}, {"text": "End 3Q: @LAClippers 94, @Lakers 72. CP3 w/ an efficient 23-4-6 on 8/10 shooting, 4/4 from 3; DJ w/ 11 & 12 + 4b. Hill w/ 20 & 9 #NBAonABC", "author": "NBA"}, {"text": "RT @MadelynBurke: First Bazemore, now Nick Young is down... heads to the bench with #Lakers trainer Gary Vitti", "author": "NBA"}, {"text": "RT @LAClippers: .@deandrejordan with 11 pts, 12 rebs, 4 blks. He's 1 of only 8 guys with 40 double-doubles this year. His previous best was…", "author": "NBA"}, {"text": "RT @LAClippers: .@CP3 ON FIRE. He's 8-for-9 (4-for-4 from 3) 21 pts", "author": "NBA"}, {"text": "Griffin w/ the perfect lob to DJ - you know what comes next... @Lakers/@LAClippers on ABC #NBARapidReplay http://t.co/L9dmFtkWkV", "author": "NBA"}, {"text": "DeAndre Jordan w/ the MONSTER jam - AND 1! @Lakers/@LAClippers on #NBAonABC #NBARapidReplay http://t.co/57UBDmmj84", "author": "NBA"}, {"text": "Want to go to the #NBAFinals? You could win tix by following @NBACares & sharing your #NBAGreen act to @Sprint! http://t.co/22f3uLF7dG", "author": "NBA"}, {"text": "Half: @LAClippers lead @Lakers 57-49. BG w/ 16-4-3; CP3 w/ 13-3-3; J.J. w/ 11-2-2. Young led LAL w/ 17p; Hill w/ 16 & 5 #NBAonABC", "author": "NBA"}, {"text": "RT @LAClippers: JJ & CP3 have started a combined 10-for-13 (23 pts)", "author": "NBA"}, {"text": "RT @Lakers: Jordan Hill & #SwaggyP have combined for 29 points, but the Clippers have opened up a 47-39 lead with 4:20 left in the 1st half.", "author": "NBA"}, {"text": "Blake gets the steal, drives the length of the court... SLAM. @Lakers/@LAClippers on #NBAonABC #NBARapidReplay http://t.co/664OJOMChn", "author": "NBA"}, {"text": "SwaggyP feeling it w/ an early 13p! @Lakers/@LAClippers on #NBAonABC #NBARapidReplay http://t.co/gx1XnaRk4t", "author": "NBA"}, {"text": "After one, @LAClippers lead @Lakers 25-22. Young & Hill w/ 8 apiece in the early going. Redick and Paul w/ 7 each for LAC. #NBAonABC", "author": "NBA"}, {"text": "Big Baby w/ the nice look to DJ for the JAM! @Lakers/@LAClippers on #NBAonABC #NBARapidReplay http://t.co/VO3blYVvEb", "author": "NBA"}, {"text": "You can also vote for the 2014 #KiaMVP by tweeting player's first & last name along with #KiaMVP", "author": "NBA"}, {"text": "RT @nbacares: Check out these great #NBAGreen tips from @NBA players on small acts you can do to make a big difference! http://t.co/a355qOH…", "author": "NBA"}, {"text": "Vote for YOUR 2014 #KiaNBAMVP & enter sweepstakes for chance to win a trip to the 2014 #NBAFinals: http://t.co/CbCrQSfqD6", "author": "NBA"}, {"text": "RT @LAClippers: 8:31 1Q; #Clippers 11, Lakers 6. LAC has 5 FGs, 4 asts. @blakegriffin32 4 pts #BackInBlue", "author": "NBA"}, {"text": "Barnes to Griffin for the SLAM! @LAClippers vs. @Lakers on #NBAonABC #NBARapidReplay http://t.co/kyOFfvrgbH", "author": "NBA"}, {"text": "RT @nbastats: JR Smith set @NBA records for the most 3's made over a 3-game span (24) & most 3's attempted in 1 game (22)", "author": "NBA"}, {"text": "It's a wrap: @MiamiHEAT top @nyknicks 102-91. LeBron had a big day w/ 38-5-6; Chalmers w/ 15-4-4. Smith made NYK record 10 3's in the loss", "author": "NBA"}, {"text": "RT @nbastats: JR Smith has set a new @nyknicks record for 3's made in a game with 10!", "author": "NBA"}, {"text": "10 3's for J.R. Smith! But Knicks still trail Miami 100-91. #NBAonABC", "author": "NBA"}, {"text": "J. R. Smith ON FIRE from beyond the arc. But will it be enough? #NBAonABC", "author": "NBA"}, {"text": "RT @nyknicks: #FoxwoodsFinalFive Update: 7-0 run from the #Knicks and they quickly trim Miami's lead to 92-85 with 4:08 left in the game.", "author": "NBA"}, {"text": "RT @nyknicks: From ABC: @TheRealJRSmith has the most 3s in a 3-game span in @NBA history with 22 and counting. #Knicks", "author": "NBA"}, {"text": "STAT!!! Not playing around. @NYKnicks/@MiamiHeat on #NBAonABC #NBARapidReplay http://t.co/oHqRHBMyGl", "author": "NBA"}, {"text": "LeBron is dropping dagger 3's. He now has 34-4-5. Time running out for NYK #NBAonABC", "author": "NBA"}, {"text": "RT @nbacares: The @MiamiHEAT’s @AAarena uses 53% less energy than the average facility of similar size and type. #gamechanger #NBAGreen", "author": "NBA"}, {"text": "Heat starting to pull away. Do the Knicks have a run in them? #NBAonABC", "author": "NBA"}, {"text": "After 3 @nyknicks are battling for their playoff lives and trail @MiamiHEAT 73-64. LeBron now has 26-4-3. Get ready for 4Q! @NBAonABC", "author": "NBA"}, {"text": "Ray Allen w/ the silky corner 3! @NYKnicks/@MiamiHeat on @NBAonABC #NBARapidReplay http://t.co/dOZ6N60w8Z", "author": "NBA"}, {"text": "RT @nyknicks: Smith your high-scorer with 17pts for the #Knicks as they face a 66-62 deficit with 2:42 left in the 3Q. Chandler w/ 9rebs.", "author": "NBA"}, {"text": "LeBron receives the nice pass for the flush! Late 3Q, @NYKnicks vs. @MiamiHeat on @NBAonABC #NBARapidReplay http://t.co/7GwhxT6I6R", "author": "NBA"}, {"text": "RT @MiamiHEAT: #HEATgame: HEAT leading the Knicks 59-57 with 5:19 remaining in the 3rdQ.", "author": "NBA"}, {"text": "Go green, earn green! Share your acts with #NBAGreen this week for a chance at prizes, & save with @Sprint Buyback at http://t.co/yH3iQrpfPB", "author": "NBA"}, {"text": "RT @ByTimReynolds: Bosh has six rebounds this quarter already, and it's not even half over.", "author": "NBA"}, {"text": "RT @MiamiHEAT: #HEATgame: An awesome @ThisIsUD hustle play continues the HEAT possession - leading to a @ChrisBosh jumper! HEAT up 1!", "author": "NBA"}, {"text": "Alley-oop! (sorta...) Bosh cleans up the miss for the dunk! @NYKnicks vs. @MiamiHeat on @NBAonABC #NBARapidReplay http://t.co/ReAonfGm5V", "author": "NBA"}, {"text": "RT @ChrisPalmerNBA: LeBron's first 4 minutes: 0 pts, 4 TOs. Next 15 minutes: 16 pts, 0 TOs.", "author": "NBA"}, {"text": "Good 1H in the books! @nyknicks leading @MiamiHEAT 50-48. Smith leads all w/ 17p, 5 3pm; Chandler w/ 10 & 6. LeBron w/ 16-2-3. @NBAonABC", "author": "NBA"}, {"text": "RT @NBAFantasy: #OceanViewAlert in MIA for @TheRealJRSmith , zoned in from deep, leading all scorers with 17 pts and 5 trey balls #Buckets", "author": "NBA"}, {"text": "NYK on fire from 3 (7/15, 46.7%). NYK 41, MIA 40 w/ end of half approaching.", "author": "NBA"}, {"text": "RT @nbacares: LEED certification. Solar power. Here are a few key off-the-court stats on how @NBA teams & arenas are going green! http://t.…", "author": "NBA"}, {"text": "RT @nyknicks: Smith buries a shot from downtown to trim the Heat's lead to 36-31 at the 5:39 mark of the 2Q. Smith has 9pts, Chandler w/ 8.…", "author": "NBA"}, {"text": "Felton nice feed to Chandler = SLAM. @NYKnicks vs. @MiamiHeat on @NBAonABC #NBARapidReplay http://t.co/GlHlHX7f7r", "author": "NBA"}, {"text": "RT @MiamiHEAT: #HEATgame: A Ray Allen 3-pointer forces a Knicks timeout! HEAT have overcome an early 13-point deficit, currently lead 34-26.", "author": "NBA"}, {"text": "Patented smooth Ray Allen 3 -- and LBJ is feelin' it! @NYKnicks vs. @MiamiHeat on @NBAonABC #NBARapidReplay http://t.co/nCqqK00QFF", "author": "NBA"}, {"text": "RT @NBAFantasy: Huge matinee in Miami - @nyknicks came to COMPETE... JR Smith and Tyson with 6 a piece, Melo w/5 after 1", "author": "NBA"}, {"text": "It's been a game of runs: first NYK, then MIA. After 1Q: @nyknicks 26, @MiamiHEAT 25. LeBron leads all w/ 9 @NBAonABC", "author": "NBA"}, {"text": "LeBron w/ the ridiculous AND 1! @NYKnicks vs. @MiamiHeat on @NBAonABC #NBARapidReplay http://t.co/X15vGoQAYe", "author": "NBA"}, {"text": "Schumpert to Chandler, who drops the hammer! @nyknicks vs. @MiamiHeat on @NBAonABC #NBARapidReplay http://t.co/AW25oxTCcK", "author": "NBA"}, {"text": "Minimize Your Driving - Plan ahead before cruising around town to do errands. #NBAGreen", "author": "NBA"}, {"text": "RT @MiamiHEAT: #HEATgame: With 5:50 remaining in the 1stQ, HEAT trail the Knicks 16-10.", "author": "NBA"}, {"text": ".@nyknicks open w/ some urgency, up 16-5 over @MiamiHEAT w/ 8:27 left in 1Q. @NBAonABC", "author": "NBA"}, {"text": "RT @nyknicks: Smith just dropped a 3-ball in from the wing to give the #Knicks an early 14-3 1Q lead over MIA. 9:37 left in the period. Smi…", "author": "NBA"}, {"text": "Ball is up! @NYKnicks vs. @MiamiHEAT on @NBAonABC", "author": "NBA"}, {"text": "RT @nbastats: Since March 5, @nyknicks rank 1st in Offensive Rating (112.1) & they have the 3rd best record in that span (12-4) #NYKvMIA", "author": "NBA"}, {"text": "On #InsideStuff, @dougmcd3 sits down with @realgranthill33 to talk about career at @BluejayMBB & @NBADraft: http://t.co/8D8hBd7zMO", "author": "NBA"}, {"text": "Today's #NBAonABC Schedule: #NBACountdown (12:30pm/et), @NYKnicks/@MiamiHEAT (1et), @Lakers/@LAClippers (3:30pm/et) http://t.co/s70qlXltqP", "author": "NBA"}, {"text": "RT @iHoopsTweets: Raise your game with the help of @UKCoachCalipari @KlayThompson @Paul_George24, @AntDavis23 & @KyrieIrving and others htt…", "author": "NBA"}, {"text": "The @spurs & @LAClippers are Division Champs! Visit http://t.co/sPXhc5sdQm for the latest Playoff Bound Gear today! http://t.co/fYJdV5d2ue", "author": "NBA"}, {"text": "The @HoustonRockets' @DwightHoward named Kia Community Assist Award Winner for March: http://t.co/omgfkmhyzK http://t.co/TCpPHs9CiA", "author": "NBA"}, {"text": "RT @NBAcom: Chattin' w/'The Cap': @kaj33 visits #GameTime to discuss the anniversary of his scoring record http://t.co/kD7PiGf8ql http://t.…", "author": "NBA"}, {"text": "RT @NBAcom: It's playoff time, Charlotte! @KembaWalker talks about the  @bobcats berth-clinching win http://t.co/Mz9HYX9QV4 http://t.co/8U4…", "author": "NBA"}, {"text": "RT @NBAcom: Playoff picture: #Bobcats clinch a spot, #Bulls tie #Raptors for No. 3, #Nets get some space http://t.co/OJQ5yc3md0 http://t.co…", "author": "NBA"}, {"text": "RT @nbastats: Al Jeff dominates again (24pts,15rbs, 4asts) as @bobcats clinch a playoff berth...Recap the Night in #NBAStats: http://t.co/E…", "author": "NBA"}, {"text": "Career-high 44 points, 8 assists & 7 rebounds for @KyrieIrving, @NBAcom's #NightlyNotable: http://t.co/rKwLJjDpon", "author": "NBA"}, {"text": "RT @bobcats: #CaptionThis! Congrats to @KembaWalker & @MKG14's college teams going head-to-head in the #NCAA Championship Game! http://t.co…", "author": "NBA"}, {"text": "The @Sixers' @MCW1 gets into the lane for the poster slam to lead Saturday's Top 5 Plays! http://t.co/lLZeXDnYHG", "author": "NBA"}, {"text": "The @Orlando_Magic @chicagobulls @bobcats @DetroitPistons @BrooklynNets & @Raptors each pick up wins Saturday: http://t.co/0WUevJTLHv", "author": "NBA"}, {"text": "Wow... @BrandonKnight07 with the filthy crossover & vicious slam!! http://t.co/nyAX8f09OK", "author": "NBA"}, {"text": "RT @nbastats: #StatLineOfTheNight goes to Al Jefferson. Big Al had 24p, 15r, 4a, 1s & 2b as CHA beat CLE 96-94 in OT, and clinched a playof…", "author": "NBA"}, {"text": "RT @Raptors: #Raptors edge Bucks 102-98. Greivis 26 pts, DeMar 23 pts, JV 17 & 13 in franchise-record 21st road #VictoryBaby #RTZ http://t.…", "author": "NBA"}, {"text": "Final: @Raptors win the nail-biter 102-98 over @Bucks. Vasquez led w/ 26-4-4; Valanciunas had 17-13-3. Henson had a big night w/ 23-9-6 +3b", "author": "NBA"}, {"text": "RT @Raptors: The All-Star DeMar DeRozan gets his 12th & 13th 4th-quarter points at the line to put #Raptors up on Bucks 100-96. 18 seconds …", "author": "NBA"}, {"text": "RT @Sixers: HIGHLIGHT: MCW Puts Kirilenko on a Poster –  http://t.co/bHm2WwOuyy", "author": "NBA"}, {"text": "#LeaguePassAlert TOR 91, MIL 88. 2:14 to play...", "author": "NBA"}, {"text": "RT @cf_gardner: Knight rebounds his own miss and Bucks trail 89-88 with 2:52 left. All 5 Bucks players in game now have 13 or more points.", "author": "NBA"}, {"text": "RT @Raptors: Give Vasquez six three-pointers tonight and the #Raptors are back up on the Bucks 86-84 with 5 mins to play in Milwaukee. #RTZ", "author": "NBA"}, {"text": "#TripleDoubleWatch for John Henson, who has 19p, 8a & 6r midway through the 4th...", "author": "NBA"}, {"text": "Good one in progress as MIL leads TOR 80-79 w/ under 8:00 to play... #LeaguePass", "author": "NBA"}, {"text": "RT @bobcats: PLAYOFFS HERE WE COME!!!!! Final: Cats win 96-94 in OT behind #BigAl's 24pts & @CodyZeller's 1st career double-double 12pts 11…", "author": "NBA"}, {"text": "Wow, wild game! @bobcats top @cavs 96-94 in OT. Al Jeff w/ 24-15-4 +2b; Kemba w/ 20-4-7. Kyrie had a massive 44-7-8 +3s in the loss", "author": "NBA"}, {"text": "RT @PDcavsinsider: Spencer Hawes hits a 3 with 4.9 seconds left, cuts Charlotte's lead to 95-94. Bobcats take timeout, 4.1 left. #Cavs", "author": "NBA"}, {"text": "RT @bobcats: .@KembaWalker 1-2 at the line to give the Cats a 93-91 lead. :11.6 remaining in OT #CHAvsCLE", "author": "NBA"}, {"text": "RT @NBAcom: Kareem (@kaj33) joins the #GameTime crew on the 30th anniversary of snatching the all-time #NBA scoring title: http://t.co/UKUw…", "author": "NBA"}, {"text": "Final: @DetroitPistons come back from 19 down and beat @celtics, 115-111. Drummond w/ a huge 19p, 20r (9/11 shooting). Sullinger w/ 22-10-5", "author": "NBA"}, {"text": ".@BrooklynNets hold on, beat @sixers 105-101 in a tight one. D-Will led w/ 19-4-9; Plumlee had 16 & 7. Young led PHI w/ 20-5-3", "author": "NBA"}, {"text": "(That's a career high for Irving)", "author": "NBA"}, {"text": "Kyrie Irving NOT messing around tonight. 44p, 7r, 8a, 3s -- and we're still in OT", "author": "NBA"}, {"text": "RT @Sixers: Brooklyn hits their two FTs, but Hollis Thompson responds with ANOTHER three! 103-101 Brooklyn lead w/ 10.6 seconds left.", "author": "NBA"}, {"text": "RT @DetroitPistons: Dre tips it in and ties it up!", "author": "NBA"}, {"text": "RT @DetroitPistons: Looks like this one will go down to the wire.", "author": "NBA"}, {"text": "#OTalert! @bobcats and @cavs locked at 82 at end of regulation. #FreeBasketball...", "author": "NBA"}, {"text": "RT @Sixers: It's 96-94 Brooklyn w/ 1:15 left in regulation. Philly possession.", "author": "NBA"}, {"text": "RT @BobCavsinsider: #Cavs, Bobcats tied at 82-82 with 4.7 seconds left. Charlotte has the ball after time out.", "author": "NBA"}, {"text": "RT @bobcats: .@KembaWalker sinks the 3pt basket! Cats take the lead 82-80 with :32.5 to go in regulation #CHAvsCLE", "author": "NBA"}, {"text": "#LeaguePassAlert BOS 103, DET 102. 5:55 to play...", "author": "NBA"}, {"text": "RT @Sixers: .@ewill901 with a NASTY reverse flush in transition! 90-87 Brooklyn, 3:45 left!", "author": "NBA"}, {"text": "RT @DetroitPistons: #Pistons take the lead on a Jonas THREEEEEE!", "author": "NBA"}, {"text": "Half: @Bucks lead @Raptors 56-47. Middleton, Henson and Sessions all in double figures; Adrien w/ 9 & 8. Vasquez leads TOR w/ 11-2-2", "author": "NBA"}, {"text": "RT @Sixers: Eight-point game in South Philly. 88-80 Brooklyn w/ 6:20 left to play. @MCW1 to the line to shoot two FTs.", "author": "NBA"}, {"text": "RT @Sixers: Hello #SCTop10, Mr. Carter-Williams!", "author": "NBA"}, {"text": "#LeaguePassAlert CHA and CLE locked at 72, 5:39 to play...", "author": "NBA"}, {"text": "@kcscott76 We love the picture, Kevin. Thanks for supporting the Green and White.", "author": "nyjets"}, {"text": "@Omy7 Who else do you like at 18, Omar?", "author": "nyjets"}, {"text": "@SoccerDoc55 Appreciate the love, Edward.", "author": "nyjets"}, {"text": "#JetsNation... http://t.co/U9dbgLS7cX", "author": "nyjets"}, {"text": ".@RichCimini says it was wise not to pursue D-Jax. His take on the WR position & more- http://t.co/ee4tRq6Gmp", "author": "nyjets"}, {"text": ".@RichCimini: Geno Smith will be ‘the guy.'", "author": "nyjets"}, {"text": ".@YouAreFree146 joined #NYJets fans for 1 of our 3 special prescreenings of #DraftDay. The movie opens April 11. http://t.co/n0bb2BOMpc", "author": "nyjets"}, {"text": "http://t.co/24ZgeVvcVO ranks its 5 most improved offenses of this offseason. Check out #3- http://t.co/KvRnm2buXe", "author": "nyjets"}, {"text": "@T_Johnson81 We hope to do more of that for you this year.", "author": "nyjets"}, {"text": "@PhilthyRich29 It's all about executing those Xs and Os.", "author": "nyjets"}, {"text": "@DenBruzzi We've got confidence in our guys to get it done this year, Dennis.", "author": "nyjets"}, {"text": "@9Palaceking We're with you on that, Dondi.", "author": "nyjets"}, {"text": "Who's looking forward to seeing this in real life in a few months? https://t.co/Q5OWZiCjru", "author": "nyjets"}, {"text": ".@RichCimini: “They need another RB.” WATCH- http://t.co/7ShoJlxvJk", "author": "nyjets"}, {"text": "Happy Friday, Jets Nation. Time for that weekend dance! #TouchdownJets http://t.co/SUtBcAxckV", "author": "nyjets"}, {"text": "RT @mowilkerson: Everyday is a great day to be a Jet #jetup #jetlife RT @CroweBoCop: @mowilkerson good day to be a Jet", "author": "nyjets"}, {"text": "Let the competition begin, on April 21! Here’s a look at our offseason workout program- http://t.co/JnNcxSGA53", "author": "nyjets"}, {"text": "Get to know our new Jets, WR @JacobyFord12 & CB Dimitri Patterson- http://t.co/VaVL7wbeno http://t.co/LaB3s15DWK", "author": "nyjets"}, {"text": "We’re LIVE on http://t.co/04XxTdv9Oa to talk free agency and draft with @RichCimini & YOU. Tune into Jets Talk Live now!", "author": "nyjets"}, {"text": "#ThrowbackThursday 1st Round pick Nick Mangold holding down the O-line in a 38-10 victory over Green Bay in 2006. http://t.co/aqYI0mXsld", "author": "nyjets"}, {"text": "@MattyMang18 What would your approach be in the later rounds, Matthew?", "author": "nyjets"}, {"text": "@EJ_Brooklyn_Own Which prospects from those positions do you like this year, EJ?", "author": "nyjets"}, {"text": "Do you ask yourself this daily?", "author": "nyjets"}, {"text": "@AFjumper We're excited to have Dimitri join us, Manny.", "author": "nyjets"}, {"text": "RT @eallenjets: Jets DL is young, nasty and hungry.  A look at one of the best units in all of football: http://t.co/bnIxJTBSka http://t.co…", "author": "nyjets"}, {"text": "@beachtiger0412 We're excited to have Jacoby join the team.", "author": "nyjets"}, {"text": "RT @JetsFlightCrew: WATCH: Flight Crew Audition highlights from this past weekend: http://t.co/boxBHkIUr2 http://t.co/LLWWMNHZaR", "author": "nyjets"}, {"text": "RT @Cumberland85: .@JacobyFord12 welcome aboard #jetlife", "author": "nyjets"}, {"text": "WATCH: “It’s a great fit for me.” New CB Dimitri Patterson is excited about his opportunities in Rex & DT’s defense- http://t.co/zBT2Mmntnz", "author": "nyjets"}, {"text": "We've signed CB Dimitri Patterson. #NFLFreeAgency http://t.co/G9vCKNCZ6H", "author": "nyjets"}, {"text": "RT to welcome our new WR @JacobyFord12 to the Green & White- http://t.co/GNUeFee1Y3 http://t.co/HkHUuVEviV", "author": "nyjets"}, {"text": "RT @eallenjets: The Jets have signed WR Jacoby Ford. http://t.co/8HRt2Krkfr", "author": "nyjets"}, {"text": "RT @rlangejets: Find out which uniform number WR Eric Decker will wear in Jets Green & White this season here: http://t.co/1RSKmASM3M", "author": "nyjets"}, {"text": "NFLN analysts on the possibility of a CJ2K signing- http://t.co/5P6gM4QZAk http://t.co/gehccq0EEu", "author": "nyjets"}, {"text": "“This is a special group of WRs.” NFLN Draft Expert @MoveTheSticks on the 2014 wideout class: http://t.co/Mr4pzEB6Kj http://t.co/hlFXDLg9rr", "author": "nyjets"}, {"text": "@billy_DEE_will That's our safety, Antonio Allen.", "author": "nyjets"}, {"text": "We challenge you, Jets Nation, to... http://t.co/YguJnROyzu", "author": "nyjets"}, {"text": "LB @NBELLORE54 has signed his tender- http://t.co/dourGf1hYR http://t.co/BBFxsHhgHv", "author": "nyjets"}, {"text": "Can't football season just get here already? #ThinkingAboutSeptember #JetsNation http://t.co/IvU6ppruGS", "author": "nyjets"}, {"text": ".@JetsFlightCrew cheerleader auditions are underway! See who’s advancing to the Semifinals- http://t.co/4J0ctJqBE6 http://t.co/yQojvsP4q7", "author": "nyjets"}, {"text": "Rex Ryan won’t rush the QB competition- http://t.co/PWePMDV5EL", "author": "nyjets"}, {"text": "@apmn14 We like how you're thinking, Andy. Always a great atmosphere opening up against division rivals.", "author": "nyjets"}, {"text": "@briankaz7795 Would you be happy opening up against the Fins, Brian?", "author": "nyjets"}, {"text": "We'll be playing one of these teams in our home opener. Who did you get? https://t.co/EDrEI4BtPD", "author": "nyjets"}, {"text": "RT @rlangejets: We've signed free agent CB Jeremy Reeves out of Iowa State: http://t.co/yhxyouBOhb", "author": "nyjets"}, {"text": "#NFLDraft analyst Matt Miller: “If [http://t.co/arghHZZ39p] is on the board I think the Jets have to consider it.” http://t.co/xIkmVYvmu8", "author": "nyjets"}, {"text": "ICYMI: It’s #NationalJoeDay. So we had to take a look at some of our favorite Namath moments- http://t.co/LdDXEj2Py4", "author": "nyjets"}, {"text": "The latest mock drafts have us selecting... http://t.co/2SAFpLmTNb", "author": "nyjets"}, {"text": "Happy #NationalJoeDay! Enjoy a look back at the man himself. This one's for you, Broadway Joe! http://t.co/36QO138BdW", "author": "nyjets"}, {"text": "Competitors on Sundays, but supporters today. @buffalobills you have our #PrayersForJK", "author": "nyjets"}, {"text": "RT @eallenjets: Great analysis from @TonyDungy on the way the Jets are building. Take a look: http://t.co/geeIeY215s http://t.co/iOFf8dKTK5", "author": "nyjets"}, {"text": "@MikeVick how’s this for a cover photo? http://t.co/v6npCbYrTZ", "author": "nyjets"}, {"text": "“Geno Smith’s going to be hard to beat out.” Rex talks QBs at the owners’ meetings- http://t.co/M2mPaWftNt http://t.co/KVdkCQjrh4", "author": "nyjets"}, {"text": ".@Cristiano & the Portugal National Football Team are headed to our training facility. Excited to host them 6/3-6/9 http://t.co/9vN9BhBSPS", "author": "nyjets"}, {"text": "@highxjoanna Love the new beanie, Joanna. It seems your boss knows you well. #JetsNation", "author": "nyjets"}, {"text": "Tony Dungy: Idzik ‘has a great plan’ - http://t.co/Cz2JPAW21m http://t.co/JeWecESJLn", "author": "nyjets"}, {"text": "Woody Johnson on passing of Ralph C. Wilson Jr.: http://t.co/GsgPl9MkcH", "author": "nyjets"}, {"text": "Our deepest condolences go out to the Wilson family and the entire @buffalobills organization.", "author": "nyjets"}, {"text": "WATCH: Former mentor Tony Dungy likes the addition of @MikeVick to the Green & White- http://t.co/h9mQVH5eFq http://t.co/iIKGD3HNyV", "author": "nyjets"}, {"text": "RT @rlangejets: We have received 4 compensatory picks from NFL: a 4th-rounder (No. 137), three 6th-rounders (Nos. 209, 210, 213): http://t.…", "author": "nyjets"}, {"text": "ICYMI: @MikeVick talked with @eallenjets minutes after signing his deal WATCH- http://t.co/aGN0PNvcq2", "author": "nyjets"}, {"text": "@strictlysportsG We like where your head is at, George.", "author": "nyjets"}, {"text": "@frankieneroX Division rivals make for a great home opener, Frankie.", "author": "nyjets"}, {"text": "@MagicBravesJets Nothing like opening up against a division rival, Matt.", "author": "nyjets"}, {"text": "Who do you most want to see us face in our 2014 #JetsHomeOpener? http://t.co/lNKraauuAs", "author": "nyjets"}, {"text": "Want an autographed Jets photo? Find out who signed it on Snapchat, OfficialNYJets, and tweet us the answer @ 1pm & it could be yours!", "author": "nyjets"}, {"text": "“@Mark_Sanchez: To New York, New Jersey and Jets fans everywhere ... http://t.co/1pCRLKPsZg” Thanks, Mark. We're rooting for you.", "author": "nyjets"}, {"text": "Happy birthday, Chris! Send your birthday wishes to @Ivory33. http://t.co/vLvtWmwXam", "author": "nyjets"}, {"text": "RT @eallenjets: Just spoke with @MikeVick immediately after he signed his deal. Here is the interview: http://t.co/hHGAdz4yCU", "author": "nyjets"}, {"text": "Marty Mornhinweg on Vick: \"He's here in a role where he’s going to compete and push Geno Smith to become the very best that he can be.\"", "author": "nyjets"}, {"text": "It’s official. We’ve signed QB Michael Vick.", "author": "nyjets"}, {"text": "Rex on Mark: “I’d like to thank Mark for everything he’s done for this team and me personally.\" Full quote- http://t.co/zmNbktaJ8t", "author": "nyjets"}, {"text": "Mark Sanchez has been released.", "author": "nyjets"}, {"text": "@josh1saywhat We have confidence in our front office to explore a variety of options at WR and QB, Joshua.", "author": "nyjets"}, {"text": "Wishing @GVMcElroy the best of luck and success in the future- http://t.co/CmcYqTgv27", "author": "nyjets"}, {"text": "EXCLUSIVE: @eallenjets 1-on-1 w/ John Idzik. Watch his answers to your #NFLFreeAgency Qs- http://t.co/S5waxO5Q5t http://t.co/PCoBwT9Ruv", "author": "nyjets"}, {"text": "VIDEO: Exclusive, unfiltered one-on-one w/ Rex Ryan, answering YOUR #NFLFreeAgency questions- http://t.co/MHElr1CMQ2 http://t.co/BAcbwtFjy3", "author": "nyjets"}, {"text": "Whose alma mater has the best chance to make a run in the tournament? http://t.co/YTT9ssm4dk", "author": "nyjets"}, {"text": "RT @eallenjets: We will be interviewing John Idzik + Rex Ryan later.  Send us your ?s and I will get to a few.  Videos will be posted today.", "author": "nyjets"}, {"text": "@spinmaster100 We're confident that they'll hold it down, Larry.", "author": "nyjets"}, {"text": "Breno Giacomini Mic’d Up: See how our new RT battles in the trenches- http://t.co/w5sxI4Jr2g", "author": "nyjets"}, {"text": "RT @eallenjets: As promised, here is our 1-on-1 with @willcolon66: http://t.co/Q2ywvB83SD.  A pro's pro folks.  #NFLFreeAgency http://t.co/…", "author": "nyjets"}, {"text": "RT @willcolon66: I wanna thank Jet nation for keeping me in there hearts and prayers thru this process so blessed to be back home. #NYJets", "author": "nyjets"}, {"text": "RT @eallenjets: Good Read today from @BrianCoz as he caught up with Legendary NFL Executive Bill Polian: http://t.co/LjfSoOXzkz", "author": "nyjets"}, {"text": "It's official. We've re-signed G @WillColon66 - http://t.co/MajHFMl6RR http://t.co/LCnm2oYuLM", "author": "nyjets"}, {"text": "Calvin Pace by the numbers", "author": "nyjets"}, {"text": "RT @JetNation: John Idzik’s Master Plan - http://t.co/GknBWkndg3 http://t.co/EIGA8asYaz", "author": "nyjets"}, {"text": "Pace’s signature makes it official. #97 re-signs. Relive his best 2013 moments- http://t.co/4TEKgrqqxZ http://t.co/b2RmpIq6AC", "author": "nyjets"}, {"text": "@nicky_terranova Appreciate the input, Nick. What other positions are you paying attention to come draft day?", "author": "nyjets"}, {"text": "@nicky_terranova Who are some of your top WR prospects in this year's draft, Nick?", "author": "nyjets"}, {"text": "RT @eallenjets: Almost a week into Free Agency, let's take a look at the Jets Needs: http://t.co/wpNsdUo4ii", "author": "nyjets"}, {"text": "Who doesn’t love a holiday where it’s ok to wear as much Jets gear as possible? #HappyStPatricksDay #WearJetsGreen http://t.co/YpRFtKbUXc", "author": "nyjets"}, {"text": "@simoneonphone Wear that Jets green proudly today!", "author": "nyjets"}, {"text": "@ZellyZel6 Loving the hat. Wear the Jets green with pride today.", "author": "nyjets"}, {"text": "RT if you’re excited to see Decker make plays like this in Green & White. http://t.co/RycRtfphH7", "author": "nyjets"}, {"text": "#JetsNation, @EricDecker87 answered YOUR questions. Hear what he had to say: http://t.co/8h90Tx6Z5o http://t.co/3Z9Jbw3b8U", "author": "nyjets"}, {"text": "Happy birthday, Eric! #JetsNation send your birthday wishes to @ericdecker87. http://t.co/fVK4vymksM", "author": "nyjets"}, {"text": "Free agency: 5 things to consider this weekend- http://t.co/T3zZrc1dCm http://t.co/nesNyU3eHT", "author": "nyjets"}, {"text": "@jevanvoo We love hearing that, Jennifer.", "author": "nyjets"}, {"text": ".@billbarnwell gives his take on the WRs still on the market- http://t.co/tFzaOl3mqt", "author": "nyjets"}, {"text": "RT @rlangejets: WR Eric Decker: \"I see a culture that's something I want to be a part of with the Jets.\" Story: http://t.co/UHYEQKu4Su", "author": "nyjets"}, {"text": ".@Grantland33’s @billbarnwell says the market for CBs is deep & these names are all options for the Green & White - http://t.co/dB79LfXGpV", "author": "nyjets"}, {"text": "RT @EricDecker87: @Cumberland87 @DavidNelson86 excited to go to work with ya fellas! #Jets", "author": "nyjets"}, {"text": "RT @eallenjets: We will tape an interview with @EricDecker87 today.  You know the deal.  Hit me up with some ?s and I'll get to a few.", "author": "nyjets"}, {"text": "TRANSCRIPTS: @LegerDouzable and @NickFolk2 talk to media about re-signing- http://t.co/p3jxjlovFU", "author": "nyjets"}, {"text": "RT @eallenjets: After Decker, are more moves on the way?  I joined @NFL_AM today to talk Jets + Free Agency: http://t.co/pJCJu6B8kt http://…", "author": "nyjets"}, {"text": "Eric Decker in 2013: 87 catches, 1,288 YDS & THESE 11 TD grabs… https://t.co/n2vwirAnRE", "author": "nyjets"}, {"text": "Signed, sealed, delivered. He’s a Jet!", "author": "nyjets"}, {"text": "RT @eallenjets: The Jets have also confirmed that they have agreed to terms with DL Leger Douzable.", "author": "nyjets"}, {"text": "RT @eallenjets: Decker Agrees to Terms.  Here is the Story: http://t.co/ceAyJ4ubAx http://t.co/c9ZUWhq75W", "author": "nyjets"}, {"text": "RT @eallenjets: The Jets have agreed to terms with WR Eric Decker.", "author": "nyjets"}, {"text": "BREAKING: We've agreed to terms with RT Breno Giacomini- http://t.co/pLcOafO7Cr #NFLFreeAgency http://t.co/6xS3ewsB4U", "author": "nyjets"}, {"text": "The numbers that make him a Folk Hero- http://t.co/tu4mXRRUjJ http://t.co/MOm6vPemLV", "author": "nyjets"}, {"text": "RT @eallenjets: If Revis becomes a free agent, what do you think Jets Nation?  Here is my blog: http://t.co/QN84LxOmU1. http://t.co/BIfJPDi…", "author": "nyjets"}, {"text": "These players may be a good fit for the Green & White- http://t.co/newDXk1IkA", "author": "nyjets"}, {"text": "RT @nickfolk2: Daddy said if we ate our veggies and drank our milk we will be big and strong and could one day play… http://t.co/JamBcm1hR3", "author": "nyjets"}, {"text": "Game winner, after game winner, after game winner.  #HowTo be a Folk Hero. https://t.co/WJ9dqgYiqM", "author": "nyjets"}, {"text": "It’s good! The @nickfolk2 signature makes it official. RT to congratulate #2. http://t.co/vgSr2nQ4WB", "author": "nyjets"}, {"text": "RT @rlangejets: Nick Folk has signed a multiyear deal with the New York Jets. http://t.co/11y2gBMDiA http://t.co/KwiG7RRbk6", "author": "nyjets"}, {"text": "Jets Nation, have you seen any 1st Round-level talent out of this year's crop of wideout prospects? http://t.co/IcKRHxeW8z", "author": "nyjets"}, {"text": "@AMaher4Par Appreciate your support for our guys, Adam.", "author": "nyjets"}, {"text": "@alybbert Who are you hoping to see join the Green and White, Aaron?", "author": "nyjets"}, {"text": "@Morlino34 Who do you want to see land in the Green and White, Christopher?", "author": "nyjets"}, {"text": "24-hrs until the start of #NFLFreeAgency.", "author": "nyjets"}, {"text": "On behalf of #JetsNation, @CRO31 & @ToneTime10 thanks for all the memorable moments. Here are some of the highlights- http://t.co/do5tWBO9OQ", "author": "nyjets"}, {"text": "Restricted Free Agent Nick Bellore has been tendered.", "author": "nyjets"}, {"text": "Rex (3 of 3): “I wish him nothing but the best.” More- http://t.co/nn7Nokqi2V", "author": "nyjets"}, {"text": "Rex (2 of 3): “He’s a tremendous competitor who wants the ball in his hands when the game is on the line.\"", "author": "nyjets"}, {"text": "Rex (1 of 3): “I appreciate Tone’s contributions over the last four seasons. I’ve always admired his knack for making the clutch play.”", "author": "nyjets"}, {"text": "WR Santonio Holmes has been released.", "author": "nyjets"}, {"text": "WATCH: Is Sanchez staying a Jet? – http://t.co/eu38NZcXug", "author": "nyjets"}, {"text": "Woody Johnson on the passing of William Clay Ford Sr.- http://t.co/oWa9dw4LOX", "author": "nyjets"}, {"text": "RT @rlangejets: Antonio Cromartie had 13 INTs in 4 Jets seasons, and in '12 @ JAX became 1st NFL player since '08 to start on both O and D …", "author": "nyjets"}, {"text": "Rex continued: “…He has a passion and enthusiasm for the game and I wish him and his family the best.”", "author": "nyjets"}, {"text": "Rex: “Cro is one of the finest athletes I’ve ever coached. He was willing to contribute wherever the team needed him to win games…”", "author": "nyjets"}, {"text": "CB Antonio Cromartie has been released today- http://t.co/nKzdAdPQGH", "author": "nyjets"}, {"text": "RT @Cumberland87: Blessed and honored to be a New York Jet for 3 more years! #JetLife to the next life! #jetsnation #jlb http://t.co/fhNYre…", "author": "nyjets"}, {"text": "RT @eallenjets: Jets have $$ heading into Free Agency, but they are going spend wisely.  I look at the Idzik philosophy: http://t.co/lVYw4Y…", "author": "nyjets"}, {"text": "It's official. We've agreed to terms with TE @Cumberland87. http://t.co/I6qfCTPmqD http://t.co/A73ULeQufq", "author": "nyjets"}, {"text": "Does #10 have a future with the Green & White? NFLN analyst @RapSheet weighs-in: http://t.co/o5QHmlswoa", "author": "nyjets"}, {"text": "Mock Drafts have been updated. Analysts say, with the 18th pick in the 2014 NFL Draft the New York Jets select… http://t.co/6BVaMPFXFG", "author": "nyjets"}, {"text": "RT @JetsFlightCrew: Have questions about this year’s auditions or prep classes? Tweet us @JetsFlightCrew with #AskDenise http://t.co/GYbqY4…", "author": "nyjets"}, {"text": "@lplanas1969 Who do you like us selecting at 18, Luis?", "author": "nyjets"}, {"text": "@wa2k1999 Looks like you see us having a busy offseason, Adam. We appreciate your insights. #JetsNation", "author": "nyjets"}, {"text": "@wa2k1999 We appreciate your input, Adam. How about Free Agency? Who are you hoping to see in the Green and White next year?", "author": "nyjets"}, {"text": "@BarockFlowbama Who is your top TE prospect in this year's Draft, Kory?", "author": "nyjets"}, {"text": "@wa2k1999 Who do you like us taking at 18, Adam?", "author": "nyjets"}, {"text": "Time to think like Rex, Jets Nation. What is Coach's primary focus heading into Free Agency & the Draft? #RexNation http://t.co/ij3NCX6Igb", "author": "nyjets"}, {"text": "Q: Is Austin Howard the next Jet to be resigned?", "author": "nyjets"}, {"text": "@BarlingRob Who do you see us taking at 18, Rob?", "author": "nyjets"}, {"text": "@LightningLaneJ Appreciate your support for Ellis, Jay. We're happy to have him signed.", "author": "nyjets"}, {"text": "@eallenjets Don’t worry, EA, we didn’t forget about you! Your “Travoltified” name’s a good one…Edward Allorn. http://t.co/a1ffw52pv2", "author": "nyjets"}, {"text": "@JKerley_11 Don’t worry we won’t pronounce your name like this after a TD, but we can’t promise Travolta wouldn’t. http://t.co/3mpv1PHXIm", "author": "nyjets"}, {"text": "@NickMangold If John Travolta announced your name on gameday, it might sound something like this… http://t.co/2d0rV3uxVT", "author": "nyjets"}, {"text": "@mowilkerson Did you watch the Oscars? If you did, we think this might give you a good laugh. http://t.co/26FQpUAV1z", "author": "nyjets"}, {"text": "Hey @BigDame900 have you “Travoltified” your name yet? We did, and if John Travolta introduced #94 he’d say… http://t.co/vH5hIIjP1C", "author": "nyjets"}, {"text": "#ThrowbackThursday Geno Smith displays his talents at West Virginia's Pro Day last year. http://t.co/fUADn9OgJL", "author": "nyjets"}, {"text": "Jets Talk LIVE starts now on http://t.co/04XxTdv9Oa! Tune in for our free agency preview and hear from NFLN insider @RapSheet.", "author": "nyjets"}, {"text": "RT @EllisLankster21: Jet Nation I am back let's go....thank u jesus I get to play for rex baby...", "author": "nyjets"}, {"text": "@ClemsonFB Love Rex in that orange, but he just looks better in green. Thanks for being good hosts.", "author": "nyjets"}, {"text": "Join us in wishing a happy 25th to #32! http://t.co/HEBvZdfPRs", "author": "nyjets"}, {"text": "We’ve agreed to terms w/ CB @EllisLankster21 & CB @DWalls2ND. RT if you’re excited to see them stay in Green & White– http://t.co/zJKiHpytZW", "author": "nyjets"}, {"text": "We have acquired CB Johnny Patrick off of waivers from the San Diego Chargers- http://t.co/1B5Ze7SUbt", "author": "nyjets"}, {"text": "Who starts at QB for the Green & White? Top ESPN & NFLN analysts give their take on the situation: http://t.co/KYQdUHZBna", "author": "nyjets"}, {"text": "@Saint1428 Which of those are you most interested in seeing us draft, Tim?", "author": "nyjets"}, {"text": "Who will we target in May’s Draft? According to Real Football, here are skill position players to keep an eye on: http://t.co/2GQ96fGCPk", "author": "nyjets"}, {"text": "@AZ_NYFAN252 Which prospects are you interested in watching, Chris?", "author": "nyjets"}, {"text": "@Urbanvizion75 Which WRs impress you the most in this Draft class?", "author": "nyjets"}, {"text": "The path to the Draft continues, Jets Nation. Which Pro Days are you most interested in? http://t.co/9XRJlWxS0Y", "author": "nyjets"}, {"text": "RT @eallenjets: Our Full Q&A Has been Posted.  Breaking Bad, Beards & Beckham Jr.  Covered a lot of Ground: http://t.co/T8kBCWvZcQ http://t…", "author": "nyjets"}, {"text": "@_JETS_YANKEES_ We know you want to see your fellow Tar Heel, but who else do you want in Green and White, Jon?", "author": "nyjets"}, {"text": "@McComas51 What other free agents are you looking to see in the Green and White, Dalton?", "author": "nyjets"}, {"text": "When he's not protecting the blind side, @DBrickashaw channels his inner reporter. Here's his take on the Draft: http://t.co/TEvtdYmrh6", "author": "nyjets"}, {"text": "@tommyo13 Which offensive prospects stick out to you, Thomas?", "author": "nyjets"}, {"text": "@CFalci57 What offensive guys do you want to see in the Green and White, Christopher?", "author": "nyjets"}, {"text": "With 4 picks in the top 80, #NFL analyst Bill Polian says we could find offensive weapons in May’s Draft: http://t.co/2XLVf1jsVm", "author": "nyjets"}, {"text": "Looks like Joe doesn’t need his fur coat in FL. RT @YankeesWFAN Namath and Jeter. #icons http://t.co/vkw3k3bhoD", "author": "nyjets"}, {"text": "If you aren't already, follow OfficialNYJets on Snapchat. At 2pm we're giving away another signed pic & it could be yours!", "author": "nyjets"}, {"text": "RT @eallenjets: Taping our JTL Interview with @nfldraftscout this AM.  If you have any ?s, hit me up now.  Millsie has got this draft cover…", "author": "nyjets"}, {"text": "@acastan0 It's got to be that beard, Antonio.", "author": "nyjets"}, {"text": "@LordTreeSap It's all in the green suit, Michael.", "author": "nyjets"}, {"text": "Tell us which Jet has the best #RedCarpet look. http://t.co/yEpkoUcsrG", "author": "nyjets"}, {"text": ".@ZachSudfeld gives back in Uganda. More on his charitable trip- http://t.co/YcnMi6CxwV http://t.co/g87rJx7gGI", "author": "nyjets"}, {"text": "It's March, which means Free Agency will be here soon. Who'd you like to see in Green & White? Give us your Top 3. http://t.co/VY4o1hHjg9", "author": "nyjets"}, {"text": "@Louis2142 Thanks for showing Nick some love, Louis.", "author": "nyjets"}, {"text": "RT @eallenjets: Folk is a heck of a kicker.  He had 3 Game-Winning kicks this year and has 7 since joining the Green & White in 2010.  Look…", "author": "nyjets"}, {"text": "We have placed the franchise tag on K Nick Folk- http://t.co/NjZXMBttja http://t.co/wJr6E7YgOI", "author": "nyjets"}, {"text": "@khomann23 Is he your ideal pick to land in the Green and White, Kody?", "author": "nyjets"}, {"text": "These players could hear their names called by the Jets on Draft weekend- http://t.co/n6OOdBCqVb", "author": "nyjets"}, {"text": "RT @eallenjets: Jumped on @NFL_AM with @nicolezaloumis & @_ericdavis_ to talk QBs.  Would Vick be a good fit?  http://t.co/TSI1ytV6z2 http:…", "author": "nyjets"}, {"text": "@sebby1302 We have confidence in our front office, Peter.", "author": "nyjets"}, {"text": "@sportsyenta We appreciate the love and feel the same way about our fans. #JetsNation", "author": "nyjets"}, {"text": "We’ve talked a lot of offense @ the Combine, but here are 2 defensive players you should know: http://t.co/EwHXK5w818 http://t.co/FzewmzEdyM", "author": "nyjets"}, {"text": "#ThrowbackThursday After this talk, Brick went on to become the 4th overall pick in the '06 Draft. http://t.co/MaTk2K3qy9", "author": "nyjets"}, {"text": "@marojeevs Like always with those two, Mark.", "author": "nyjets"}, {"text": "Mustaches, mullets and polyester: Rex and Rob back when…http://t.co/TwGhg08DKX http://t.co/XdSokLXM44", "author": "nyjets"}, {"text": "@JudoChop80 What other defensive prospects impressed you, Nic?", "author": "nyjets"}, {"text": "Who will rise to the top of our Draft boards?", "author": "nyjets"}, {"text": "@MichaelPagano_ What are your thoughts for the later rounds, Michael?", "author": "nyjets"}, {"text": "@GangGreen580 We see you're thinking WR and TE, Robert. Who do you like in the later rounds?", "author": "nyjets"}, {"text": "Suns outlast Thunder, 122-115.", "author": "SportsCenter"}, {"text": "This is Geno Auriemma's 9th trip to the National Championship game.", "author": "SportsCenter"}, {"text": "Steph Curry & Klay Thompson both scored 30+ Pts in win vs Jazz.", "author": "SportsCenter"}, {"text": "Blazers are back in the playoffs! Portland beats New Orleans, 100-94, clinching 1st playoff berth since 2011. http://t.co/8pkqQ8PL7W", "author": "SportsCenter"}, {"text": "Splash Brothers GO OFF in Warriors win vs Jazz.", "author": "SportsCenter"}, {"text": "Help us pick 3 stars of the night. We pick 2 performances, YOU pick the 3rd. Use #SC3stars and your tweet could air in the 11 pm ET show!", "author": "SportsCenter"}, {"text": "39-0 UConn vs 37-0 Notre Dame on Tuesday night. 1st time in NCAA Tournament history with 2 undefeated teams in final. http://t.co/XfQkl5WYXm", "author": "SportsCenter"}, {"text": "Kevin Durant now has 25+ Pts for 41st straight game, passing Michael Jordan's previous mark of 40 straight (1986-87). http://t.co/4lNygdJOK1", "author": "SportsCenter"}, {"text": "UCONN TO THE TITLE GAME!", "author": "SportsCenter"}, {"text": "Steph Curry has 20 points and 11 assists at the half vs Jazz.", "author": "SportsCenter"}, {"text": "ICYMI: Matt Kemp has 2 HR on the night vs Giants. Here is his 2nd off Matt Cain. » http://t.co/5hHpKuPHiA", "author": "SportsCenter"}, {"text": "ICYMI: Australian Matt Jones w/ a golfer's dream scenario: hole out in a playoff, qualify for the Masters. » http://t.co/tbP2MiUcrO #SCtop10", "author": "SportsCenter"}, {"text": "Spurs get 60th win of season in 112-92 victory over Memphis.", "author": "SportsCenter"}, {"text": "Matt Kemp goes yard again. 2 homers on the night for Kemp.", "author": "SportsCenter"}, {"text": "In the same week he gets a new big-play WR, Robert Griffin III gets a new logo. Check out @RGIII's look. » http://t.co/usvGjPCwiz", "author": "SportsCenter"}, {"text": "Pacers were rolling to a possible top seed in the East. Then the improbable last 18 games happened. (via @ESPNMag) http://t.co/8zRAOKd4HV", "author": "SportsCenter"}, {"text": "Notre Dame's #PursuitOfPerfection CONTINUES!  Kayla McBride's 28 Pts lead ND to win over Maryland, berth in title game. Irish are now 37-0.", "author": "SportsCenter"}, {"text": "Pacers' struggles continue in 107-88 loss at home to Hawks.", "author": "SportsCenter"}, {"text": "RT @ESPNStatsInfo: The Pacers made one shot outside the paint in the 1st half, trail Hawks at half, 55-23 http://t.co/vXq07ZcmWe", "author": "SportsCenter"}, {"text": "Hawks are BLOWING OUT Pacers after 1st half, 55-23 - fewest points in a first half in the franchise's NBA history.", "author": "SportsCenter"}, {"text": "This is a real score in the first half in Indiana:", "author": "SportsCenter"}, {"text": "Women's Final Four tips off on @ESPN now. This is 1st women's Final Four EVER featuring 2 undefeated teams (UConn and Notre Dame). #ncaaWFF", "author": "SportsCenter"}, {"text": "Clippers blow out Lakers, 120-97.  LAC have outscored LAL by a combined 107 points over last 3 games. http://t.co/0uAlakG6K6", "author": "SportsCenter"}, {"text": "Brewers beat Red Sox, 4-0, sweeping defending World Series champions at Fenway.  Boston falls to 2-4 on season. http://t.co/ZhZouzNeKN", "author": "SportsCenter"}, {"text": "Yankees hold on to beat Blue Jays, 6-4.", "author": "SportsCenter"}, {"text": "LeBron James is now 14-12 career vs Carmelo Anthony (including playoffs). http://t.co/jdaYdMaeNW", "author": "SportsCenter"}, {"text": "Record-setting day for J.R. Smith:", "author": "SportsCenter"}, {"text": "LeBron James drops 38 Pts (13-22 FG) as Heat beat Knicks, 102-91. J.R. Smith finishes w/ 32 Pts in a loss. » http://t.co/7mxzr7l2kr", "author": "SportsCenter"}, {"text": "J.R. Smith just set a Knicks record for most 3-pt FG in a game with 10.", "author": "SportsCenter"}, {"text": "LeBron James' 36 Pts makes him 1st player since Michael Jordan ('96-97) w/ 4 30-pt games vs. Knicks in a season. » http://t.co/LOzoqsR0rf", "author": "SportsCenter"}, {"text": "J.R Smith has set a NBA record with 22 3-pt FG in his last 3 games.", "author": "SportsCenter"}, {"text": "It's not Game 6 winner, but Michael Jordan is pumped after sinking this 50-foot putt at his celebrity invitational. » http://t.co/PVpIeWuJUg", "author": "SportsCenter"}, {"text": "Derek Jeter moves to 8th all-time on baseball's career hit list. He passes Paul Molitor w/ 3,320 hits.", "author": "SportsCenter"}, {"text": "JR SWISH! J.R. Smith has 17 Pts (5-8 3-pt FG) as Knicks lead Heat at halftime, 50-48. » http://t.co/IHcnkexQLI", "author": "SportsCenter"}, {"text": "NCAA president says unionization of college athletes would be a \"grossly inappropriate\" solution to problems facing amateur athletics.", "author": "SportsCenter"}, {"text": "Former Maryland coach Gary Williams will join Alonzo Mourning & Mitch Richmond as inductees into Naismith Hall of Fame, per media reports.", "author": "SportsCenter"}, {"text": "Liverpool beats West Ham, 2-1. Steven Gerrard scores 2 from spot as Liverpool returns to top of PL Table. » http://t.co/JdUZN7eFpg", "author": "SportsCenter"}, {"text": "Johnny Manziel flew to Oakland Sunday to visit with Raiders, according to a league source. » http://t.co/rcdvUx7ffC", "author": "SportsCenter"}, {"text": "Red Sox 3B Will Middlebrooks has been placed on 15-day DL with a grade 1 calf strain. » http://t.co/LXmjw6MU4z", "author": "SportsCenter"}, {"text": "Dwyane Wade, Chris Andersen and Greg Oden have all been ruled out of Heat's game Sunday vs. Knicks.", "author": "SportsCenter"}, {"text": "It's safe to say people are excited that football is back in Los Angeles thanks to @LAKISS_AFL » http://t.co/FGYYIBOtXT", "author": "SportsCenter"}, {"text": "From UConn's 3 Sweep to Villanova's Bench Mob, sometimes bench celebrations are just as key as on-court play. » http://t.co/u7HHYvN85h", "author": "SportsCenter"}, {"text": "Everton beats Arsenal 3-0. Everton are now just one point behind Gunners for final Champions League spot. » http://t.co/oe4kbmdOzB", "author": "SportsCenter"}, {"text": "Kyrie Irving scored a career-high 44 Pts in a loss Saturday but says he's unhappy w/ media's portrayal of him. » http://t.co/E06lhUYLHj", "author": "SportsCenter"}, {"text": "Kentucky is 1st team ever to win 4 straight games by 5 Pts or fewer in a single NCAA Tourney. (via @ESPNStatsInfo) » http://t.co/Flk50W4icS", "author": "SportsCenter"}, {"text": "Our @BramESPN is working hard ahead of 10 am SportsCenter to ensure we can Rock and Roll all night. #KISSArmy » http://t.co/ucukgoMDij", "author": "SportsCenter"}, {"text": "ICYMI: Charlotte Bobcats (39-38) clinched a playoff berth for second time in franchise history. » http://t.co/cRVIGtNXVm", "author": "SportsCenter"}, {"text": "How clutch is Aaron Harrison? His last 3 game-winning threes have come against unbelievably TIGHT defense. #BBN » http://t.co/2G0cqB4oqq", "author": "SportsCenter"}, {"text": "Madness in Lexington, Kentucky! Check out the scene at State Street. (via @heraldleader) http://t.co/1Qkkkb4PT8", "author": "SportsCenter"}, {"text": "Photo of the day: Aaron Harrison is outrageously clutch. http://t.co/L2CqAKRvYM", "author": "SportsCenter"}, {"text": "COMEBACK CATS! Kentucky is the 2nd team ever to win four straight after trailing at halftime in the NCAA Tournament. (via @EliasSports)", "author": "SportsCenter"}, {"text": "First time ever a 7 and 8 seed will play for the National Championship. Just the third time since 1979 there will be no 1 or 2 seed.", "author": "SportsCenter"}, {"text": "NO GOOD! Traevon Jackson's shot doesn't fall! Kentucky pulls off ANOTHER stunner, 74-73. Unbelievable finish to an instant classic.", "author": "SportsCenter"}, {"text": "AARON HARRISON ARE YOU KIDDING ME! AGAIN! He hit game-winning threes to beat Louisville AND Michigan, gives UK 1-pt lead, 5.7 seconds left.", "author": "SportsCenter"}, {"text": "RT @ESPN_Numbers: ZERO.", "author": "SportsCenter"}, {"text": "Traevon Jackson to the line! Draws the huge foul, will get three shots for Wisconsin with :15 to play in tie game.", "author": "SportsCenter"}, {"text": "Tie game. 69-69. Just under 4 minutes to play. BUCKLE. UP. #FinalFour", "author": "SportsCenter"}, {"text": "What a battle! Badgers counter with a 15-4 run to take a three point lead with just over 10 minutes to play!", "author": "SportsCenter"}, {"text": "Wake up, Big Blue Nation! Wildcats take a 45-43 lead on Dakari Johnson's and-one. Their first lead since 9-7.", "author": "SportsCenter"}, {"text": "On Wisconsin? Badgers lead Kentucky, 40-36 at the half. Sam Dekker leads the way with 12 Pts, 2 Reb. http://t.co/1T2gRpml18", "author": "SportsCenter"}, {"text": "Bo Ryan, about to coach in his 1st Final Four, tells his team pregame, \"We're in this together men.\" (via @BadgerMBB)", "author": "SportsCenter"}, {"text": "Yesterday former UConn coach Jim Calhoun told DeAndre Daniels that no one was talking about him. Daniels replied: http://t.co/VD7BlgjLMD", "author": "SportsCenter"}, {"text": "UConn is the first seven seed to ever make the National Championship.", "author": "SportsCenter"}, {"text": "UConn is less than a month removed from an 81-48 loss to Louisville.", "author": "SportsCenter"}, {"text": "Kevin Ollie takes the Huskies to the National Championship Game in his first NCAA Tournament as a coach.", "author": "SportsCenter"}, {"text": "UCONN IS GOING TO PLAY FOR THE NATIONAL TITLE! DeAndre Daniels finishes with 20 Pts, 10 Reb to lead the Huskies. http://t.co/A2B5DoyiZf", "author": "SportsCenter"}, {"text": "That helps. RT @ESPNStatsInfo: UConn has made 11 of its last 12 field goal attempts.  #UConnvsFlorida", "author": "SportsCenter"}, {"text": "It's the Gators turn to rally! Trailed by 10 with 12:30 to play, but they've cut UConn's lead to 43-40 with under 8 minutes to play.", "author": "SportsCenter"}, {"text": "Watching the Final Four? Tweet us your reaction videos with #SCSocialHighlight. Best videos may make the show!", "author": "SportsCenter"}, {"text": "Huskies rally after a great start by the Gators! 7 seed UConn leads top overall seed Florida, 25-22, at the half. http://t.co/tXo4mppQZy", "author": "SportsCenter"}, {"text": "Don't count out the Huskies! UConn scored just four points in first 10 minutes, have scored 11 in last 2:30. Huskies trail Florida, 16-15.", "author": "SportsCenter"}, {"text": "The ball is tipped! The Final Four is underway!", "author": "SportsCenter"}, {"text": "UConn star Breanna Stewart named Women's AP POY, averaging 19.4 Pts, 8.1 Reb this year. Notre Dame's Muffet McGraw is Coach of the Year.", "author": "SportsCenter"}, {"text": "Deuce with the hat trick! Clint Dempsey nets three for @SoundersFC vs Portland, including the game-tying goal in the 87th minute.", "author": "SportsCenter"}, {"text": "Northwestern coach Pat Fitzgerald is urging his players to vote no on unionization. http://t.co/peeHldGb4r", "author": "SportsCenter"}, {"text": "WALK-OFF GRAND SLAM! Ike Davis blasts one over RF wall, and Mets come back to beat Reds, 6-3. #SCtop10", "author": "SportsCenter"}, {"text": "Blue Jays shut out Yankees,  4-0.", "author": "SportsCenter"}, {"text": "He’s baaack! Yasiel Puig is atop Dodgers lineup card one day after getting benched for showing up late to ballpark. http://t.co/2i6UUroexj", "author": "SportsCenter"}, {"text": "Torii Hunter, have yourself a game! Detroit OF hits 2-run HR off Bud Norris, giving him 5 RBI in game. Tigers lead Orioles, 5-1.", "author": "SportsCenter"}, {"text": "The end of the Madness: @ESPNMag breaks down the numbers behind the Final Four teams.  » http://t.co/E3wruzyCpy", "author": "SportsCenter"}, {"text": "Lionel Messi scores twice in Barcelona's 3-1 win over Real Betis. FC Barcelona stays one point behind Atletico Madrid.", "author": "SportsCenter"}, {"text": "Yasiel Puig back in Dodgers starting lineup, batting leadoff and playing RF, one day after benching for late arrival to ballpark.", "author": "SportsCenter"}, {"text": "Glory Glory Man United! Juan Mata scores twice as Red Devils defeat Newcastle, 4-0. http://t.co/gwOpMJb84a", "author": "SportsCenter"}, {"text": "Bayern Munich's 53-game unbeaten streak in Bundesliga snapped with 1-0 loss to FC Augsburg. Last loss: October 2012. http://t.co/LOGNjcOcnr", "author": "SportsCenter"}, {"text": "HOTTY TODDY! Ole Miss hits walk-off HR on what was supposed to be an intentional walk. » http://t.co/NT9Kfp3HWK", "author": "SportsCenter"}, {"text": "Dirk Nowitzki is now 11th on all-time NBA scoring list after 27 points Fri. He trails No. 10 Oscar Robertson by 32. http://t.co/xsrvIMUAUd", "author": "SportsCenter"}, {"text": "ICYMI: LeBron James became the youngest player in NBA history to score 23,000 points Friday (29 years, 95 days). http://t.co/2FH4ETDlSJ", "author": "SportsCenter"}, {"text": "RT @E60: .@WrestleMania and @WWE still going strong. @E60 brings you the story of @VinceMcMahon 11 Am ET on @Sportscenter. http://t.co/Jek5…", "author": "SportsCenter"}, {"text": "Manchester City cruises past Southampton, 4-1. City moves within 1 point of Liverpool at top of Premier League table. http://t.co/Ylh0U3r2rp", "author": "SportsCenter"}, {"text": "Former Bills QB Jim Kelly says he and his family are \"praying for a miracle\" as he prepares for chemotherapy. » http://t.co/9oQ0S3Uus1", "author": "SportsCenter"}, {"text": "Kevin Durant: ON FIRE. He's scored 25+ Pts in 40 straight, tying Michael Jordan for longest streak of last 50 years. http://t.co/GBiaArDjaK", "author": "SportsCenter"}, {"text": "\"I believe in marijuana.\"", "author": "SportsCenter"}, {"text": "Kevin Durant is ON A TEAR. Just dropped 25+ points for 40th straight game, tying Michael Jordan himself for longest streak in last 50 years.", "author": "SportsCenter"}, {"text": "Help us pick 3 stars of the night. We pick 2 performances, YOU pick the 3rd. Use #SC3stars and your tweet could air in the 12 am ET show!", "author": "SportsCenter"}, {"text": "Strange but true: Billy Hamilton & Carlos Gomez were caught stealing today. Pedro Alvarez, Victor Martinez & Adrian Gonzalez stole bases.", "author": "SportsCenter"}, {"text": "Florida is the 4th team since 1979 to enter the Final Four with a win streak of 30+ games. None of the previous 3 went on to win the title.", "author": "SportsCenter"}, {"text": "The Broncos have signed coach John Fox to a three-year extension. (via ESPN & Media Reports) http://t.co/dEfn33f3Dh", "author": "SportsCenter"}, {"text": "Yankees roll over the Blue Jays, 7-3. Masahiro Tanaka: 7 IP, 6 H, 3 R, 2 ER, 8 K in his major league debut. http://t.co/ty5svDfoqz", "author": "SportsCenter"}, {"text": "Wolves win! Corey Brewer hits deciding FT in the 2nd OT. Kevin Love puts up 28 Pts, 11 Reb in the win. Heat and Pacers tied for 1st in East.", "author": "SportsCenter"}, {"text": "More free basketball in Miami. Another Kevin Love last-second shot hits rim and doesn't fall, Wolves and Heat headed to double overtime.", "author": "SportsCenter"}, {"text": "Masahiro Tanaka has officially settled in. After giving up 3 runs in first 2 innings, he's retired the last 14 hitters he's faced.", "author": "SportsCenter"}, {"text": "J.R. Smith drops 32 but it's not enough. His last second three rattles out, Knicks lose to the Wizards, 90-89. Snaps a 3-game NY win streak.", "author": "SportsCenter"}, {"text": "OVERTIME! Kevin Love's three rattles out, Heat and Wolves tied at 97 after 4 qtrs. Heat would take sole possessoin of 1st in East with win.", "author": "SportsCenter"}, {"text": "Pacers struggles continue as they fall in Toronto, 102-94. Indiana's 6th loss in last 8 games. Paul George: 26 Pts in the loss.", "author": "SportsCenter"}, {"text": "EL TORO! Pedro Alvarez launches his 2nd home run of the night off Shelby Miller. Pirates lead the Cardinals, 2-0.", "author": "SportsCenter"}, {"text": "Giancarlo Stanton's MAMMOTH first-inning home run went 484 feet, the longest in Marlins Park history.", "author": "SportsCenter"}, {"text": "Wisconsin F Zach Bohannon's selfie game is strong. #FinalFour (via @zbohannon) http://t.co/R5i8yzTBcQ", "author": "SportsCenter"}, {"text": "BOOM. Mike Trout hits the monster homer to left to open up the scoring for the Angels. They lead the Astros, 1-0, top 1st.", "author": "SportsCenter"}, {"text": "Welcome to the show, Masahiro Tanaka! First batter he sees, Melky Cabrera, takes the Yankees starter deep on his third big league pitch.", "author": "SportsCenter"}, {"text": "DeSean Jackson calls report alleging gang affiliation \"disrespectful\" and denies he is a gang member. » http://t.co/aeioKJVZfq", "author": "SportsCenter"}, {"text": "DeSean Jackson denies being gang member in #SCconvo: \"As far as being affiliated, never have been in one.\"", "author": "SportsCenter"}, {"text": "The view from the cheap seats at the Final Four.... The video board is BIGGER than the court. http://t.co/U74xWTnwl7", "author": "SportsCenter"}, {"text": "Brewers ruin the Red Sox ring ceremony, score four in the 9th inning for a 6-2 win. Carlos Gomez goes 4-for-5, 2 RBI.", "author": "SportsCenter"}, {"text": "Vin Scully is calling his 65th (!!) Dodgers home opener tonight, dating all the way back to their days in Brooklyn. http://t.co/8WEseHrszB", "author": "SportsCenter"}, {"text": "Miguel Cabrera picks up his 2,000th career hit in style. Miggy blasts 2-run home run to give Tigers 10-2 lead over Orioles.", "author": "SportsCenter"}, {"text": "DeSean Jackson sits down w/ @stephenasmith in 1st TV interview since joining Redskins, coming up on 6 ET SC. http://t.co/krff4N0jN9", "author": "SportsCenter"}, {"text": "Former Broncos CB Champ Bailey reaches agreement on 2-year contract with Saints, sources tell ESPN. http://t.co/SjvjL8Xcg1", "author": "SportsCenter"}, {"text": "NFLPA to look into circumstances surrounding DeSean Jackson's release by Eagles. » http://t.co/4k1e2pGYNz", "author": "SportsCenter"}, {"text": "Cool moment for Boston: Red Sox, Celtics & Patriots all bring championship trophies to pregame ceremony at Fenway. http://t.co/aZXyE1oqot", "author": "SportsCenter"}, {"text": "Get Beard: Red Sox World Series rings have beard illustration on inside, along w/ \"Bearded Brothers\" inscription. http://t.co/UAYyzIZcB5", "author": "SportsCenter"}, {"text": "Dodgers OF Yasiel Puig not in lineup for Friday's home opener vs Giants after arriving late to Dodger Stadium. Andre Ethier starts in RF.", "author": "SportsCenter"}, {"text": "Red Sox unveil 2013 World Series rings given to players today. (via @RedSox) » http://t.co/BMwInjQrwF", "author": "SportsCenter"}, {"text": "Former Masters champ @BubbaWatson pulls off miracle shots at Augusta, but the office has SERIOUS obstacles. http://t.co/gCERV9hSfv #ThisIsSC", "author": "SportsCenter"}, {"text": "THIS JUST IN: Doug McDermott wins 2014 #WoodenAward. Creighton F finishes his career as NCAA's No. 5 all-time scorer. http://t.co/5spCW52ELn", "author": "SportsCenter"}, {"text": "THIS JUST IN: Titans officially release RB Chris Johnson. http://t.co/JzEjRbDa27", "author": "SportsCenter"}, {"text": "Strange but true: Bills now have 7 players named Williams on roster - Mike, Aaron, Chris, Duke, Kyle, Mario and Nathan. (via @AdamSchefter)", "author": "SportsCenter"}, {"text": "\"I'm not chasing championships. I want championships to chase me.\" - UConn coach Kevin Ollie #LIVEonSC", "author": "SportsCenter"}, {"text": "How do you feel about athletes missing games while on paternity leave?  Use #SCcenterpiece, best tweets make 1pm ET SC.", "author": "SportsCenter"}, {"text": "The votes are in. SC fans believe Florida will be cutting down the nets.", "author": "SportsCenter"}, {"text": "LIVE VOTE ON SC, RIGHT NOW!", "author": "SportsCenter"}, {"text": "Which team has best chance to win NCAA Tournament? YOU decide. Live vote on SC at 10:30 ET. Click here to vote » http://t.co/ckPJkpGrTc", "author": "SportsCenter"}, {"text": "RT @AdamSchefter: No great surprise, but Titans are releasing RB Chris Johnson today, per source close to situation. Johnson will be a free…", "author": "SportsCenter"}, {"text": "Crazy Stat of the Day: Thunder G Russell Westbrook had more transition points (18), than entire Spurs team (17), in OKC’s 106-94 win.", "author": "SportsCenter"}, {"text": "Lakers leaning toward sitting Pau Gasol for final 7 games as he recovers from vertigo. http://t.co/UBO1RxpRFi", "author": "SportsCenter"}, {"text": "Danny Manning has agreed to become Wake Forest coach. He was No. 1 pick in 1988 NBA Draft. (via @GoodmanESPN) http://t.co/EFmc6WULvj", "author": "SportsCenter"}, {"text": "ICYMI: Michigan State's Adreian Payne had a SICK dunk, but his creative celebration was more memorable. #SCtop10 » http://t.co/DVeRuauaZX", "author": "SportsCenter"}, {"text": "Indians sign All-Star 2B Jason Kipnis to a 6-year extension. Kipnis led Tribe in runs, hits, RBI & steals in 2013. http://t.co/hQtsCUV5Wy", "author": "SportsCenter"}, {"text": "Mavericks survive late Clippers run, win 113-107.", "author": "SportsCenter"}, {"text": "Blake Griffin has his 4th career triple-double tonight -- 25 Pts, 10 Reb, 10 Ast.", "author": "SportsCenter"}, {"text": "ICYMI: Russell Westbrook dropped 27 in OKC's win over San Antonio, including this RIDICLOUS reverse dunk. » http://t.co/VTjWx3VFDY #SCtop10", "author": "SportsCenter"}, {"text": "Help us pick 3 stars of the night. We pick 2 performances, YOU pick the 3rd. Use #SC3stars and your tweet could air in the 12 am ET show!", "author": "SportsCenter"}, {"text": "@jpthomas4 That was pretty nice! Congratulations on making #SCtop10 http://t.co/IS4NnuYoUw", "author": "SportsCenter"}, {"text": "@Mista_Hall25 He brought down the house tonight! Congratulations on making #SCtop10 http://t.co/EnAR05RM6J", "author": "SportsCenter"}, {"text": "ICYMI: Baylor F Cory Jefferson took off from the free throw line for a spectacular slam. » http://t.co/LfZMmYznjJ #SCtop10", "author": "SportsCenter"}, {"text": "Theeeeee Yankees win!", "author": "SportsCenter"}, {"text": "THIS JUST IN: Seahawks and Head Coach Pete Carroll have agreed on contract extension (via NFL Network). http://t.co/WKX3uzFtbC", "author": "SportsCenter"}, {"text": "Kevin Durant's 39 straight games of 25+ points bring him within 1 of Michael Jordan's run of 40 straight in 1987. http://t.co/vswWlQYhJQ", "author": "SportsCenter"}, {"text": "Adreian Payne's first round dunk was a MONSTER. His celebration was even better. #SCtop10 » http://t.co/d3OCGZx5S1", "author": "SportsCenter"}, {"text": "Thunder beat Spurs, 106-94, snap San Antonio's 19-game win streak.", "author": "SportsCenter"}, {"text": "Kevin Durant now has 25 or more points in 39 consecutive games.", "author": "SportsCenter"}, {"text": "Russell Westbrook gets a 50 for that SICK dunk.", "author": "SportsCenter"}, {"text": "Former QB @Kenny_Mayne and @Buccigross are working on their chemistry in the newsroom.", "author": "SportsCenter"}, {"text": "Red Sox beat Orioles, 4-3.", "author": "SportsCenter"}, {"text": "Thunder are ON FIRE.", "author": "SportsCenter"}, {"text": "ICYMI: Cardinals 1B Matt Adams dives into crowd attempting to catch foul ball, shoves fan who makes catch. http://t.co/z5oFo2O5I2", "author": "SportsCenter"}, {"text": "Minnesota are the NIT Champs! Richard Pitino's Gophers top Larry Brown's SMU Mustangs, 65-63, for the title. Austin Hollins: 19 Pts, 4 Stl.", "author": "SportsCenter"}, {"text": "Shabazz Napier has hit many clutch shots this season, but none more than his buzzer-beater to beat Florida. #tbt", "author": "SportsCenter"}, {"text": "Want to make SportsCenter? Use #SCtop10 to nominate today's best plays & YOUR tweet could air in Top Plays tonight.", "author": "SportsCenter"}, {"text": "DeSean Jackson will wear No. 11 with the Redskins. His old No. 10, of course, is taken by @RGIII. http://t.co/fOQPs2pgSj", "author": "SportsCenter"}, {"text": "Feds open investigation into Florida State's handling of sexual assault allegations against Jameis Winston. » http://t.co/1V2bsht2KU", "author": "SportsCenter"}, {"text": "ICYMI: Carle Place (NY) HS pitcher Mike Delio struck out ALL 21 batters he faced while throwing a perfect game. » http://t.co/4LdAyCRx5k", "author": "SportsCenter"}, {"text": "That's a #TrumBOMB! Mark Trumbo goes yard to deep center for his 2nd HR of year. He's got a league-leading 8 RBI. D-Backs lead Giants, 4-2.", "author": "SportsCenter"}, {"text": "Cub flub: Chicago OF Junior Lake wears wrong jersey at start of Thursday's game vs Pirates. » http://t.co/ewiJhctgYW", "author": "SportsCenter"}, {"text": "UNC forward James Michael McAdoo will forgo his senior season and enter the NBA draft. http://t.co/PnWCXKVGVQ", "author": "SportsCenter"}, {"text": "Doug McDermott named AP player of the year, receiving 64 of 65 votes. Creighton F led nation in scoring at 26.7 PPG. http://t.co/djRnB5R2PN", "author": "SportsCenter"}, {"text": "Russell Wilson is dreaming big after winning the Super Bowl. » http://t.co/PDY5A0CsVY http://t.co/EDLtcNJKbp", "author": "SportsCenter"}, {"text": "Wichita State coach Gregg Marshall named AP coach of the year. Shockers entered NCAA tourney at 34-0 before losing in 3rd round to Kentucky.", "author": "SportsCenter"}, {"text": "CUBS WIN!. Chicago gets first victory of the year beating Pittsburgh, 3-2. 3B Mike Olt hits first career HR. http://t.co/yABA4IHlXV", "author": "SportsCenter"}, {"text": "Canadiens defenseman Douglas Murray suspended 3 games for illegal check to head of Mike Kostka. Kostka suffered a concussion on the play.", "author": "SportsCenter"}, {"text": "Patriots bring back S Patrick Chung. Chung played 4 seasons with Pats before signing with Eagles in 2013. http://t.co/AeyESAG9Ns", "author": "SportsCenter"}, {"text": "F James Michael McAdoo will enter 2014 NBA Draft. He averaged 11.4 Pts and 5.9 Reb in his three seasons at UNC. http://t.co/5LHgH0jILE", "author": "SportsCenter"}, {"text": "There are perfect games, and there's THE perfect game.", "author": "SportsCenter"}, {"text": "Paris Saint-Germain striker Zlatan Ibrahimovic out for a minimum of 4 weeks after sustaining hamstring injury vs Chelsea.", "author": "SportsCenter"}, {"text": "Before switching his Eagles jersey to a Redskins jersey, DeSean Jackson was electric in a Cal jersey. #tbt » http://t.co/27IDW59vBl", "author": "SportsCenter"}, {"text": "Best-selling MLB jerseys this offseason:", "author": "SportsCenter"}, {"text": "RT @BBTN: 25 years ago today, Ken Griffey Jr. hit a double in his first big league at-bat. #tbt http://t.co/qYBO8NMrN1", "author": "SportsCenter"}, {"text": "OF Chris Young placed on DL after playing one inning in Mets debut before leaving with a quadriceps injury.", "author": "SportsCenter"}, {"text": "\"It's a matter of time before Chris won't be with the Titans.\" Chris Johnson's agent Joel Segal. (via @SiriusXMNFL) http://t.co/V3xGUjY9QS", "author": "SportsCenter"}, {"text": "Crazy Stat of the Day: NBA ref Dick Bavetta officiated his 2,633rd straight regular-season game passing Cal Ripken Jr.'s MLB ironman streak.", "author": "SportsCenter"}, {"text": "Four months ago, UConn handed Florida its last loss on this buzzer-beater by Shabazz Napier. #tbt » http://t.co/OmMTmGmZ1p", "author": "SportsCenter"}, {"text": "Have Final Four questions? @JayBilas has answers. Use #BarkAtBilas, he could answer yours on the 9am ET SC.", "author": "SportsCenter"}, {"text": "It's a draw. #USMNT and Mexico play to a 2-2 tie. Controversial offsides call sees a would-be US winner pulled off the board in 86th minute.", "author": "SportsCenter"}, {"text": "Raise the Jolly Roger! Two games, two walkoffs for the Pirates as Tony Sanchez drives in the game-winner in the bottom of the 16th.", "author": "SportsCenter"}, {"text": "Clippers overcome 14-point 4th-quarter deficit to beat Suns, 112-108. LA clinches Pacific Division title for 2nd straight year.", "author": "SportsCenter"}, {"text": "Pirates and Cubs are less than 12 hours away from 1st pitch tomorrow.", "author": "SportsCenter"}, {"text": "Tied up! Alán Pulido with the equalizer for Mexico off the rebound! Tied at 2 in Arizona, 67th minute. #USAvMEX", "author": "SportsCenter"}, {"text": "Reds walk off!", "author": "SportsCenter"}, {"text": "ICYMI: LeBron James put Ekpe Udoh on a POSTER tonight.", "author": "SportsCenter"}, {"text": "ICYMI: Kevin Love dropped his 3rd triple-double of season tonight in win over Memphis. Love: 24 Pts, 16 Reb, 10 Ast http://t.co/jcFy9A4mXW", "author": "SportsCenter"}, {"text": "RT @ESPNStatsInfo: Mexico 389 consecutive minutes without scoring vs USA", "author": "SportsCenter"}, {"text": "HALFTIME: #USMNT leads Mexico, 2-0, with goals from Michael Bradley (http://t.co/S0Q6sGD8kW) and Chris Wondolowski (http://t.co/wKOauyNt42).", "author": "SportsCenter"}, {"text": "Help us pick 3 stars of the night. We pick 2 performances, YOU pick the 3rd. Use #SC3stars and your tweet could air in the 12 am ET show!", "author": "SportsCenter"}, {"text": "This is 1st time since 1965 that both Mets and Yankees have started a season 0-2. (via @ESPNStatsInfo) http://t.co/wqS83tkzfH", "author": "SportsCenter"}, {"text": "USA STRIKES AGAIN! Chris Wondolowski with the clinical finish as Michael Bradley heads it into the box. #USMNT up, 2-0, 28'.", "author": "SportsCenter"}, {"text": "Derek Jeter goes hitless as Astros beat Yankees, 3-1. New York is now 0-2 on the season. http://t.co/TcxJuGD7YP", "author": "SportsCenter"}, {"text": "GOAL! USA! Michael Bradley taps it in off the gorgeous set piece from Graham Zusi.  Americans take a 1-0 lead in the 15th minute. #USMNT", "author": "SportsCenter"}, {"text": "MANIMAL! Kenneth Faried scores a career-high 34 points, adds 13 rebounds as Nuggets blow out Pelicans, 137-107. http://t.co/eRgH426LLi", "author": "SportsCenter"}, {"text": "A rough night for Jonathan Papelbon against Rangers.", "author": "SportsCenter"}, {"text": "A walk-off walk!", "author": "SportsCenter"}, {"text": "Astros kicked off the Derek Jeter retirement tour tonight with custom boots, golf clubs and celebrity friends. » http://t.co/X3YEvHo7Ak", "author": "SportsCenter"}, {"text": "Final score: Connecticut 75, Stanford 56. Congratulations to @StanfordWBB on an exceptional season. #gostanford", "author": "Stanford"}, {"text": ".@StanfordWBB trails @UConnWBB 24-28 at half. #gostanford", "author": "Stanford"}, {"text": ".@StanfordWBB faces @UConnWBB in the Final Four at 6 p.m. PT. Watch the game on @espn: http://t.co/OgAYBnSrQz #gostanford", "author": "Stanford"}, {"text": "New ticket policies for #TEDxStanford 2014 are now online. Tickets go on sale April 7 at 10 a.m.: http://t.co/0jJsRahgBG", "author": "Stanford"}, {"text": "To get Silicon Valley right, the creators of new @HBO satire consulted with compression expert Prof. Tsachy Weissman: http://t.co/ZcIMrF3kkZ", "author": "Stanford"}, {"text": "A new campus center will serve as a testing ground for recovery of clean water, energy and materials from wastewater: http://t.co/J2ErHhgPpo", "author": "Stanford"}, {"text": "In the Arizona Cactus Garden. #farmphoto http://t.co/qXT1W8BkqB", "author": "Stanford"}, {"text": ".@FSIStanford affiliate Anja Manuel sees reasons to be optimistic as Afghanistan approaches a presidential election: http://t.co/BhjfJxxmrP", "author": "Stanford"}, {"text": "Isabel Stenzel (@PowerOfTwoMovie) will present at #TEDxStanford on May 10. Tickets go on sale Apr. 7 at 10 a.m.: http://t.co/0nvdAmMVrU", "author": "Stanford"}, {"text": "Daniel Sneider: Distinct historical memories make it harder for Asian nations to reconcile \"profound tensions.\" http://t.co/vHvxeDSJ9E", "author": "Stanford"}, {"text": "The new \"Circle of the Sun\" exhibit at @StanfordLibs shows the spread of secular learning throughout the Middle Ages: http://t.co/ytyeGdTev6", "author": "Stanford"}, {"text": "A @StanfordEarth class unites exploration of geology and art in California's Owens Valley: http://t.co/Ul0325zdhS http://t.co/AVTSuN9Shh", "author": "Stanford"}, {"text": "Sorting through biomedical \"big data\" has become a specialty practice in its own right: http://t.co/2Lk7NGU79r", "author": "Stanford"}, {"text": "Felicia Lee, a senior majoring in human biology, has been named the Honda Sports Award winner for swimming & diving: http://t.co/sLsgouU0b9", "author": "Stanford"}, {"text": "Professor Michele Elam recounts her \"adventures in racial ambiguity\" at #StanfordConnects in Atlanta: http://t.co/rjtWGvXxih", "author": "Stanford"}, {"text": "A new Stanford institute explores a role for the university in providing education for the second half of life: http://t.co/0GSqredcKx", "author": "Stanford"}, {"text": "April 5, 1992: @StanfordWBB holds their trophy after defeating Western Kentucky to win the NCAA championship. #tbt http://t.co/jKVzTYjAez", "author": "Stanford"}, {"text": ".@stanfordlaw's Professor Nathaniel Persily takes on the Supreme Court's #McCutcheon decision in a @nytopinion piece: http://t.co/YJhCdhQAfG", "author": "Stanford"}, {"text": "Brain waves make music with the help of an instrument devised by Professors Josef Parvizi and Chris Chafe: http://t.co/iJpzyo2fgS", "author": "Stanford"}, {"text": "TEDxStanford 2013 speaker Allison Okamura on robots and electronic interfaces that respond to touch: http://t.co/AvKtiSruFo", "author": "Stanford"}, {"text": "Researchers can forecast the ultimate popularity of a Facebook photo by watching the speed and structure of sharing: http://t.co/L7mFxWETxH", "author": "Stanford"}, {"text": "#IPCC co-chair @cfieldciwedu, PhD '81, discusses his group's landmark @UN report with @stanfordmag's Kevin Cool: http://t.co/krhpJ9ZLtx", "author": "Stanford"}, {"text": "Prof. Stuart Kim has studied some of the world's oldest people. He discusses how and why we age at #StanfordConnects: http://t.co/0KSFqWWqRx", "author": "Stanford"}, {"text": "Researchers find little in literature reviews & meta-analyses to support vitamin D's reputation as a \"magic bullet\": http://t.co/EW9ikw0peb", "author": "Stanford"}, {"text": ".@StanfordWBB will face Connecticut in the Final Four after defeating North Carolina at Maples Pavilion: http://t.co/to5fPRkSoo #gostanford", "author": "Stanford"}, {"text": "Michael St. Clair directs physics professors and graduate students in a \"construction performance\" set to Vivaldi: http://t.co/gkrGICXfV7", "author": "Stanford"}, {"text": "#AskSUMed hosts a Google+ hangout on the rare disease #scleroderma at 4:30 p.m. PT: http://t.co/K11HUk8zpj", "author": "Stanford"}, {"text": "Is our universe only one of many? @sciam writes about a debate heating up in the world of physics: http://t.co/phNse11oX7", "author": "Stanford"}, {"text": "\"I don't worry anymore about whether [virtual reality] will be accepted by the mainstream - that will happen\": http://t.co/PkWKCvBd7P", "author": "Stanford"}, {"text": "Students aid U.S. Advisory Council on Wildlife Trafficking in class led by council vice chair, Prof. David J. Hayes: http://t.co/BuR49PEa0r", "author": "Stanford"}, {"text": "Stegner Fellow NoViolet Bulawayo receives the PEN/Hemingway prize for her debut novel, \"We Need New Names\": http://t.co/zkbB8cmEDj", "author": "Stanford"}, {"text": "The new Stanford Distinguished Careers Institute will give participants the opportunity to reflect and redirect: http://t.co/qJVpD1Fjiq", "author": "Stanford"}, {"text": "A new book articulates the philosophical motivations underlying Einstein's most significant scientific contributions: http://t.co/HDszRod4YS", "author": "Stanford"}, {"text": "Appearing at #TEDxStanford 2014: racecar driver, scientist, dancer, playwright, more. http://t.co/3Q2PtVZbOY", "author": "Stanford"}, {"text": ".@StanfordWBB defeats North Carolina 74-65 to earn a spot in the Final Four. #gostanford", "author": "Stanford"}, {"text": ".@StanfordWBB's Elite Eight matchup v. North Carolina airs on @espn at 6:08 p.m. PT: http://t.co/91Kfri5i8L #gostanford", "author": "Stanford"}, {"text": "\"Orange is the New Black\" author @Piper Kerman speaks at 8 p.m. in Cemex Auditorium: http://t.co/XpzaePxWXv", "author": "Stanford"}, {"text": "Professor @JeffreyPfeffer: \"It's easy to get diverted by the hype,\" but workplace hierarchies still matter. http://t.co/Z5XBTgjh1A", "author": "Stanford"}, {"text": "Comedian @OliviaHarewood performs at #TEDxStanford 2013. Tickets for this year's event go on sale April 7: http://t.co/N6c1Jk55jA", "author": "Stanford"}, {"text": "Hoover Tower #farmphoto http://t.co/FBGSgofyqe", "author": "Stanford"}, {"text": "\"We have opportunities to manage how much global warming occurs.\" Professor Noah Diffenbaugh in @Salon Q&A: http://t.co/1ZeTwZKdW3", "author": "Stanford"}, {"text": ".@HCBSS presents \"Mindfulness, Love and Graceful Living in Fast Times,\" an evening with guest speaker @JackKornfield: http://t.co/VmF0WsiVRU", "author": "Stanford"}, {"text": "Prof. Juliet Brodie: It's critical that law students really understand the challenges their low-income clients face. http://t.co/4dqbcGkfmL", "author": "Stanford"}, {"text": "Tickets for #TEDxStanford 2014 go on sale April 7: http://t.co/9caJvYn3Yd", "author": "Stanford"}, {"text": "A new @StanfordLibs archive brings to life intimate moments from the civil rights movement: http://t.co/vPt06TAQeT http://t.co/0BlWLtMPwP", "author": "Stanford"}, {"text": "Students in a winter quarter practicum helped develop a national strategy to fight wildlife trafficking: http://t.co/AEKeMEWhxS", "author": "Stanford"}, {"text": ".@FSIStanford's @DavidBLobell, who devised models for #IPCC report, discusses the impact of warming on food security: http://t.co/yfhdtcBmr1", "author": "Stanford"}, {"text": "\"Not one thing comes easy. Great teams...push through.\" Watch @Chiney321 and @StanfordWBB advance to the Elite Eight: http://t.co/AOU9kb2iKN", "author": "Stanford"}, {"text": "More than 200 students participated in Alternative Spring Break 2014. Browse their photos from the field: http://t.co/Ecq96Ep6lI", "author": "Stanford"}, {"text": "Professor Chris Field: \"Dealing effectively with #climatechange is just going to be something that great nations do.\" http://t.co/RckGDsZyoF", "author": "Stanford"}, {"text": ".@StanfordWBB faces North Carolina in the Elite Eight Tuesday at 6 p.m. PT. Watch the game on @espn. #gostanford http://t.co/xMRrXQKCwx", "author": "Stanford"}, {"text": "What would a major earthquake along the southern San Andreas Fault mean for Los Angeles? A new tool provides clarity: http://t.co/Fod79J9bmx", "author": "Stanford"}, {"text": "What causes poverty? Society tends to answer that question in two very different ways, says Professor Juliet Brodie: http://t.co/Ri7WDnjzg8", "author": "Stanford"}, {"text": "Airplanes that continuously monitor their own \"health\" are part of an international effort to improve flight safety: http://t.co/0sVfNAZ1ms", "author": "Stanford"}, {"text": "Registration is open for Connecting the Dots 2014: Key #IPCC authors discuss climate, energy, food and water issues. http://t.co/RhqNGuEggO", "author": "Stanford"}, {"text": "\"It's a process designed to not let any nonsense through.\" Stanford scientists reflect on work for new #IPCC report: http://t.co/uhYheNe39O", "author": "Stanford"}, {"text": "A protein once thought to exclusively work in the immune system turns out to be critical in the developing brain: http://t.co/0i41HCgrqQ", "author": "Stanford"}, {"text": "Follow Stanford on @instagram for another perspective on campus life: http://t.co/yVTolz0ttK http://t.co/0myKn6ZSbj", "author": "Stanford"}, {"text": ".@StanfordWBB faces Penn State in the Sweet 16 Sunday at 1:30 p.m. PT at Maples Pavilion: http://t.co/7w9XKbdy3k #gostanford", "author": "Stanford"}, {"text": "High school students explore the mysteries of the nervous system in the hands-on \"Brain Lab\" session at #SUMed101: http://t.co/rVdUsB4Hax", "author": "Stanford"}, {"text": "Professor Juliet Brodie answers audience questions about poverty and the law in our newest Open Office Hours session: http://t.co/1QFpwU5K0U", "author": "Stanford"}, {"text": "At least one type of decision-maker - the @MLB umpire - is biased when the stakes are high, a new study shows: http://t.co/QRVGiK8oFV", "author": "Stanford"}, {"text": "Follow Stanford on @instagram for another perspective on campus life: http://t.co/7Z49Azra3T http://t.co/FO1b73PW1T", "author": "Stanford"}, {"text": "Tara Adiseshan, '13, MA '13, became a Stanford freshman at the age of 14. Watch her speak at #TEDxStanford 2013: http://t.co/E6PrZXkWXz", "author": "Stanford"}, {"text": "Follow @StanfordHealth for updates on #HealthMatters 2014, Stanford Medicine's free, family-friendly community day: http://t.co/tm4IV7hGDS", "author": "Stanford"}, {"text": ".@stanfordbball faces Dayton at 4:15 p.m. PT in the Sweet 16. Watch the @NCAA live stream: http://t.co/pIk6OtfvDj #gostanford", "author": "Stanford"}, {"text": "Around 140 local students will be on campus Friday for Med School 101. Share the experience by following @SUMedicine: http://t.co/4ljH5Wtjet", "author": "Stanford"}, {"text": "No-fly(er) zone. #farmphoto http://t.co/0ZxgHuTkht", "author": "Stanford"}, {"text": "More than 200 Stanford students are dedicating the week to Alternative Spring Break trips. Follow their progress: http://t.co/vOTZkgrqBe", "author": "Stanford"}, {"text": "Watch @stanfordbball prepare for today's game: http://t.co/oDQ35AhEXt #gostanford #MarchMadness", "author": "Stanford"}, {"text": "Enrollment is open for the @StanfordCSP course \"When the French Reinvented Cinema: The New Wave.\" http://t.co/SWZdXMkj6q", "author": "Stanford"}, {"text": "Doctoral candidate Patrick House tells how a computer program named Crazy Stone defeated pro Go player Yoshio Ishida: http://t.co/ylkVwBF5lL", "author": "Stanford"}, {"text": "Prof. @CondoleezzaRice and guests @ericschmidt and @JaredCohen of @google explore technology's role in geopolitics: http://t.co/HugGSOty6X", "author": "Stanford"}, {"text": "Study: Japan will face a debt crisis in the next 10 years unless it embraces significant tax hikes or budget cuts. http://t.co/gGtHfEn0YA", "author": "Stanford"}, {"text": "Mike Antonucci writes about the mix of faith, patience and determination behind @stanfordbball's success: http://t.co/AVqKoEfHMb", "author": "Stanford"}, {"text": "Happy, enduring collaborations rely on complementary - not similar - traits, says sociologist Daniel McFarland: http://t.co/J2R6LLe9MT", "author": "Stanford"}, {"text": "#MarchMadness standout Alex Chang, '14, of the Stanford Band, takes his cowbell skills to @JimmyKimmelLive: http://t.co/NXWKDuKiXT", "author": "Stanford"}, {"text": ".@StanfordEd study: Athletes reminded of the \"dumb jock\" stereotype scored about 12 percent lower on GRE-style tests. http://t.co/kzbUDbfqVT", "author": "Stanford"}, {"text": "Prof. Barbara Block: Oil from the Deepwater Horizon spill left tuna and other fish with likely fatal heart defects. http://t.co/vRHqoDtUtH", "author": "Stanford"}, {"text": "Spring break. http://t.co/Agtm5eKusz", "author": "Stanford"}, {"text": "How @StanfordBiz is facilitating growing global demand for management education: http://t.co/UcDdhSCU7k", "author": "Stanford"}, {"text": "Novelist Richard Powers examines the often-unexpected intersections between the humanities and sciences: http://t.co/ZtDhG2kN9C", "author": "Stanford"}, {"text": "Study: Students learning English benefit more in two-language instructional programs than in English immersion. http://t.co/gNWN6MGJBV", "author": "Stanford"}, {"text": "In our next Open Office Hours, @stanfordlaw's Juliet Brodie talks poverty & income inequality. Join the conversation: http://t.co/U3pvONTBcE", "author": "Stanford"}, {"text": ".@StanfordWBB defeats Florida State 63-44 to advance to the Sweet 16. #gostanford", "author": "Stanford"}, {"text": "Author Lawrence Friedman's work at @stanfordlaw inspired him to craft the \"The Frank May Chronicles\" mystery series: http://t.co/lz8DMi0NNv", "author": "Stanford"}, {"text": "What can your metadata reveal about you? Computer science doctoral candidate Patrick Mutchler talks to @BW: http://t.co/BCtm4WjKKk", "author": "Stanford"}, {"text": ".@FLOTUS Michelle Obama with students, after her speech at the Stanford Center at Peking University on Friday. http://t.co/6GfiLngPPw", "author": "Stanford"}, {"text": ".@StanfordWBB takes on Florida State at 3:30 p.m., with a berth in the Sweet 16 at Maples Pavilion on the line: http://t.co/9p56Z7Ws7D", "author": "Stanford"}, {"text": ".@McFaul: There was always an \"underlying sense that Russia was gradually joining the international order. No more.\" http://t.co/39c8j4cp7X", "author": "Stanford"}, {"text": "Congratulations to Vivian Kong, '16, who claimed the individual national title in women's epee on Friday: http://t.co/b7b6rrlr7p", "author": "Stanford"}, {"text": "A new Stanford facility will test promising technologies for recovery of clean water and energy from wastewater: http://t.co/GQz1N139wC", "author": "Stanford"}, {"text": "Watch a 4-foot-long, remote controlled, inflatable shark fly at #TEDxStanford 2013. The event returns May 10: http://t.co/xeFZwhtCyt", "author": "Stanford"}, {"text": ".@stanfordbball earns a 60-57 victory over Kansas. #gostanford #MarchMadness", "author": "Stanford"}, {"text": "Prof. Juliet Brodie, an expert on poverty law, hosts our next Open Office Hours session. Post your questions here: http://t.co/lduebtlLxz", "author": "Stanford"}, {"text": "Watch robots battle in the \"Introduction to Mechatronics\" final: http://t.co/EwAERT6ED7", "author": "Stanford"}, {"text": ".@GoStanford and @Chiney321 present an anthem for #NerdNation: http://t.co/ii05YICOdk", "author": "Stanford"}, {"text": "No. 2 seed @StanfordWBB plays No. 15 seed South Dakota at 3:30 p.m. PT to open the 2014 @NCAA Tournament: http://t.co/PXliB2hHqU #gostanford", "author": "Stanford"}, {"text": "In a visit to the Stanford Center at Peking University, Michelle Obama discussed the value of global education: http://t.co/FEAJyT9qSF", "author": "Stanford"}, {"text": "After a virtual exchange on global education with @FLOTUS, students in China and Palo Alto pause for a photo op. http://t.co/x5IQ8sQchX", "author": "Stanford"}, {"text": ".@FLOTUS: Don't let fear stop you. I grew up in little apartment on south side of Chicago. My parents didn't go to college. Yet here I am.", "author": "Stanford"}, {"text": "Why study abroad? In teleconference connecting Beijing to @StanfordBiz, @FLOTUS Michelle Obama emphasizes value of cross-cultural learning.", "author": "Stanford"}, {"text": "Michelle Obama: Countries are stronger and more prosperous when the voices of all people can be heard.", "author": "Stanford"}, {"text": ".@FLOTUS Michelle Obama: We believe that diversity makes our country vibrant and strong. http://t.co/rMS9JndpWf", "author": "Stanford"}, {"text": ".@FLOTUS Michelle Obama, on the value of cross-cultural exchange: We all have a stake in each other's success.", "author": "Stanford"}, {"text": "A full house in the atrium at Stanford Center at Peking University. Audience awaits speech by Michelle Obama. http://t.co/bAva9L2F5x", "author": "Stanford"}, {"text": "Follow @FSIStanford at 7:55 p.m. PT for live tweets of Michelle Obama in China, speaking with students in Beijing and Palo Alto.", "author": "Stanford"}, {"text": "Prof. Juliet Brodie, an expert on poverty law, hosts our next Open Office Hours session. Post your questions here: http://t.co/0Xfwh7uSLN", "author": "Stanford"}, {"text": "Watch robots battle in the \"Introduction to Mechatronics\" final: http://t.co/0JACYGVR1k", "author": "Stanford"}, {"text": "The spring issue of Stanford Business magazine explores the theme of \"pursuits\": http://t.co/7J8egmd5pe", "author": "Stanford"}, {"text": "#MatchDay2014 at @SUMedicine, where 90 percent of students received one of their top three choices: http://t.co/g4F0Db8lFM", "author": "Stanford"}, {"text": ".@stanfordbball earns a 58-53 victory over New Mexico in @NCAA opener. #gostanford #MarchMadness", "author": "Stanford"}, {"text": "Prof. Bronte-Stewart uses a new device to eavesdrop on problem neural circuits in patients with Parkinson's disease: http://t.co/fRrSEWBklt", "author": "Stanford"}, {"text": "Computational social science examines digital data for insights into human behavior: http://t.co/MHzg3MGQqT", "author": "Stanford"}, {"text": "Professor Stephen Hinton and the @StLawrence4tet will give an \"encore performance\" of their popular course next year: http://t.co/1g4PHOpvvK", "author": "Stanford"}, {"text": "On her China visit, the first lady will speak about value of cultural exchange and global education: http://t.co/Xk1uxp0mhH #StanfordFLOTUS", "author": "Stanford"}, {"text": "Tonight at 7:55 p.m., follow @FSIStanford for live tweets of Michelle Obama in China, speaking with students in Beijing and Palo Alto.", "author": "Stanford"}, {"text": "#TEDxStanford returns on May 10. Visit the new website for information on tickets, speakers and performances: http://t.co/tdgVVn1DAz", "author": "Stanford"}, {"text": "How did the planet cool 40 million years ago without spiraling into an ice age? Research looks at Earth's thermostat: http://t.co/STCmRWWzj2", "author": "Stanford"}, {"text": "In @WIRED: How Prof. Chao-Lin Kuo and team kept the \"biggest scientific discovery of the year\" a secret. http://t.co/pYtIoznRZp", "author": "Stanford"}, {"text": "Follow @StanfordHealth for updates on #HealthMatters 2014, Stanford Medicine's free, family-friendly community day: http://t.co/FtNOGW4K4x", "author": "Stanford"}, {"text": "A student project shows the public benefit of expunging some criminal convictions: http://t.co/r0dZraNP7F", "author": "Stanford"}, {"text": "Study: Wind farms can pay the \"energetic cost\" of storage and still remain net providers to the electrical grid. http://t.co/A96Tu4EokI", "author": "Stanford"}, {"text": "\"Intensity is her way of life, off court and on.\" Stanford Magazine profiles @StanfordWBB's inexhaustible @Chiney321: http://t.co/K5DVXXesI1", "author": "Stanford"}, {"text": "A sign of spring in Serra Grove. #FarmPhoto http://t.co/y0tK5QurvH", "author": "Stanford"}, {"text": "Professor Abraham Verghese describes the contents of his lab coat pockets and why they're vital for a bedside exam: http://t.co/eFkxXBQpEp", "author": "Stanford"}, {"text": ".@msnbc discusses the escalation in #Ukraine with @FSIStanford's Mike @McFaul, former U.S. ambassador to Russia: http://t.co/XOt9Ektykd", "author": "Stanford"}, {"text": "To better understand Earth, geophysicists study Titan, Saturn's second largest moon: http://t.co/ki6d75lZm5", "author": "Stanford"}, {"text": "A new study maps hot spots where sea turtles and dolphins become unintended victims of intensive global fishing: http://t.co/t2w1lb9kiK", "author": "Stanford"}, {"text": "An online archive expands access to French Revolution treasures: http://t.co/YZCVDOcCjK", "author": "Stanford"}, {"text": "Fifty years ago, a frat house on the Farm became a hot spot in the civil rights movement: http://t.co/N1fEwWYOJe", "author": "Stanford"}, {"text": "A German shift on Russia is palpable if incomplete, writes @FSIStanford fellow Josef Joffe in @csmonitor: http://t.co/s2gGKNHM9U", "author": "Stanford"}, {"text": "MarYam Hamedani: We must make #HigherEd a more welcoming place for first-generation and low-income students. http://t.co/zqS9jVJZJ1", "author": "Stanford"}, {"text": "\"Wins on the field are not the only statistics worth tracking.\" President John Hennessy on the student-athlete: http://t.co/RiyXx7R036", "author": "Stanford"}, {"text": "Assignment: Create an autonomous, battery-powered animatronic waterfowl that propels itself with paddling motion. http://t.co/iPITZqP0x5", "author": "Stanford"}, {"text": "California sea lions exposed to an algal toxin can develop a form of epilepsy similar to that of humans: http://t.co/ufFW0pWPlV", "author": "Stanford"}, {"text": "Hoyt Peckham's @SmartFishAC initiative receives $150,000 to help small fisheries reduce bycatch and boost profits: http://t.co/htCS8Gi98U", "author": "Stanford"}, {"text": "Flexible circuits invented by Professor Zhenan Bao and colleagues could pave the way for foldable digital devices: http://t.co/YQH4OSp22l", "author": "Stanford"}, {"text": "The serious business of laughter in the workplace: http://t.co/UWOa21zCYR", "author": "Stanford"}, {"text": "With help from @FSIStanford's #ImplementationLab, researchers take to the field to improve health outcomes in India: http://t.co/M6k0KfgHy2", "author": "Stanford"}, {"text": "\"Reading Like a Historian,\" an online learning tool from @StanfordEd faculty & students, passes 1 million downloads: http://t.co/71G9435nR6", "author": "Stanford"}, {"text": "Watch Prof. Kuo surprise Prof. Linde with \"smoking gun\" evidence supporting his theoretical work on cosmic inflation: http://t.co/DQeOb8g7mP", "author": "Stanford"}, {"text": "With detection of primordial space-time ripples, Prof. Chao-Lin Kuo and others have \"seen\" the start of the Big Bang: http://t.co/Ueo98r6iz6", "author": "Stanford"}, {"text": "#NerdAnthem, behind the scenes: http://t.co/HIku41ffNN", "author": "Stanford"}, {"text": ".@GoStanford and @Chiney321 present: \"N-E-R-D-S.\" http://t.co/rFcPs12X9l #NerdAnthem", "author": "Stanford"}, {"text": "Physicists have discovered the first direct evidence supporting the inflation theory of how the universe came to be: http://t.co/agfCYwS7b9", "author": "Stanford"}, {"text": "Archeologist Justin Leidwanger explores Mediterranean shipwrecks to track travel and trade during the Roman Empire: http://t.co/RVPoixqzqs", "author": "Stanford"}, {"text": "Stanley Fischer is the recipient of a $100K prize from the Stanford Institute for Economic Policy Research: http://t.co/YjP7hrcZrn", "author": "Stanford"}, {"text": "A project directed by Prof. Londa Schiebinger helps researchers take sex and gender into account in their work: http://t.co/ecUX6IfMLV", "author": "Stanford"}, {"text": "\"Obsessed and inexhaustible\": Stanford Magazine profiles @StanfordWBB standout @Chiney321. http://t.co/Fk0o7I7OOn", "author": "Stanford"}, {"text": "A new @SUMedicine center will wage war on sloppy science. @TheEconomist reports: http://t.co/IQ49IdyHFP", "author": "Stanford"}, {"text": "New work by @StanfordEarth researchers could lead to a better understanding of the geologic carbon cycle: http://t.co/GykYblWf3i", "author": "Stanford"}, {"text": ".@stanfordbball takes on UCLA in the @pac12 semifinals at 8:30 p.m. PT. Watch the game on @FOXSports1: http://t.co/QXY0sNCChx #gostanford", "author": "Stanford"}, {"text": "A new summer scholarship program at Stanford is designed to help #veterans prepare for four-year universities: http://t.co/Vsus87Ldh1", "author": "Stanford"}, {"text": "A new technique allows scientists to observe single molecules of protein or DNA as they bind with other molecules: http://t.co/ZHl0WrwFXt", "author": "Stanford"}, {"text": "Prof. Savas Dimopoulos and fellow physicists star in a new documentary about the search for the \"the God particle\": http://t.co/snRzYBZvto", "author": "Stanford"}, {"text": "\"Dear Dr. Shumway, I am 11 years old and I admire your work.\" The letter a future doctor wrote to a medical pioneer: http://t.co/NBjLzRGeqP", "author": "Stanford"}, {"text": "Researchers were able to infer sensitive information about callers from phone metadata alone. The @guardian reports: http://t.co/Zb1ymuoR80", "author": "Stanford"}, {"text": "Intelligence expert Amy Zegart of @StanfordCISAC answers questions about dispute between @SenFeinstein and the CIA: http://t.co/OOMjowLDnq", "author": "Stanford"}, {"text": "\"It takes me away from everything I used to do.\" Students reflect on the toll of homework in a new @StanfordEd study: http://t.co/ofEIDblzJS", "author": "Stanford"}, {"text": ".@techreview writes about Twitch, one of several projects exploring crowdsourcing via the mobile phone lock screen: http://t.co/1vTJ4j8pz2", "author": "Stanford"}, {"text": "Offshore wind turbines could reduce onshore damage from hurricanes without breaking, Prof. Mark Jacobson has shown: http://t.co/3Rp8ecdjr7", "author": "Stanford"}, {"text": "Join Prof. Savas Dimopoulos and others in a Q&A following Saturday's showing of the new documentary \"Particle Fever\": http://t.co/M6g76oaZIE", "author": "Stanford"}, {"text": "\"Particle Fever,\" a documentary on the search for the Higgs boson w/ Prof. Dimopoulos, opens in the Bay Area Friday: http://t.co/HFTekjqxuE", "author": "Stanford"}, {"text": "Registration now open for the Big Data in BioMedicine Conference co-sponsored by @SUMedicine and @UniofOxford: http://t.co/uq00hfY4rW", "author": "Stanford"}, {"text": "Former @jcpenney CEO Ron Johnson, '80, and @CathyHorynNYT discuss the future of retail: http://t.co/pNkhllGMJU", "author": "Stanford"}, {"text": "Today in Cemex Auditorium: @tomfriedman speaks about his experiences as a foreign affairs columnist for the @nytimes. http://t.co/UMlVlGhimA", "author": "Stanford"}, {"text": "Using only phone metadata like that collected by the #NSA, students are able to infer highly personal information: http://t.co/45uZHSlz7Y", "author": "Stanford"}, {"text": "Science & technology research must consider the biological and social needs of women, writes Prof. Londa Schiebinger: http://t.co/gGcX41spAn", "author": "Stanford"}, {"text": ".@SUMedicine Professor Jill Helms at #StanfordConnects: An appreciation for beauty is embedded in our DNA. http://t.co/arrcxgigG5", "author": "Stanford"}, {"text": "Professor Alvin Roth and fellow economists share \"wild guesses\" about the world 100 years from now: http://t.co/pm9iRAkIFz", "author": "Stanford"}, {"text": "Watch bioengineers in Prof. Manu Prakash's lab turn a flat piece of paper into highly functional research microscope: http://t.co/piR3ad6NRx", "author": "Stanford"}, {"text": "\"I realized ... It wasn't I who had the limitation.\" Rachel Kolb on navigating the world with profound hearing loss: http://t.co/fmKNWTwpo9", "author": "Stanford"}, {"text": "The #NSA's mass collection of phone records yields much more information than the government claims, researchers say: http://t.co/8kdWwX4ppF", "author": "Stanford"}, {"text": "President John Hennessy and @UCBerkley's chancellor discuss the future of online education at two-day summit: http://t.co/i3c4ogiyD4", "author": "Stanford"}, {"text": "Scientific research must take gender into account, writes Professor Londa Schiebinger in @NatureNews: http://t.co/Lak6UIMxvl", "author": "Stanford"}, {"text": "Researcher Jeanne Paz devised a way to shut down epilepsy-like activity in rat brains with the flip of a switch: http://t.co/r3C7auAUn6", "author": "Stanford"}, {"text": ".@SUMedicine researchers: Significant challenges stand between whole-genome sequencing and its routine clinical use. http://t.co/iSUdiqXJCc", "author": "Stanford"}, {"text": "\"Revolutions in Eastern Europe,\" a new @HooverArchives exhibition, opens today: http://t.co/W6Rwn4OgwH http://t.co/jTijZKcCbG", "author": "Stanford"}, {"text": ".@tomfriedman speaks about his experiences as a foreign affairs columnist, March 13 at 12 p.m. in Cemex Auditorium: http://t.co/nofqgJIzd3", "author": "Stanford"}, {"text": "How is the tech boom affecting Bay Area artists? Professor Fred Turner participates in a discussion on @KQEDForum: http://t.co/2XbXdnAQ2c", "author": "Stanford"}, {"text": "In study, glasses boosted the test scores of rural Chinese schoolchildren as much as 18 percent in just six months: http://t.co/vFFY4LK7Oh", "author": "Stanford"}, {"text": ".@StanfordEd's Denise Pope: \"Our findings ... challenge the traditional assumption that homework is inherently good.\" http://t.co/kxje2PkRxP", "author": "Stanford"}, {"text": "Koreans and Americans tackle moral dilemmas using different brain regions: http://t.co/asflis5rbI", "author": "Stanford"}, {"text": "Planes, trains and automobiles ... and carbon emissions. Vincent Chen, '13, on minimizing the impact of your travels: http://t.co/3UreKXJLwy", "author": "Stanford"}, {"text": ".@dwell previews the Anderson Collection gallery, set to open at Stanford later this year: http://t.co/wIvJNDPK9J", "author": "Stanford"}, {"text": "In study by Professor Bloom, telecommuters were more productive than office workers but promoted at half the rate: http://t.co/hQzJIU412i", "author": "Stanford"}, {"text": "A newly identified nerve cluster may provide a way to treat people who feel intense pain when touched: http://t.co/mZPKyHw0T0", "author": "Stanford"}, {"text": "On March 12 Professor Michael Levitt will give his first public talk since winning the 2013 #NobelPrize in Chemistry: http://t.co/eE953yXdex", "author": "Stanford"}, {"text": "Manu Prakash, professor of bioengineering, has developed a 50-cent paper microscope: http://t.co/y2ZgvVTQQK", "author": "Stanford"}, {"text": "Stanford is happy: http://t.co/Ta78iUiEda", "author": "Stanford"}, {"text": "With support from @FSIStanford's Implementation Lab, Prof. Magaloni works to curb violence in Rio de Janeiro's slums: http://t.co/BiJb1HEiRM", "author": "Stanford"}, {"text": "Koreans and Americans tackle moral dilemmas using different brain regions, neuroimaging shows: http://t.co/4XqjvsNeMi", "author": "Stanford"}, {"text": "A new type of social network shields users from the monetization of their personal lives: http://t.co/FURSOEabjl", "author": "Stanford"}, {"text": "Too much homework can hinder learning and diminish well-being, @StanfordEd research shows: http://t.co/xmVDDefP4N", "author": "Stanford"}, {"text": "A newly developed technique makes it possible to identify which genes a child inherited from each parent: http://t.co/3kxgMZJmmd", "author": "Stanford"}, {"text": "New degrees will let undergraduates \"joint major\" in computer science and either English or music starting fall 2014: http://t.co/lnImnvmc1u", "author": "Stanford"}, {"text": "Memory lapse? Public speaking expert Matt Abrahams breaks down the art of the graceful recovery: http://t.co/TFqSdrVnaK", "author": "Stanford"}, {"text": "Some 2,755 people logged almost 390,000 minutes of physical activity to help Stanford win @pac12 fitness challenge: http://t.co/4ZCxC8kVfE", "author": "Stanford"}, {"text": "\"At Stanford, it's okay - it's even celebrated - to diverge from the linear path.\" @KaiKight at #StanfordConnects: http://t.co/3lBHyeYDPF", "author": "Stanford"}, {"text": "RT @kellymcmanus: Our @UWaterloo students test their pancake flipping skills @Elmira_MSF #ElmiraMapleSyrupFestival http://t.co/sEj8ZHGLZH", "author": "UWaterloo"}, {"text": "RT @arda_ocal: Just 2 guys who attended @WOSS_Events & @UWaterloo.. Thanks for the incredible chat. @Cmdr_Hadfield @weathernetwork http://t…", "author": "UWaterloo"}, {"text": "MT @OntInnovation: #Ontario proud to support researcher’s discoveries in #Waterloo Region http://t.co/JNTiklfT0J #UWaterloo", "author": "UWaterloo"}, {"text": "MT @waterlooENG: Not too late to cast your vote for #UWCapstone teams to win Sedra People's Choice award of $3,000. http://t.co/LuFWQ34b4g", "author": "UWaterloo"}, {"text": "MT @UWaterlooLife: They’re back - spot a goose nest on campus #UWaterloo? Let the campus know through #Goosewatch14 http://t.co/8w6J8beRyk", "author": "UWaterloo"}, {"text": "Watch some of @WaterlooENG's best pitch for $60k at the Esch Entrepreneurship Capstone Design Awards today at 2! http://t.co/kCFrM7WPxc", "author": "UWaterloo"}, {"text": "@sunhay Do you know where that originated? Not great communication practice to cause panic with inaccurate information. DM any info! Thx", "author": "UWaterloo"}, {"text": "@sunhay That is not official university messaging and did not come from UW Police. We did post in this thread: http://t.co/DlOOfHKhRz", "author": "UWaterloo"}, {"text": "@stevekrysak Shame that is not being used anymore. Our windsurfing demographic is dangerously low.", "author": "UWaterloo"}, {"text": "@ChampBeechwood The contest requires a picture but in this particular case I think we will pass.", "author": "UWaterloo"}, {"text": "@RidhiK That was a popular sentiment during our Twitter Chat yesterday. Are you satisfied with your choice of Waterloo?", "author": "UWaterloo"}, {"text": "Tell us what #Innovation means to you and you can win $50 on your WatCard! #WINS14 http://t.co/HbR7XTeQ5O", "author": "UWaterloo"}, {"text": "Look good and support safe drinking water in Africa with @WaterlooENG student's clothing company @HydratedWorld http://t.co/2pOh7SdqAr", "author": "UWaterloo"}, {"text": "It's all in the bones! #Uwaterloo researcher uses fish ear bones to gain information on climate change and pollution. http://t.co/xvDbOaMzF9", "author": "UWaterloo"}, {"text": "MT @MatthewKangCBC: #UWaterloo #slutwalk passing through Uptown Waterloo, raising awareness about victim shaming. http://t.co/H5VaCDSpcV", "author": "UWaterloo"}, {"text": "@ChampBeechwood Seems legit to us.", "author": "UWaterloo"}, {"text": "@niicktaaJ Agreed! Why not take a picture and tell us what innovation means to you! (see that smooth promotion!) http://t.co/8h1vIZNbwH", "author": "UWaterloo"}, {"text": "RT @uwstratford: University of Waterloo Stratford Campus grad student helps capture national hackathon top prize http://t.co/esf9Y0QUlk", "author": "UWaterloo"}, {"text": "@TheTofu That is an amazing tweet for so many reasons.", "author": "UWaterloo"}, {"text": "Did you know #UWaterloo offers amazing Summer Abroad programs? If you could study anywhere where would you go? #uwth http://t.co/7VUcRaOxDb", "author": "UWaterloo"}, {"text": "If you have any questions about the future of internationalization at #UWaterloo tweet your ?'s using the #uwth tag or to @UWaterlooLive", "author": "UWaterloo"}, {"text": "Check out some amazing experiences from around the globe of our @UWaterlooArts students! #uwth http://t.co/NXyKruWctr", "author": "UWaterloo"}, {"text": "Q4:How has placement or perspective from another country impacted your #UWaterloo experience? #uwth", "author": "UWaterloo"}, {"text": "The Town Hall on internationalization is about to begin! Watch online here - http://t.co/a31pINFuUy and ask any questions using #uwth!", "author": "UWaterloo"}, {"text": "@DanyCao4 What program did you come to #UWaterloo for?", "author": "UWaterloo"}, {"text": "Very interesting. ANY course could be #internationalized. Could be field component or global focus of study. Available on @uwcte site #uwth", "author": "UWaterloo"}, {"text": "Great conversation! Q3: Do we need more international content in degree programs at #UWaterloo? How should that look? #uwth", "author": "UWaterloo"}, {"text": "@n_deVries Are you interested in a field of study based in Switzerland? #uwth", "author": "UWaterloo"}, {"text": "@DontSueYash Do you think there are parts of the world that #UWaterloo should be more invested in? #uwth", "author": "UWaterloo"}, {"text": "@jyoansah To Q2, what areas of the world do you think #UWaterloo should explore in the future? #uwth", "author": "UWaterloo"}, {"text": "Q2: In what area(s) of the world should Waterloo examine to provide more international opportunities for work, research or exchange? #uwth", "author": "UWaterloo"}, {"text": "@munashe_ Do you mean VISA issues or study abroad opportunities? #uwth", "author": "UWaterloo"}, {"text": "@jyoansah Would you have come to #UWaterloo without coop or was it the reputation? #uwth", "author": "UWaterloo"}, {"text": "@alvaronas How did you find your experience at #UWaterloo? #uwth", "author": "UWaterloo"}, {"text": "@jyoansah What was the main criteria for your choice? Academics? University reputation? #uwth", "author": "UWaterloo"}, {"text": "@Poindle Why did you choose to study abroad? What would you have changed?", "author": "UWaterloo"}, {"text": "@munashe_ Can you expand on that? Did your intentional experience not meet your expectations? #uwth", "author": "UWaterloo"}, {"text": "Any international students/faculty out there, we would love to hear what brought you to #UWaterloo! #uwth", "author": "UWaterloo"}, {"text": "@Poindle Did you do an international exchange? #uwth", "author": "UWaterloo"}, {"text": "Reputation matters! In September #UWaterloo ENG and Technology ranked in the top 50 globally. #uwth http://t.co/EQJXe60qcI", "author": "UWaterloo"}, {"text": "Drew Knight - Reputation, the international experience and the amazing opportunities that exist such as student exchanges. #uwth", "author": "UWaterloo"}, {"text": "Lets begin! Q1:What are some of the main factors that bring international students/faculty to #UWaterloo? #uwth", "author": "UWaterloo"}, {"text": "Our guests will be tweeting from the @UWaterlooLIVE account. You can follow there or through the #uwth hashtag!", "author": "UWaterloo"}, {"text": "This chat will lead into the Town Hall meeting on Global prominence and internationalization at 3pm, being held in EIT. #uwth", "author": "UWaterloo"}, {"text": "Our 3 chat guests are Drew Knight Dir. of Global Alliances, Andreea Ciucurita Study Abroad Manager & Jeanette Nugent AD, Grad Admissions", "author": "UWaterloo"}, {"text": "Today’s Twitter Chat will look at the third theme of our strategic plan “Global prominence and internationalization”. #uwth", "author": "UWaterloo"}, {"text": "We have some great experts on #UWaterloo's global alliances and information on how you can study abroad at our 1pm Chat! Use #uwth to ask ?s", "author": "UWaterloo"}, {"text": "Don't miss today's live chat about #internationalization before the Strategic Plan Town Hall meeting. Join the conversation in 1 hour! #uwth", "author": "UWaterloo"}, {"text": "@quang21 @jeffreykylely Haha, yes I am sure pizza plays an important role in many forms of innovation. Thanks for submitting!", "author": "UWaterloo"}, {"text": "@quang21 @jeffreykylely @UWaterlooAlumni You guys did the hard part, now just tell us what innovation means to you!", "author": "UWaterloo"}, {"text": "@_jubird It is an Instagram contest so you have lots of room in the caption. Hopefully you can participate!", "author": "UWaterloo"}, {"text": "@_jubird Developing more meaning of \"innovation\" is the idea of the contest. Love to hear what it means to you! Send in a pic tagged #WINS14", "author": "UWaterloo"}, {"text": "Take a selfie, tell us what #innovation means and you can win $50 on your WatCard or an @UWaterlooAlumni prize pack! http://t.co/PSomva15Sg", "author": "UWaterloo"}, {"text": "At #UWaterloo, we can all be international leaders. Join the conversation with community members via live chat today at 1pm #uwth", "author": "UWaterloo"}, {"text": "Research, work and learning are enhanced with a global view. Discuss internationalization tomorrow before the Town Hall meeting with #uwth", "author": "UWaterloo"}, {"text": "Are you an international student or interested in studying abroad? Don't miss our Twitter Chat tomorrow at 1pm on internationalization #uwth", "author": "UWaterloo"}, {"text": "RT @standuptostigma: Our 1st mental health discussion group today at @UWaterloo (MC 4060), 6-7 pm. Everyone welcome! http://t.co/YDIvWoTPCy", "author": "UWaterloo"}, {"text": "Three experienced federal advisors offer tips on how #entrepreneurs can go global! http://t.co/3QYUn9EJLd #WINS14", "author": "UWaterloo"}, {"text": "@mkryshtalskyj @conraduwaterloo It is invite only but we will have a few tickets to give away early next week and it will be livestreamed.", "author": "UWaterloo"}, {"text": ".@QuantumIQC physicists conduct experiment on campus to move quantum communication forward. http://t.co/IEpZrbx1xH #UWaterloo", "author": "UWaterloo"}, {"text": "@SFU @westernu I think he will be busy teaching this fall but we'll ask his opinion on all the hot student hangouts in space & let you know!", "author": "UWaterloo"}, {"text": "Now THIS is innovation! @UWaterlooWatTac will text you when and where on-campus restaurants have tacos on the menu. http://t.co/xmCg3rBnee", "author": "UWaterloo"}, {"text": "Join us for a live Twitter chat April 2 at 1pm to talk about #UWaterloo's global presence, leading to the Town Hall meeting at 2pm. #uwth", "author": "UWaterloo"}, {"text": "@Jooyceli It's truly spring when the guy on the unicycle shows up in the arts quad.", "author": "UWaterloo"}, {"text": "RT @CCS_media: Making lifestyle changes core to #cancer prevention, says @UWaterloo researcher. http://t.co/R36QBBJDAn", "author": "UWaterloo"}, {"text": "Look out @KenJennings, @WaterlooBio grad recently had his chance on @Jeopardy! http://t.co/DvEyYukPcJ #UWaterloo", "author": "UWaterloo"}, {"text": "@UWaterlooWatTac Haha, amazing. So you get a notification where tacos are available or when they are sold? (Great URL too!)", "author": "UWaterloo"}, {"text": "Very cool! RT @QuantumIQC: Join us for \"Gravity\" Wed 7pm Q&A by Steve MacLean astronaut/frmr head of Cdn Space Agency http://t.co/7qMUzJoo6j", "author": "UWaterloo"}, {"text": "Amphibious houses could protect vulnerable communities devastated by floods, says #UWaterloo architecture prof. http://t.co/CsOzH6hyiR", "author": "UWaterloo"}, {"text": "Don't miss @WaterlooENG's Capstone Design team finalists as they pitch their projects to win over $60,000 in awards! http://t.co/w0YYkRFV2o", "author": "UWaterloo"}, {"text": "The importance of #VC and the #innovation economy for today's #entrepreneur is more important than ever!  http://t.co/ohH8vybfhf #WIS14", "author": "UWaterloo"}, {"text": "Join @sustain_campus today in the SLC to celebrate #UWEarthHour and your commitment to the planet! http://t.co/zyYCnuJyZN", "author": "UWaterloo"}, {"text": "RT @Kik: We’re proud to be sponsoring UW Apprentice this weekend. Good luck to all @uwaterloo students participating!", "author": "UWaterloo"}, {"text": ".@TrendRadius @SparkGig @PetroPredict and @palettegear win grants of $25k and a spot with @UWVeloCity http://t.co/R50swSNskS", "author": "UWaterloo"}, {"text": "Celebrate the works of fourth-year #UWaterloo Fine Arts students at the 40th Annual Exhibition: Blank Slate - http://t.co/z7aCRLLdAA", "author": "UWaterloo"}, {"text": "MT @UWHousing: #uWaterloo is building a NEW student residence! See 1st draft #newUWrez images and where it’s going: http://t.co/BuciWfZOiK", "author": "UWaterloo"}, {"text": ".@aeryonlabs helps explain the importance of #VC and the #innovation economy for today's #entrepreneur. http://t.co/Gg1IB0U0Eu #WIS14", "author": "UWaterloo"}, {"text": "Join @sustain_campus this Saturday in the SLC to celebrate #UWEarthHour and your commitment to the planet! http://t.co/zyYCnuJyZN", "author": "UWaterloo"}, {"text": "RT @palettegear: What a day! @cchurun gives an impressive pitch to help us win $25K + $10K at #VFFW14 @UWvelocity @uwaterloo Featured http:…", "author": "UWaterloo"}, {"text": "Thank you @MonashUni President Byrne for today's special guest lecture. We hope you enjoyed our research facilities! http://t.co/BfBvJQ61Tc", "author": "UWaterloo"}, {"text": "RT @ahswaterloo: Huge congrats to @UWKinDept grad student Matt Vonk - winner of @uwaterloo 's #3mt competition and the People's Choice!", "author": "UWaterloo"}, {"text": ".@UWvelocity #VFFW14 $25K winners announced! Congratulations to @petropredict @palettegear @TrendRadius and @SparkGig!", "author": "UWaterloo"}, {"text": "Good luck to all students who are presenting their #3MT! Your research holds outstanding new ideas.", "author": "UWaterloo"}, {"text": ".@ingridschiller,#UWaterloo alumna and Director of Charities at Formulating Change Inc, is also a #3MT judge. Thank you for judging, Ingrid!", "author": "UWaterloo"}, {"text": "Thank you @ReadWaterloo, Associate Provost, Student at #UWaterloo, for judging #3MT also.Chris works to ensure rich educational experiences!", "author": "UWaterloo"}, {"text": "Daiene Vernile produces and anchors award-winning @PROVINCEWIDE, CTV Southwestern Ontario. Thank you for judging #3MT, Daiene!", "author": "UWaterloo"}, {"text": ".@craignorriscbc is radio host of The Morning Edition at @CBCKW891. Craig is a returning #3MT judge. Thank you for coming back for year 2!", "author": "UWaterloo"}, {"text": "We are glad to welcome @MayorCarlZehr, the current mayor of the City of Kitchener, to the #3MT judging panel. Thank you, Mayor Zehr!", "author": "UWaterloo"}, {"text": "This year’s #3MT judging panel includes many local community members. Thank you to all for joining us at #UWaterloo!", "author": "UWaterloo"}, {"text": "#VFFW14 $1K winners are NewAllergy Technology for Most Innovative and People's Choice, FocusONCare for Best Pitch! http://t.co/YEJicBy6tt", "author": "UWaterloo"}, {"text": "Campus is overflowing with ideas today– Don't miss the Three-Minute Thesis finals from 2:30-4pm in Hagey Hall! #3MT http://t.co/N3oeI5yWRI", "author": "UWaterloo"}, {"text": "Join us for the Velocity Fund Finals in the SLC from 11am-3pm and see which #startups will win $25K! #VFFW14 http://t.co/yPyUsahFaN", "author": "UWaterloo"}, {"text": "RT @craignorriscbc: .@uWaterloo's 3 Minute Thesis Competition #3MT is today. 7:40, meet last year's \"eye-opening\" winner, Chau-Minh Phan. @…", "author": "UWaterloo"}, {"text": "Today's @OntUniv #Experientiallearning report presents opportunity to celebrate #UWaterloo as world leaders in co-op! http://t.co/8cSeTKzvYD", "author": "UWaterloo"}, {"text": "RT @ontuniv: Did you know @UWaterloo has the largest co-op program in the world? See report: http://t.co/BZZ5th4n55 #experientiallearning", "author": "UWaterloo"}, {"text": "#UWaterloo @envwaterloo student has been selected to help save endangered wildlife! http://t.co/avA7afPgHB http://t.co/tl3tJE28OV", "author": "UWaterloo"}, {"text": "@JJVenky Thanks for the heads up! We have let them know.", "author": "UWaterloo"}, {"text": ".@ROWPublicHealth confirms one case of measles at #UWaterloo but no others reported. Make sure you have your shots! http://t.co/F9KZxdUSOP", "author": "UWaterloo"}, {"text": "U15 Group of Canadian Research Universities joins global network of leading research institutes. http://t.co/sGvQZHafy6 #cdnpse", "author": "UWaterloo"}, {"text": "3 minutes & 1 slide to explain their research. Watch #UWaterloo's best compete in the 3 Minute thesis Thursday! http://t.co/c5F7dGQtxg #3MT", "author": "UWaterloo"}, {"text": "4 Canadian #entrepreneurs that are masters of #innovation! http://t.co/g6KJPBX4Zj #WIS14 #UWaterloo", "author": "UWaterloo"}, {"text": "#UWaterloo professor Philip Beelsey shares his work with students in Palestine to develop innovative thinking http://t.co/kFXP3fyeCm", "author": "UWaterloo"}, {"text": ".@UWVeloCity's PiinPoint becomes latest company to participate in Y Combinator accelerator program in Silicon Valley. http://t.co/bAb61bFzul", "author": "UWaterloo"}, {"text": "@abr71310 Their fax is 519-746-2882 listed here http://t.co/F1onQdAJOs Hope it is the right one!", "author": "UWaterloo"}, {"text": "Supporting #UWaterloo's \"unconventional approach to #entrepreneurship\" Mike Stork donates $1 Million to @UWVeloCity http://t.co/Pjm1KFuZyX", "author": "UWaterloo"}, {"text": "#UWaterloo, @Harvard and @Perimeter are one step closer to developing world’s first room-temperature superconductor. http://t.co/PCyt4tGtUG", "author": "UWaterloo"}, {"text": "@juddrnaut @iDuchaine We are ready! Tweet away. (And welcome to UWaterloo! )", "author": "UWaterloo"}, {"text": "#UWaterloo researcher looks at how psychology and culture affect decisions about water. #WorldWaterDay http://t.co/XCKtsqMW7A", "author": "UWaterloo"}, {"text": "The final battle at the @CANFIRST robotics competition is close! Stop by the PAC now to check it out! #FRCWat http://t.co/OGsN5GUobF", "author": "UWaterloo"}, {"text": "#UWaterloo researchers are giving people a simple way to test their drinking water. #WorldWaterDay http://t.co/HBn4m5zkWv", "author": "UWaterloo"}, {"text": "Don’t miss the final day of @CANFIRST today! Winners will be announced at 4:30pm, good luck to all! #FRCWat. http://t.co/2oJ9f45fKt", "author": "UWaterloo"}, {"text": ".@CANFIRST happening today and tomorrow! RT @elpaguaga: @UWaterloo What engineering dreams are made of #FRCwat http://t.co/T0jilITgvP", "author": "UWaterloo"}, {"text": "Cool photo courtesy of @radulovic after a #UWaterloo lead resume workshop at Queen's College (Barbados). http://t.co/Blnq3R5yLY", "author": "UWaterloo"}, {"text": "@radulovic Very cool! Is this a UWaterloo lead workshop?", "author": "UWaterloo"}, {"text": "Wow! #UWaterloo co-op students earned more than $190 million in salary in 2012/13! http://t.co/NWtfRVbSMP #coopweek", "author": "UWaterloo"}, {"text": "Stop by the PAC today (and tomorrow) to see the @CANFIRST Robotic competition in person! #FRCWat http://t.co/A9aAB6N7bk", "author": "UWaterloo"}, {"text": "Today's #coopweek feature looks @envwaterloo student Samantha St Amour-Gomes who found her co-op in the Swiss Alps! http://t.co/eSkvKhoLBQ", "author": "UWaterloo"}, {"text": "Professor @EmmMacfarlane discusses the legacy of Jim Flaherty, in @globeandmail op-ed: http://t.co/y4fMtGAhJw", "author": "UWaterloo"}, {"text": "RT @kellymcmanus: Delighted to join the @UWaterloo team to celebrate @MayorBrenda on her final State of the City address #SOTC2014 http://t…", "author": "UWaterloo"}, {"text": "Some great pictures from day one of the @CANFIRST Robotic competition taking place in the PAC! #FRCWat  #UWaterloo http://t.co/qpow85l9uV", "author": "UWaterloo"}, {"text": "#UWaterloo prof says #Waterloo Region could support 2 @GOtransit train stations. http://t.co/5mUTdJ9Lbz", "author": "UWaterloo"}, {"text": "A big welcome to #UWaterloo for all the teams participating in the @CANFIRST  Robotic competition! #FRCWat https://t.co/129DT3mgud", "author": "UWaterloo"}, {"text": ".@UWaterlooDrama production\"From Solitary to Solidarity” (which begins tonight) featured on @CBCKW891 http://t.co/zE1zzopfQy", "author": "UWaterloo"}, {"text": "@DryToastWyatt Thanks for sharing we will send out a tweet too!", "author": "UWaterloo"}, {"text": ".@UWaterlooArts student Shivani Jivan shows us a great co-op can be found right on campus! #coopweek https://t.co/rGwAQ0I4ng", "author": "UWaterloo"}, {"text": "Admire the works of fourth-year fine arts students in their exhibition at the Waterloo Art Gallery, March 20- April 5 http://t.co/C6TVlCNziP", "author": "UWaterloo"}, {"text": "RT @envwaterloo: GEM prof Mike Stone among recipients of Excellence in #Water Stewardship Award http://t.co/8lEuddKntE", "author": "UWaterloo"}, {"text": "@u_waterloo Hi! Can you follow @UWaterloo so we can send you a DM? Thanks!", "author": "UWaterloo"}, {"text": "RT @InvestOntario: Two of the world’s top innovation universities partner to advance commercialization http://t.co/kTDml2iKCA @UWaterloo vi…", "author": "UWaterloo"}, {"text": "Did you miss any of the Strategic Plan Town Hall on #Research? Take a look at some of the highlights here; http://t.co/xtl2KSK3uv #uwth", "author": "UWaterloo"}, {"text": "Today's feature for National #coopweek is @MelodyT_UW who is getting artistic at @SproutGuerrilla https://t.co/LrH0nqTzwb", "author": "UWaterloo"}, {"text": "@LindzMD If you have any images or links to send we would be happy to promote the opening on social.", "author": "UWaterloo"}, {"text": "Check out the @CANFIRST robotic competition taking place in the PAC this weekend! #FRCWaterloo https://t.co/vpfa9TDULl", "author": "UWaterloo"}, {"text": "Congrats! RT @standuptostigma: Suzie, Kristin, and Stephanie representing @UWaterloo at @OntUniv Mental Health 2.0!  http://t.co/aYd7ugFWNX", "author": "UWaterloo"}, {"text": "Do you love #UWaterloo? Want to tell high school students why you love it? Become a #UWaterloo liaison officer: http://t.co/Nx1QlKJfZu", "author": "UWaterloo"}, {"text": "Watch Transformational Research Town Hall happening now via livestream and submit ?’s using #uwth or @UWaterlooLIVE http://t.co/XppkBTvHng", "author": "UWaterloo"}, {"text": "Special thanks to Michael Kuntz @UWResearch for his expertise on research at #UWaterloo. #uwth", "author": "UWaterloo"}, {"text": "It’s clear that research is a key component to the fabric of #UWaterloo! Let's keep the chat going during the Town Hall meeting. #UWTH", "author": "UWaterloo"}, {"text": "Last question! Q6: What do you think are some new research areas that Waterloo will lead in the future?  #uwth", "author": "UWaterloo"}, {"text": "@UWResearch Are new, evolving facilities necessary to attract  top researchers? #uwth", "author": "UWaterloo"}, {"text": "Q5: What do you think attracts faculty & student researchers to #UWaterloo? What can we do to keep and attract the best in the world? #uwth", "author": "UWaterloo"}, {"text": "@ConceptCrucible That is a great question for the Town Hall research team at 2pm. We will make sure to ask! #uwth", "author": "UWaterloo"}, {"text": "@EmmMacfarlane How do you think the University could better promote our researchers? Does it end at media support? #uwth", "author": "UWaterloo"}, {"text": "@SchlegelVillage Have you seen any good examples recently that stand out? #uwth", "author": "UWaterloo"}, {"text": "Q4: How could the University better promote its researchers and the work coming out of Waterloo? #uwth", "author": "UWaterloo"}, {"text": "@fauwaterloo Any specific channels you see #UWaterloo research regularly? #uwth", "author": "UWaterloo"}, {"text": "Q3: Has there been a piece of #UWaterloo based research that has inspired you? On what channels did you discover this research? #uwth", "author": "UWaterloo"}, {"text": "Waterloo has 40+ research institutes that conduct groundbreaking research and have learning opportunities  http://t.co/6tSICI5TUL #uwth", "author": "UWaterloo"}, {"text": "@Poindle Is there computer science research that stand out to you? Or specific researchers? #uwth", "author": "UWaterloo"}, {"text": "Q2: How can the relationship between teaching and research be strengthened to support all stakeholders? #uwth", "author": "UWaterloo"}, {"text": "For 5 years in a row #UWaterloo has been named Research University of the year among comprehensive universities. http://t.co/akvG1xr63t", "author": "UWaterloo"}, {"text": "Let's begin! Q1: Do you feel Waterloo is a globally recognized research institution? And if so, in what fields? #uwth", "author": "UWaterloo"}, {"text": "Use the Town Hall tag #uwth to participate in the chat and ask questions for Michael or the panel at the Town Hall at 2pm.", "author": "UWaterloo"}, {"text": "This chat will lead into the strat plan Town Hall meeting on Transformational Research at 2pm.  #uwth Watch here; http://t.co/DUDti0wDye", "author": "UWaterloo"}, {"text": "Michael Kuntz is Dir, Research Partnerships with the Office of Research and will be tweeting from @UWResearch http://t.co/HBXknOoSyL", "author": "UWaterloo"}, {"text": "Today’s Twitter Chat will look at the theme of “Transformational Research”. We'd like to welcome Michael Kuntz as our subject matter expert!", "author": "UWaterloo"}, {"text": "How will transformational research shape #UWaterloo’s global reputation? Join the live chat today between 1-2pm and Town Hall at 2pm. #UWTH", "author": "UWaterloo"}, {"text": "Congrats to @standuptostigma who finished 2nd in @OntUniv's Mental Health 2.0 contest! http://t.co/7ZRVSEVA2K #UWaterloo", "author": "UWaterloo"}, {"text": "Today's National #coopweek feature on Facebook takes place @Facebook! Featuring @WaterlooMath's @mpochwat & @awkpoon http://t.co/CKopqvDFXB", "author": "UWaterloo"}, {"text": "@mwasiqali The Twitter live chat is 1-2 transitioning to the actual Town Hall from 2-3.", "author": "UWaterloo"}, {"text": "How will transformational research shape #UWaterloo’s global reputation? Join the conversation via live chat today between 1-2pm #UWTH", "author": "UWaterloo"}, {"text": "RT @UWaterlooNews @UWaterloo & @TechnionLive partner to advance research, commercialization. Ceremony in Israel today http://t.co/7OGnK6YioZ", "author": "UWaterloo"}, {"text": "#UWaterloo grad launches @agenomics a consulting firm that specializes in money management and aging. http://t.co/TrsZsGjjHL", "author": "UWaterloo"}, {"text": "23 teams will visit #UWaterloo this weekend to compete for a berth at the @FRCTeams World Championship! #FRCWaterloo http://t.co/vokuHBew8H", "author": "UWaterloo"}, {"text": "How do #UWaterloo researchers help build the global reputation of the institution? Join us for a Twitter chat tomorrow at 1pm using #UWTH.", "author": "UWaterloo"}, {"text": "@inziirajput @UWaterlooPres What program are you interested in? Let us know and we can point you in the right direction!", "author": "UWaterloo"}, {"text": "For #Coopweek we are featuring 5 #UWaterloo co-op students doing cool things! Today @WaterlooENG's Denis Belov. http://t.co/dcaVYbQEPj", "author": "UWaterloo"}, {"text": "Happy St.Patrick's Day #UWaterloo! For those celebrating stay warm and stay safe. @citywaterloo tips for the day: http://t.co/MzwTxUQ9vQ", "author": "UWaterloo"}, {"text": "@elpaguaga Looking forward to having you on campus! If you get any great pics from #FRCWaterloo tag us, we would love to share them!", "author": "UWaterloo"}, {"text": "Join us for a live Twitter chat on March 18 from 1-2pm to talk about the role #research plays at #UWaterloo. Use #UWTH to follow along!", "author": "UWaterloo"}, {"text": "Last chance to Support #UWaterloo student #Canstruction teams by voting for their structures here: http://t.co/EAUGwt6RuV @FoodBankWatReg", "author": "UWaterloo"}, {"text": "@Yanoozaj I don't think our Registrars office would go for that! Check out our programs and how to apply here: http://t.co/jQQlvmq1n3", "author": "UWaterloo"}, {"text": "23 teams will visit #UWaterloo next weekend to compete for a berth at the @FRCTeams World Championship! #FRCWaterloo http://t.co/SH8ShXZ2N5", "author": "UWaterloo"}, {"text": "RT @kellymcmanus: This amazing team of @UWaterloo student volunteers were behind today's #TedXUW. Can't wait until 2015! http://t.co/vOTEjn…", "author": "UWaterloo"}, {"text": "Still time to check out the Livestream of #TEDxUW and some of the amazing speakers here: http://t.co/657YQINtu8", "author": "UWaterloo"}, {"text": "RT @amer_abukhajil: @UWaterloo is where ideas start, @TEDxUW is where ideas spread! Great words from the #TEDxUW Chair", "author": "UWaterloo"}, {"text": "@ljcoulter I know thats not really an answer but after providing the feedback it becomes a larger discussion we aren't privy to.", "author": "UWaterloo"}, {"text": "@ljcoulter We give IST all the comments from social to understand the impact of these outages. They would then assess their service provider", "author": "UWaterloo"}, {"text": "@zmanji Absolutely. It always seems to be the worst timing too. After LEARN issues we forward social comments to IST so appreciate feedback", "author": "UWaterloo"}, {"text": "@MichaelPells @sarahbayla @TheRahulM @arguela15 @xselenac LEARN error message has gone up on IST site: http://t.co/Dj3Zs5bymA", "author": "UWaterloo"}, {"text": "@zmanji How long had it been down for you?", "author": "UWaterloo"}, {"text": "@sarahbayla We have contacted IST to find out the issue. Hopefully we have an update soon.", "author": "UWaterloo"}, {"text": "@MichaelPells We haven't received a message from IST. We have reached out but haven't heard anything yet. Hopefully update soon!", "author": "UWaterloo"}, {"text": "@K_AHagan Looks good! Hopefully you had 3.14 pieces of pie!", "author": "UWaterloo"}, {"text": "@sarahbayla Is it still down for you? We usually get an email from IST when there is an issue but haven't received anything yet.", "author": "UWaterloo"}, {"text": "Are you managing a project? Working abroad? Making great connections? Share your co-op stories with us: Email communications@uwaterloo.ca", "author": "UWaterloo"}, {"text": "@jpeltzer Amazing! Looks like your co-workers are just as full of pie as our mathies!", "author": "UWaterloo"}, {"text": "Dear @WaterlooMath and #UWaterloo mathies everywhere, you are the apple to our Pi. #UWaterlooPi14 http://t.co/8ovlCfIUSc", "author": "UWaterloo"}, {"text": "VIDEO: @UWaterlooPres visits @UWVelocity startups @draftingSpace @VolteraInc @Planboard and more! http://t.co/E18vpWafku", "author": "UWaterloo"}, {"text": "@arda_ocal The tradition continues! @WaterlooMath students are lined up as we speak!", "author": "UWaterloo"}, {"text": "@JakePatterson99 On 3rd MC at 1:59 courtesy of @mathsoc and @WaterlooMath!", "author": "UWaterloo"}, {"text": "@iaboyeji Our Faculty of Engineering will be putting videos together, they have a team getting footage.", "author": "UWaterloo"}, {"text": "RT @QuantumIQC: More fun Pi facts: \"I prefer pi\" is a palindrome. #piday @Perimeter @UWaterloo @mathsoc #UWaterlooPi14", "author": "UWaterloo"}, {"text": "@brittrabs At 1:59 in MC @WaterlooMath has you covered!", "author": "UWaterloo"}, {"text": "@jamieson_erin It is true! At 1:59 in MC!", "author": "UWaterloo"}, {"text": "MT @citywaterloo: Avoid fines on #stpaddyswr. Follow #partysmart tips and you won't lose any green http://t.co/xCwzbyN2OA @UWaterloolife", "author": "UWaterloo"}, {"text": "Research Zdeno Chara's agent doesn't want you to see: #UWaterloo prof helps prove in the #NHL bigger isn't better. http://t.co/9lFEW6lTJU", "author": "UWaterloo"}, {"text": "Happy Pi Day #UWaterloo! Beware of @WaterlooMath students on a sugar rush at 1:59 today! #UWaterlooPi14", "author": "UWaterloo"}, {"text": "#UWaterloo Prof says public needs to be aware of sodium levels to make new menu legislation meaningful. http://t.co/KAdFHRIpU5 @AHSWaterloo", "author": "UWaterloo"}, {"text": "What are you doing for your co-op term? Email details and a picture to communications@uwaterloo.ca to be featured on Facebook or Instagram!", "author": "UWaterloo"}, {"text": "No ‘permanent El Niño,’ scientists say — and the tropics may get even hotter http://t.co/KE9mXtuvlv", "author": "Yale"}, {"text": "‘Synapses Lost and Found’ is theme of Gruber Science Fellowship Lecture http://t.co/Q9NGOelHyT", "author": "Yale"}, {"text": "Watch @yalemusic's award-winning \"Why Music?\" video: http://t.co/KJSf6uQRG0", "author": "Yale"}, {"text": "Congrats to @DeVitaDoctor on being named a fellow of American Association for Cancer Research Academy http://t.co/s8NPe9a2NR", "author": "Yale"}, {"text": "Students benefit from a little Monet with their math http://t.co/aGDQmuxmvr", "author": "Yale"}, {"text": "Two @WorldFellows alumni named 2014 Schwab Foundation Social Entrepreneurs http://t.co/vA28e3LM51", "author": "Yale"}, {"text": "Yale celebrates long-service anniversaries of 322 staff members http://t.co/2EwfESq9yF", "author": "Yale"}, {"text": "Deforestation of sandy soils a greater threat to climate change http://t.co/RLrua3MH2u", "author": "Yale"}, {"text": "RT @Yale_Alumni: Lots of #YaleAlumni interaction coming up today! Follow #YANAcon14 for the @Yale_Nonprofit conf in NYC, & @spizzwink for 1…", "author": "Yale"}, {"text": "#HIV successfully treated in prison and jail http://t.co/M08SWyQt36", "author": "Yale"}, {"text": "MT @YaleBritishArt: Opening today @ 4 pm: \"Art in Focus: Wales,\" a student-curated show. http://t.co/B5EVqURW3j http://t.co/DmDYK2po9o", "author": "Yale"}, {"text": "TOMORROW: Critical Race Theory Conference: \"Re-Envisioning Race in a 'Post-Racial' Era\" http://t.co/6tGQm2p1h6", "author": "Yale"}, {"text": "MT @YaleFES: TODAY at 4:30: Naturalist Doug Peacock at @YaleFES to discuss threats to Yellowstone's grizzly bears http://t.co/TGLE6FXe7Y", "author": "Yale"}, {"text": "Lineup for the International Festival of @ArtIdea just announced. http://t.co/C8iRp4oE3b #artnhv", "author": "Yale"}, {"text": "Deforestation of sandy soils a greater threat to climate change http://t.co/RLrua3MH2u", "author": "Yale"}, {"text": "No ‘permanent El Niño,’ scientists say — and the tropics may get even hotter http://t.co/KE9mXtuvlv", "author": "Yale"}, {"text": "Sankofa54: Youth Empowerment Conference starts today and will feature talk by Nobel laureate Leymah Gbowee http://t.co/MhPMEoukne", "author": "Yale"}, {"text": "MT @yalemusic: Proud to have won Internet Advertising Awards for Why Music? vid. Read: http://t.co/aXKgdmIjgH Watch: http://t.co/ckWkvcxghK", "author": "Yale"}, {"text": "\"Adoption Gap\": looking at the need & challenge of introducing improved cookstoves into homes of the world's poor http://t.co/a0XUXCcrTI", "author": "Yale"}, {"text": "MT @YaleCancer: Congrats to @DeVitaDoctor & distinguished peers on being inducted as Fellows of the AACR Academy Class of 2014 #aacr14", "author": "Yale"}, {"text": "Today at 2:30: Photojournalist Christian Ziegler on “Documenting tropical biodiversity and conservation” #YalePoynter http://t.co/j999YTCCF8", "author": "Yale"}, {"text": "RT @YaleE360: New satellite boosts research on global rainfall and climate -- new report from @YaleE360 http://t.co/2o5mpFyRvF", "author": "Yale"}, {"text": "Yale Cancer Center named lead site by the National Cancer Institute in new National Clinical Trials Network http://t.co/KuuKB4DpB9", "author": "Yale"}, {"text": "Yale honors its long-serving staff http://t.co/aWuzduN0Wr", "author": "Yale"}, {"text": "Using more wood for construction can slash global reliance on fossil fuels http://t.co/EYJtgxIZ0A", "author": "Yale"}, {"text": "RT @YaleE360: Delaware River watershed is focus of large-scale restoration project", "author": "Yale"}, {"text": "Harkness Tower is glowing blue in honor of World Autism Awareness Day. http://t.co/czbTXWr7qs http://t.co/TR7bNwN1hs", "author": "Yale"}, {"text": "Bulldog Blitz Live! Yalies are in NYC helping to secure Alumni Fund contributions. http://t.co/LusQVa41eq http://t.co/9X4QgNn1GX", "author": "Yale"}, {"text": "Research in the News: In the mind of a mouse: A Jackson Pollock? http://t.co/TE4N2GhxGP", "author": "Yale"}, {"text": "MT @YaleDivSchool: TONIGHT at 5:30p: After Cloven Tongues of Fire - Protestant Liberalism in Modern American History http://t.co/Hd0GxHvTAx", "author": "Yale"}, {"text": "RT @YaleGlobal: TV news entertains? Curiosity reveals empathy; focus on #MH370, not victims of civil war in #Syria: http://t.co/YUJwwhpyfZ", "author": "Yale"}, {"text": "MT @YaleMed: Relive the excitement of Match Day 2014--and check out the YaleMed channel on YouTube! http://t.co/rexh3pyENv #Match2014", "author": "Yale"}, {"text": "TODAY: Former Ukrainian ambassador to discuss Crimea crisis at symposium http://t.co/8VSDjGhCC9", "author": "Yale"}, {"text": "Students benefit from a little Monet with their math http://t.co/aGDQmuxmvr", "author": "Yale"}, {"text": "RT @YaleGlobal: Global corporate interests prefer candidate in #India who manages #corruption in predictable way: http://t.co/rlG9u0xOBu", "author": "Yale"}, {"text": "TOMORROW: “Documenting tropical biodiversity and conservation” with photojournalist Christian Ziegler #YalePoynter http://t.co/j999YTCCF8", "author": "Yale"}, {"text": "RT @YaleGlobal: #SaudiaArabia is vexed at shifting balance of oil power; ally US turns into competitor: http://t.co/HajPJ18gWU", "author": "Yale"}, {"text": "Today at 4:30: @tunkuv on the \"Essential American Reading List\" #YalePoynter http://t.co/B8sKynmPMw", "author": "Yale"}, {"text": "Now on display: Newly restored portrait of Elihu Yale http://t.co/h9iIRCN4ga", "author": "Yale"}, {"text": "Today at 4:30: \"Latino New York\" with @dgbxny #YalePoynter http://t.co/SJf4IObjlq", "author": "Yale"}, {"text": "TODAY at 3:45: Mental Health & Wellness on Campus @paceuniversity. Watch live. @marcbrackett speaking. #myhealthyU http://t.co/k9ulPPnMnH", "author": "Yale"}, {"text": "Watch  now & tweet us your questions: Nobelist Jim Rothman on a life in science http://t.co/aKejr55qla", "author": "Yale"}, {"text": "\"Political dissent? Yale panel says there’s an app for that\" via @nhregister http://t.co/0w0DTLQk6e", "author": "Yale"}, {"text": "Say hello to Elly the Yale! Discovered by Yale scientists in a remote forest, Elly is now free to roam campus. http://t.co/QJpDYJCNnY", "author": "Yale"}, {"text": "Research in the News: After a rough period, new era for psychiatry is at hand http://t.co/faVkYNipnb", "author": "Yale"}, {"text": "MT @RebekaRyvola: TONIGHT: #EFFY2014 opening night is at home at @YaleFES: Kroon Hall, 7pm // Full schedule here: http://t.co/0bvIQM2co8", "author": "Yale"}, {"text": "TOMORROW: \"Latino New York\" with @dgbxny #YalePoynter http://t.co/SJf4IObjlq", "author": "Yale"}, {"text": "TOMORROW:  @nytimes columnist & Pulitzer Prize-winning author @tomfriedman to speak at @YaleSOM http://t.co/YOCvxr7Qzn", "author": "Yale"}, {"text": "Tweet us your questions for Nobelist Jim Rothman and he'll answer them live tomorrow at noon http://t.co/UKxr7nZeKA", "author": "Yale"}, {"text": "Today at 1:30: Yale Symposium on the 20th Anniversary of the Genocide against the Tutsi in Rwanda http://t.co/wrytIAMDQm", "author": "Yale"}, {"text": "Conference focusing on change in Africa to feature talk by Nobel laureate Leymah Gbowee http://t.co/MhPMEoukne", "author": "Yale"}, {"text": "\"Political dissent? Yale panel says there’s an app for that\" via @nhregister http://t.co/0w0DTLQk6e", "author": "Yale"}, {"text": "Today is the final day to register for the Yale Asian Alumni Reunion http://t.co/2tRLnfG73D #YAAR14 #YaleAlumni", "author": "Yale"}, {"text": "TOMORROW: “An Essential American Reading List: An Immigrant's Guide to the (Conservative) American Soul” #YalePoynter http://t.co/B8sKynmPMw", "author": "Yale"}, {"text": "WEDNESDAY: Former Ukrainian ambassador to discuss Crimea crisis at symposium http://t.co/8VSDjGhCC9", "author": "Yale"}, {"text": "RT @rulerapproach: @marcbrackett meets @DeborahLTillman the #Supernanny. http://t.co/2i9v7NKDFK", "author": "Yale"}, {"text": "Have a question about a life in science? Ask Nobelist Jim Rothman  http://t.co/UKxr7nZeKA", "author": "Yale"}, {"text": "The Yale Alumni Fund’s Bulldog Blitz is on! Take the challenge: http://t.co/LusQVa41eq", "author": "Yale"}, {"text": "#HBD @Jeopardy! Read about when the quiz show came to campus in 2003: http://t.co/2evBNLDL4m http://t.co/WGhfspIU40", "author": "Yale"}, {"text": "Highlights from the Jazz Collections in the Gilmore Music Library http://t.co/ExZXgz9zBA", "author": "Yale"}, {"text": "Bringing the excitement of science to kids of all ages http://t.co/loNjd8Qrss", "author": "Yale"}, {"text": "Conference focusing on change in Africa to feature talk by Nobel laureate http://t.co/MhPMEoukne", "author": "Yale"}, {"text": "Yale alumnus Michael Marshall wins @WashBizOnline Minority Business Leader Award http://t.co/nKOql3UoYf #YaleAlumni", "author": "Yale"}, {"text": "Today's @TEDxYALE includes @RobertJShiller, @ehbyale, @SarahMDemers, @abhinavnayar, @Jen_Kramer & more: http://t.co/D0f5VjR9P6", "author": "Yale"}, {"text": "RT @YaleGlobal: Google research: State-sponsored #hackers attack #journalists for criticizing the powerful: http://t.co/CHHkX1d6wQ", "author": "Yale"}, {"text": "RT @YaleE360: On Ravaged Tar Sands Lands, Big Challenges for Reclamation. Read @YaleE360's report: http://t.co/rA6JchYgGp", "author": "Yale"}, {"text": "Saturday's @TEDxYALE includes @RobertJShiller, @ehbyale, @SarahMDemers, @abhinavnayar, @Jen_Kramer. Full lineup & tix http://t.co/D0f5VjR9P6", "author": "Yale"}, {"text": "RT @ISPSYale: Lobbying reform: it's not just about access, Lara Chausow writes @Yalegsas http://t.co/AKL8NOAWzt", "author": "Yale"}, {"text": "Most cancer survivors not exercising enough to benefit http://t.co/tdcT6FK5fv", "author": "Yale"}, {"text": "Students benefit from a little Monet with their math http://t.co/aGDQmuxmvr", "author": "Yale"}, {"text": "MT @YaleFES: China-India smog rivalry a sign of global menace http://t.co/u2Z2OGJWG2", "author": "Yale"}, {"text": "Yale partners with #Ghana to eliminate mother-to-child HIV transmission http://t.co/ZYTSjQTdik", "author": "Yale"}, {"text": "Yale appoints two successor trustees http://t.co/IkBhIXGGLm", "author": "Yale"}, {"text": "RT @YaleUGA: Decisions are now live. WELCOME TO YALE, CLASS OF 2018! #Yale2018", "author": "Yale"}, {"text": "Congratulations to the newly admitted members of the Yale Class of 2018! #Yale2018 http://t.co/m2JsmU97zL", "author": "Yale"}, {"text": "Have a question about a life in science? Ask Nobelist Jim Rothman  http://t.co/UKxr7nZeKA", "author": "Yale"}, {"text": "Check out the complete line-up for @TEDxYALE 2014 http://t.co/zE28TnShC8 & reserve tickets for Saturday here: http://t.co/CNTbDIpsV9", "author": "Yale"}, {"text": "Yale researchers reconstruct facial images locked in a viewer’s mind http://t.co/sxJoX1NwQN", "author": "Yale"}, {"text": "TODAY at 3: Sarah Stillman of @NewYorker discusses turning complex legal issues into readable narratives #YalePoynter http://t.co/sJMXsSpebB", "author": "Yale"}, {"text": "Strobel reappointed as vice president for @YaleWestCampus http://t.co/ORguwYPYVe", "author": "Yale"}, {"text": "MT @YaleSOM: TODAY: Yale community is invited to a Leaders Forum event w/ @Zagat founders Tim & Nina Zagat '66 YLS. http://t.co/c9r66ktcJq", "author": "Yale"}, {"text": "TOMORROW: @eddieizzard previews his 'Force Majeure' show LIVE in German, French, and English. http://t.co/v2Y058t2Vy", "author": "Yale"}, {"text": "Take 5 with Pianist Melvin Chen http://t.co/qyA6tEuaP1", "author": "Yale"}, {"text": "MT @yaleseas: In the future, you might use your own stem cells to repair damaged lung tissue: http://t.co/uLfvv8A8gc", "author": "Yale"}, {"text": "#NHV Restaurant Week returns April 6–11 http://t.co/XyAPYlR7W3", "author": "Yale"}, {"text": "MT @YaleSOM: Why do we give bad gifts? Research by Prof Nathan Novemsky & doctoral student Ernest Baskin may explain. http://t.co/jXH6BxM6wx", "author": "Yale"}, {"text": "RT @YaleGlobal: #Putin regards annexation of Crimea as national interest, shrugs at sanctions: http://t.co/Rhm1nGBeMj", "author": "Yale"}, {"text": "MT @YaleSOM: Applying microfinance to water issues in the developing world, @Water's CEO Gary White on @WaterCredit: http://t.co/IZu68kLy1o", "author": "Yale"}, {"text": "Have a question about a life in science? Ask Nobelist Jim Rothman  http://t.co/UKxr7nZeKA", "author": "Yale"}, {"text": "Check out the complete line-up for @TEDxYALE 2014 http://t.co/zE28TnShC8 & reserve tickets for Saturday here: http://t.co/CNTbDIpsV9", "author": "Yale"}, {"text": "RT @YaleSOM: Can pharma reinvent itself? A #YaleInsights interview with Clive Meanwell, CEO of The Medicines Company. http://t.co/H24x3XGeDZ", "author": "Yale"}, {"text": "‘Paying it forward’: Number of Yale donors to United Way campaign jumps 12.5% http://t.co/qwzvtNSsyK", "author": "Yale"}, {"text": "“This is my home, I think of myself as of New Haven as much as I think of myself as of Yale.” — Peter Salovey http://t.co/0djrYLwQGh", "author": "Yale"}, {"text": "TOMORROW: Award-winning sociologist to give 2014 Tanner Lectures on Human Values http://t.co/jPZIBHzBLr", "author": "Yale"}, {"text": "WATCH NOW: Yale expert to consider ‘Does Democracy Promotion Promote Democracy?’ http://t.co/RIS6FjNExK", "author": "Yale"}, {"text": "MT @YaleFES: \"We cannot know exactly what is coming, but it will be nasty\" new UN climate report to say http://t.co/TjsePZsC29 via @YaleE360", "author": "Yale"}, {"text": "RT @yalemusic: Very happy to welcome the Miró Quartet to perform Beethoven, Schubert + Dutilleux tonight! http://t.co/TtIBrQzsLl", "author": "Yale"}, {"text": "MT @YaleBooks: A glimpse into a teen's socially connected mind. Watch #ItsComplicated author @zephoria talk. http://t.co/gdFUMcMHp2", "author": "Yale"}, {"text": "A long—and lean—life for mice missing just one gene http://t.co/WCzAxdz1EX", "author": "Yale"}, {"text": "MT @YaleBritishArt: #Sketch in the galleries tomorrow at 5:30. Preregister for this free event. Materials provided. http://t.co/iozKuHDHia", "author": "Yale"}, {"text": "Former Ukrainian ambassador to discuss Crimea crisis at symposium http://t.co/8VSDjGhCC9", "author": "Yale"}, {"text": "Reunion to celebrate 160 years of Asian alumni at Yale  http://t.co/Mg3gamB9L1 #YAAR14 #YaleAlumni", "author": "Yale"}, {"text": "RT @TEDxYALE: We've announced our full line-up of 2014 speakers! Check them out on our website http://t.co/4JZv0bnEvx #ExploringtheFootnotes", "author": "Yale"}, {"text": "Former president Richard C. Levin to join online education venture @coursera http://t.co/zIAYxNlqyv", "author": "Yale"}, {"text": "RT @YaleAthletics: WSAIL: No. 1 Bulldogs Return from Spring Break Undefeated http://t.co/6z6By20toF", "author": "Yale"}, {"text": "RT @yaleseas: Some spring breakers go to cancun, but @Yale students keep busy with a lot more than beach volleyball: http://t.co/4UDuYt30fy", "author": "Yale"}, {"text": "MT @yalemusic: Congrats to David Lang & Alvin Singleton on being elected to the American Academy of Arts and Letters! http://t.co/Wc8rtBRg1m", "author": "Yale"}, {"text": "MT @YaleSOM: Rafael '14 on making sustainable bamboo bikes with @bambike for Global Social Entrepreneurship course. http://t.co/HUeXekUwfm", "author": "Yale"}, {"text": "A key link between tumors and healthy tissue identified http://t.co/1TeW82bJcR", "author": "Yale"}, {"text": "RT @YaleE360: CO2 levels have crossed the 400 ppm threshold far earlier this year, may soon stay there permanently: http://t.co/UbJjNlOq05", "author": "Yale"}, {"text": "Urban Resources Initiative at @YaleFES receives state funds for outreach http://t.co/Q7yPj72PHr", "author": "Yale"}, {"text": "TOMORROW: Yale expert to consider ‘Does Democracy Promotion Promote Democracy?’ http://t.co/iFMt1xNJfu", "author": "Yale"}, {"text": "The definitive guide to New Haven pizza http://t.co/wVM6kmkZHn #NHV via @modernamy @Eater", "author": "Yale"}, {"text": "Yale Cancer Center/Smilow Cancer Hospital named National Comprehensive Cancer Network Member Institution http://t.co/hRb3efl1xZ", "author": "Yale"}, {"text": "Yale Sends Two Swimmers to NCAAs http://t.co/hFgvnNCCNv", "author": "Yale"}, {"text": "Reunion to celebrate 160 years of Asian alumni at Yale #YAAR14 http://t.co/Mg3gamB9L1", "author": "Yale"}, {"text": "Fossil porpoise has a chin for the ages http://t.co/OtworXZArV", "author": "Yale"}, {"text": "Measles outbreak highlights importance of vaccination http://t.co/cSwfK776xH", "author": "Yale"}, {"text": "Found: Tiny ancient crustaceans, buried alive with eggs and embryos http://t.co/FQc6TwEHEt", "author": "Yale"}, {"text": "MT @YaleDivSchool: In memoriam: Professor Emeritus Rowan Greer, ’56 BA, ’64 MA, ’65 PhD, patristics scholar & priest http://t.co/DbQDdxXMaW", "author": "Yale"}, {"text": "How age opens the gates for Alzheimer’s http://t.co/6Lr5LYHQnW", "author": "Yale"}, {"text": "RT @yalerep: Just announced! Yale Rep 2014-15: two modern masterpieces and three commissioned world premieres!  http://t.co/cbDSP5uKgN", "author": "Yale"}, {"text": "Happy World #PoetryDay http://t.co/9Hp7aa5eOj", "author": "Yale"}, {"text": "RT @YaleSOM: Missed the SOM Alumni Panel on contemporary healthcare issues? Watch here: http://t.co/lq9Wf7tGAA #YaleSOMAlumni #YaleAlumni", "author": "Yale"}, {"text": "#NHV Restaurant Week returns April 6–11 http://t.co/iT1wID8PpF", "author": "Yale"}, {"text": "RT @bengoldfarb13: Check out the killer lineup for @Yale_EFFY film fest! Gonna be an awesome spring at @YaleFES: http://t.co/LgUwWwAtKy", "author": "Yale"}, {"text": "MT @YaleFES: Student team from @YaleFES wins best proposal in 2 categories in Dept of Energy Competition http://t.co/7FoyPjsT0X", "author": "Yale"}, {"text": "RT @YaleMed: Congrats to all those matching from—and at—YaleMed today. And good luck on the road ahead! #match2014", "author": "Yale"}, {"text": "Measles outbreak highlights importance of vaccination http://t.co/cSwfK776xH", "author": "Yale"}, {"text": "First Calabresi Prize honors cardiovascular researcher http://t.co/xk04VNnDIr", "author": "Yale"}, {"text": "Award-winning sociologist to give 2014 Tanner Lectures on Human Values http://t.co/jPZIBHzBLr", "author": "Yale"}, {"text": "RT @YaleGlobal: Big new urban data sets offer clues on which cities are greener - big or small, rich or poor?: http://t.co/oozBk6fM3a", "author": "Yale"}, {"text": "Yale hockey forward Agostino signs with Calgary http://t.co/7MDlERKdnR", "author": "Yale"}, {"text": "NIH director salutes Yale’s Arnsten for research on stress and the brain http://t.co/4JWmAjhKJD", "author": "Yale"}, {"text": "RT @YaleSOM: What's next for social enterprise? Living Goods founder Chuck Slaughter '90 talks to @YaleInsights http://t.co/fqwt35kCUB", "author": "Yale"}, {"text": "Yale Printing and Publishing Services strives for sustainability http://t.co/4HEyvuo1MU", "author": "Yale"}, {"text": "Yale Publishing Course fosters industry insights and global connections http://t.co/E5o6LgY5RN", "author": "Yale"}, {"text": "Yale Cancer Center/Smilow Cancer Hospital named National Comprehensive Cancer Network Member Institution http://t.co/hRb3efl1xZ", "author": "Yale"}, {"text": "In Memoriam: Yale benefactor Mitch Leigh ’51 BM, ’52 MM http://t.co/OHZ6s1iH5C", "author": "Yale"}, {"text": "RT @YaleFES: Rumphius’s poison tree and ‘the Orient’ in western imagination http://t.co/b12Gr3Mq6p", "author": "Yale"}, {"text": "Provost visits Peck Place's new home on @YaleWestCampus http://t.co/7bWZaYyzYg", "author": "Yale"}, {"text": "Research in the News: Spending more does not necessarily mean better results for heart health http://t.co/8A9gdbHbxW", "author": "Yale"}, {"text": "RT @YaleFES: NPR's @WhereWeLive featured @YaleClimateComm's Anthony Leiserowitz and @ParkerLiautaud, @yale student/climate cmpgner http://t…", "author": "Yale"}, {"text": "MT @YaleFES: At #58CSW, Rebeka Ryvola MEM '14 addressed gender, disaster risk reduction & climate change development http://t.co/OGdENGhmiV", "author": "Yale"}, {"text": "RT @YaleGlobal: Method for unity or stagnation? Consensus expected  for appt of #EuropeanCommission president: http://t.co/3IHsEgj4dk", "author": "Yale"}, {"text": "RT @yalemusic: Meet our latest Teaching Artist of the Week: guitarist Ian Tuski '15MM. http://t.co/husVuTpu6T", "author": "Yale"}, {"text": "MT @yalemusic: We're collaborating with @yaledrama for a fresh translation+production of Stravinsky's Soldier’s Tale: http://t.co/4a9PGkGPF7", "author": "Yale"}, {"text": "NEXT WEEK: Yale expert to consider ‘Does Democracy Promotion Promote Democracy?’ http://t.co/iFMt1xNJfu", "author": "Yale"}, {"text": "MT @yaledrama: 4/5 of @yalerep's 2014-15 directors are female, 3 are School of Drama grads, 4th is chair of directing http://t.co/1r8PE3AqPM", "author": "Yale"}, {"text": "RT @yalemusic: Read about the restoration of the Newberry Memorial Organ @yaleism @yalemusic @Yale http://t.co/PjvSXrg99M #NHV #gscia", "author": "Yale"}, {"text": "RT @YaleLawSch: Professor Peter Schuck on Obamacare's Market Problem via @HuffingtonPost http://t.co/A3zh9FpgiS", "author": "Yale"}, {"text": "Commonly used drugs may not be effective against autoimmune illness http://t.co/G2HDBcnjwj", "author": "Yale"}, {"text": "RT @YaleE360: Once-stable northeast Greenland glaciers are now melting rapidly, researchers say http://t.co/EIs5yifhbv", "author": "Yale"}, {"text": "MT @ysfp: Preservation at its Sweetest: Shizue RocheAdachi '15 candies #Yale Farm tropical roots - ginger & galangal http://t.co/QeVDrNy9Ga", "author": "Yale"}, {"text": "RT @YaleChina: Check out our Fireside Chat featuring Stephen Roach #China #economy #nonprofits  http://t.co/BYDVkhHhc8", "author": "Yale"}, {"text": "RT @YaleSPH: 23 Downs Fellows prepare for international health research this summer.  http://t.co/DjpnSAR5Cy @yaleGH http://t.co/zXTlYsXm5H", "author": "Yale"}, {"text": "How age opens the gates for Alzheimer’s http://t.co/6Lr5LYHQnW", "author": "Yale"}, {"text": "RT @yalerep: Just announced! Yale Rep 2014-15: two modern masterpieces and three commissioned world premieres!  http://t.co/cbDSP5uKgN", "author": "Yale"}, {"text": "Expert in conservation science to head Institute for the Preservation of Cultural Heritage at @YaleWestCampus http://t.co/fVYdKt8ooW", "author": "Yale"}, {"text": "Reunion to celebrate 160 years of Asian alumni at Yale  http://t.co/Mg3gamB9L1 #YAAR14 #YaleAlumni", "author": "Yale"}, {"text": "Today: @YaleCancer / @YNHH elected to join @NCCNMeetings alliance of leading cancer centers http://t.co/yVqEAbtMm6", "author": "Yale"}, {"text": "Breaking new ground: Yale team implants human innate immune cells in mice http://t.co/RFttN6x2Sc", "author": "Yale"}, {"text": "Found: Tiny ancient crustaceans, buried alive with eggs and embryos http://t.co/FQc6TwEHEt", "author": "Yale"}, {"text": "Research in the News: Practicality trumps desirability in gift giving http://t.co/Ge88CMPNmZ", "author": "Yale"}, {"text": "RT @YaleLawSch: Bernstein Symposium to Focus on Street #Activism and #HumanRights. http://t.co/qvSFKVkAGU", "author": "Yale"}, {"text": "MT @YaleSOM: Celebrity touch raises auction prices, according to a study co-authored by Prof George Newman. http://t.co/iG6pt9m4Jn", "author": "Yale"}, {"text": "RT @Yalemediaforum: NEW VIDEO: California Drought: Natural or Man Made? http://t.co/53L92PBFW4 #climate #globalwarming #CADrought", "author": "Yale"}, {"text": "Congratulations to Chimamanda Ngozie Adichie MA '08 on winning a National Critics Book award. http://t.co/xbJbQlIZPw", "author": "Yale"}, {"text": "RT @YaleE360: Rebuilding the Natural World: A Shift in Ecological Restoration, Richard Conniff reports for @YaleE360  http://t.co/4bhojAzfj1", "author": "Yale"}, {"text": "Fossil porpoise has a chin for the ages http://t.co/OtworXZArV", "author": "Yale"}, {"text": "Thirty Yale students selected for @YEItweets Tech Bootcamp http://t.co/mtMRAL281x", "author": "Yale"}, {"text": "Students’ community outreach helps smooth #Obamacare rollout http://t.co/6bdFXPb0uG", "author": "Yale"}, {"text": ".@yaleism celebrates 40 years of ‘creativity and collaboration’ http://t.co/VZMCvZFqci", "author": "Yale"}, {"text": "Yale expert to consider ‘Does Democracy Promotion Promote Democracy?’ http://t.co/iFMt1xNJfu", "author": "Yale"}, {"text": "Levels of key brain chemicals predict children’s reading ability http://t.co/uSjCQXqMmC", "author": "Yale"}, {"text": "Cheaper, more aggressive prostate cancer treatment may also be riskier http://t.co/J9wIurlfbv  #health", "author": "Yale"}, {"text": "Happenings at Yale’s museums and galleries during the spring break http://t.co/up5uWhiCx5", "author": "Yale"}, {"text": "New Haven residents: Request a free tree for your street or front yard http://t.co/1pOhU2QVq5 #NHV", "author": "Yale"}, {"text": "Yale men's hockey team honored at @WhiteHouse http://t.co/GYnVejH9F8", "author": "Yale"}, {"text": "Yale roots of New Haven startup Arvinas featured in biotech journal http://t.co/DHqIdiCwKu", "author": "Yale"}, {"text": "Yale diagram is part of British Library’s ‘Beautiful Science’ exhibit http://t.co/HYexOSVACV", "author": "Yale"}, {"text": "Serving time among the underserved http://t.co/R9tYsqoop5", "author": "Yale"}, {"text": "What’s in the air of Nepal? Ph.D. candidate researches pollution data http://t.co/aFU3EEQoAR", "author": "Yale"}, {"text": "Research in the News: Practicality trumps desirability in gift giving http://t.co/Ge88CMPNmZ", "author": "Yale"}, {"text": "MT @Boola_Bulldog: Video from @YaleAllAccess of an incredible goal by Yale's Jimmy Craft http://t.co/NeHuscbq5F", "author": "Yale"}, {"text": "RT @YaleE360: In the Pastures of Colombia,  Cows, Crops and Timber Coexist. @Lisa_Palmer reports for @YaleE360 http://t.co/29HFiYW692", "author": "Yale"}, {"text": "TODAY: Himalayan Studies Conference at Yale:", "author": "Yale"}, {"text": "Levels of key brain chemicals predict children’s reading ability http://t.co/uSjCQXqMmC", "author": "Yale"}, {"text": "Yale expert to consider ‘Does Democracy Promotion Promote Democracy?’ http://t.co/iFMt1xNJfu", "author": "Yale"}, {"text": "TOMORROW: World premiere of #ThesePaperBullets at the @yalerep http://t.co/ekfGL57J1Z", "author": "Yale"}, {"text": "Happenings at Yale’s museums and galleries during the spring break http://t.co/up5uWhiCx5", "author": "Yale"}, {"text": "Yale physician finds new homes for used wheelchairs, walkers, and other medical supplies http://t.co/4Z3HjjxWDY", "author": "Yale"}, {"text": "MT @YaleSOM: Can #bigdata make healthcare more effective? A panel of experts on \"Evolution of Healthcare in the U.S.\" http://t.co/JkPy7yE5ch", "author": "Yale"}, {"text": "In conversation: Charles Musser on documentary filmmaking http://t.co/oWvzEDBlA3", "author": "Yale"}, {"text": "RT @YaleFES: How saving daylight wastes energy: @YaleFES Matthew J. Kotchen in the @nytimes http://t.co/cY5fncNBrb", "author": "Yale"}, {"text": "RT @YaleGlobal: For #Fracking industry, #regulation is a must to get past bans; Obama should repeat Cheney strategy?: http://t.co/q8AUT3eIyo", "author": "Yale"}, {"text": "RT @YaleGlobal: Globally, #women outnumber men in university attendance, graduation #HigherEd: http://t.co/nx0sFgX5Xr", "author": "Yale"}, {"text": "The World Wide Web turns 25. Here's what Yale's \"front door\" looked like in 1996. #Web25 http://t.co/PLGYmC4pmQ", "author": "Yale"}, {"text": "Tonight at 7: \"A Feathered River Across the Sky\": @FieldMuseum's Joel Greenberg on the passenger pigeon's  extinction http://t.co/yCbUp1ajPE", "author": "Yale"}, {"text": "MT @YaleMed: TODAY at 5: How is changing health care economy affecting us? Come hear @AGJepsen, YMG's CEO, discuss. http://t.co/ymeHmRvOb3", "author": "Yale"}]